[{"text": "\"The dropout\"﻿", "time": "2 days ago", "author": "Dan Mate", "cid": "UgwEXBu589_c9CSmlDN4AaABAg"},
{"text": "I'm back﻿", "time": "3 days ago", "author": "Steve Jobs", "cid": "Ugw-o9Ghbse0ahM-iqZ4AaABAg"},
{"text": "if they actually make a better GMO, that would be one thing.  so far, Monsanto has mostly made GMO's that are able to tolerate massive pesticides, which is NOT ok.﻿", "time": "1 week ago", "author": "Richard Shapiro", "cid": "Ugw58urAdwFXGxSVx6t4AaABAg"},
{"text": "WOW! His ankle can talk?????﻿", "time": "3 weeks ago", "author": "KOOL BRO", "cid": "UgzVoJaCJWLFcrq9Qud4AaABAg"},
{"text": "How much does a Co ankle make﻿", "time": "3 weeks ago", "author": "Rusty Fondleberg", "cid": "UgwYEOrnSE2r4mZGrX14AaABAg"},
{"text": "GMOs are bad for you.﻿", "time": "4 weeks ago", "author": "tubenachos", "cid": "UgySG56JuqASu0Qeqi94AaABAg"},
{"text": "tubenachos false﻿", "time": "2 weeks ago", "author": "Dom Anca", "cid": "UgySG56JuqASu0Qeqi94AaABAg.8aEjI2S3qjE8akrVbDCqJ-"},
{"text": "All those years of crushing foes, who would ever have guessed that Bill Gates was such a great humanitarian? Has there ever been a billionaire (other than Carnegie an Buffet, perhaps) who gave it all up and started handing out monies to charities in the latter part of his life?﻿", "time": "4 weeks ago", "author": "Darrin Nunyah", "cid": "Ugwibr8XlnYLwitJI154AaABAg"},
{"text": "Monsanto seeds don't grow.﻿", "time": "4 weeks ago", "author": "Wasiq Imran", "cid": "UgwMXPgW4-b2FwIZSwd4AaABAg"},
{"text": "Buddy needs to run for president﻿", "time": "1 month ago", "author": "Rae Lindquist", "cid": "UgwFLFFW2QVYn6E6MmJ4AaABAg"},
{"text": "the first thing that pops up hearing bill gates is ZIKA VIRUS, operation orange and you dont know what this means they will get you.﻿", "time": "1 month ago", "author": "Ash Sen", "cid": "Ugz3knzww2Yv0ZSXCYN4AaABAg"},
{"text": "If you have a problem with GMOs you're either ignorant or have educated yourself with false anti GMO data via the internet﻿", "time": "1 month ago", "author": "Casey Campbell", "cid": "Ugxy7ZSTUmG2gv5DXOJ4AaABAg"},
{"text": "GMO crops will be the answer to stopping famine around the world i believe famine would of already be stopped all together by now but no one will give them a chance all they believe is the crap they are being told from the company's that profit of people starving. Also governments in poor nations are not helping what so ever either since if you give people food people will become richer and smarter and with that people think for them selves and might rebel against all the repressive governments, by keeping your population hungry you keep your population weak which means they wouldn't have the power to over through governments﻿", "time": "1 month ago", "author": "JARVHD", "cid": "UgzUufKQKISUfXaJJUR4AaABAg"},
{"text": "3:35﻿", "time": "1 month ago", "author": "Raiden Entertainment", "cid": "Ugx-2XnfWGs4pa1uMKt4AaABAg"},
{"text": "Bill Gates is a scum bag Freemason!﻿", "time": "1 month ago", "author": "Dan Survivor", "cid": "UgzI-rUNaYBNR1cuuWN4AaABAg"},
{"text": "I love how so many people hate on GMO products meanwhile some starving person in a third world country could literally die if they don't eat today.  Do you really think they care if the food is GMO? Non-GMO - organic ? Natural?  NO!﻿", "time": "1 month ago", "author": "Zem Zem", "cid": "Ugw21WTFPGVKvsxq9TJ4AaABAg"},
{"text": "The public masses are so easily susceptible to idiocy.  Do you honestly think Bill Gates is an altruistic billionaire saint?  He's partnered and funds MONSANTO.  If you have any knowledge of this company, you would think otherwise of \"heroic\" Bill's telos.  Even in this video, it stated Monsanto, has patents owning both the GMO seeds and the pesticides.  That is spiritually profane, morally abhorrent, and ethically deplorable.   Oh and his beautiful wife: Melinda Gates.  What an angel, oh my; do you honestly think she would have married Bill if he was not Bill Gates?  Honestly....get real...get educated.  It is cliche to refer to the masses as sheeple, and I might be one as well, who knows? Considering one cannot necessarily and pragmatically assess their own epistemi.  However, all these recent events: Trump as commander in chief, recession, waste of life skinheads, abhorrent legislation getting passed, is due to your ignorance, indifference, stupidity, the top tier's ability to control you as pawns, (at the drop of a nickel), etc., rests on the shoulders of the most nondedicated/uneducated donuts, our country has ever witnessed (I am talking about the majority of you people).  Get educated, go read some books or a book, disconnect from the corporate-government controlled media, think for yourself, get organized, start movements.  Do fucking something besides sitting lackadaisically on your fat asses watching some rhetorical bullshit.  Stop trusting the government, Congress, representatives: THEY DO NOT GIVE A FUCK ABOUT YOU.  Intuitively, Bill does not possess the qualities as Steve Jobs did.  Bill is a charlatan when it comes to philanthropy, as the majority of philanthropists are.  I am not one to get into conspiracy theories; being pragmatic and realistic, but have any of you donuts, lamenting this secretly malicious population control/depopulation advocate, actually know anything about genetically modified foods?  Do you really think a billionaire and egoist would want to increase the population of an already overpopulated earth?  What is his telos (means to an end for those not versed in basic Greek fundamental philosophy, which I am guessing is most of you.)?  I am not normally this pessimistic and believe it or not, am a progressive-libertarian with humanitarian values.  However, in order for some changes to get implemented in some manner, people who have some sense of education and ethics really need to be truthful on how easily manipulated you people are.  Bill's ideology, I am sure is in correlation with Hobbesian and Malthusian ideology.  Awww, but Bill is so sincere, look at the manner in which he speaks, his body language, and his, \"philanthropic\" efforts, as cyclically promulgated by the MEDIA....Need I say more?  Monsanto + Bill Gates + GMO's + Media = yay happiness, and an egalitarian commune for all to live in prosperity.  Holy shit, you people are fucking stupid; read between the lines.﻿", "time": "1 month ago (edited)", "author": "Kevangelo Kim", "cid": "UgyOzi9uwv4IXlg4xMN4AaABAg"},
{"text": "The Gates foundation and Bill Gates are the root of evil. save 100 thousand people from Malaria but disguise it with the trust built to sicken millions with GMO crap﻿", "time": "1 month ago", "author": "Tim Bernard", "cid": "UgzHWVhbUUdZ5H4yl0N4AaABAg"},
{"text": "bill gates eradicated polio in India? is he serious? so all the vaccines provided by govt for free of cost went into drain then? he helped in that. his part may be important, but dont claim entire credit for yourself﻿", "time": "1 month ago", "author": "Raghunandan Reddy C", "cid": "UgwG4gCkta7BkuJIRMh4AaABAg"},
{"text": "Malaria could be easily controlled (and even eliminated) with the safe and cost-effective substance known as DDT. Of course, \"modern politics\" prevents cheap and effective solutions from being implemented because they might actually do some good. We need to find a way to praise our celebrity \"gods\" instead.﻿", "time": "1 month ago", "author": "Browningate", "cid": "UgznJKJNCA1oBihOX8J4AaABAg"},
{"text": "there are 2 sides to the coin here.. perhaps he didn't wanted to fight in the computer world against apple , google and linux  , which made life tough for windows , reason he left and other reason could be his willingness to do something with the money he earned for the people in the world . whatever the reason could be - he is still a respected individual and a role model for many and still will be for the years to come.﻿", "time": "1 month ago", "author": "Mithilesh Meshram", "cid": "UgwPnQDf-s59aFnxGPl4AaABAg"},
{"text": "Notice how he doesn't do anything with space travel or whatnot.  I'm sure he knows it is complete and utter bullshit.﻿", "time": "1 month ago", "author": "pearlmax", "cid": "Ugyr1tMAPhGQLlhq4pd4AaABAg"},
{"text": "polio was eradicated by Govt of India initiative..Bill did work here but credit should not go to him..﻿", "time": "2 months ago", "author": "Gaurav Karwal", "cid": "Ugwzd-t6zWfire5h9mV4AaABAg"},
{"text": "1:15 \ntwo thousand ELAVAN﻿", "time": "2 months ago", "author": "GishBomb", "cid": "Ugz-k_l0Aoy4Y1x4MVJ4AaABAg"},
{"text": "FROM MR SUPERMAN 3BC1 WHAT AWESOME GUY TO THE HEAL THE WORLD THAT TRULY AWESOME CARE N LOVE N CONCERN N PROTECTION WAY TO GO BILL U REALIZE U CAN'T TAKE TO YOUR GRAVE N U DECIDED TO MAKE A MAJOR DIFFERENCE IN EVERYONE LIVES IN AMERICA N WORLD WORLDWIDE THANK U MR BILL GATE N MRS MELINDA GATES THANKS FOR MAKING A MAJOR DIFFERENCE IN AMERICA N THE WORLD WORLDWIDE YOUR A HERO N A GAME CHANGER N TRANSFORMER IN AMERICAN N WORLD WORLDWIDE THANK U THANK U THANK U MR BILL GATES N MRS MELINDA GATES U WILL BE REMEMBER AS ONE OF AMERICA'S HERO'S N WORLD WORLDWIDE HERO'S WANTING TO CHANGE EVERYONE LIVES FOR THE BETTER IN AMERICA N WORLD WORLDWIDE N ALSO  FINDING CURE'S FOR DISEASE'S THAT DON'T HAVE A CURE THANK U THANK U THANK U I'M %100 FOR U BOTH PLEASE CONTINUE THE EXTREMELY IMPORTANT U DO BILL N MELINDA U HAVE MY HIGHEST APPRECIATION N GRATITUDE N THANKS N RESPECT N LOVE N CARE N CONCERN GRATEFULNESS THANKS FOR ALL THE POSITIVES CHANGES U CONTINUE MAKE DAILY IN AMERICA N THE WORLD WORLDWIDE FOR PEOPLE WHO DON'T BILL GATES NOW U DO N MELINDA GATES DON'T ALWAYS BELIEVE THE BAD U MIGHT OF HEARD THEY DON'T REALLY KNOW BILL GATES OR MELINDA GATES THESE REALLY GOOD N CARING N LOVING PEOPLE N THEY BOTH HAVE HEARTS OF GOLD WISHING U BILL GATES N MELINDA CONTINUE SUCCESS IN ALL YA'LL'S ENDEAVOR'S N INVESTMENTS THANK U ONE ALL THANKS FOR THE GOOD U BOTH DO HERE IN AMERICA N WORLD WORLDWIDE THE HIGHEST THANKS N PRAISE N GRATITUDE N APPRECIATION FROM MR SUPERMAN 3BC1﻿", "time": "2 months ago", "author": "MR SUPERMAN 3BC1", "cid": "UgxF4kPFR6GQ7khcUJx4AaABAg"},
{"text": "what an inspiration!  God bless!﻿", "time": "2 months ago", "author": "Joseph Towers", "cid": "Ugz9WIWLjuIVUhfKE954AaABAg"},
{"text": "Gates for president﻿", "time": "2 months ago", "author": "Patrick McKenna", "cid": "Ugy8t2LNIKgQxYXQ1kV4AaABAg"},
{"text": "Why doesn't bill gates run for president? Better than the greedy ass embarrassment we have for one now﻿", "time": "2 months ago", "author": "MLGJuggernautgaming", "cid": "Ugy8GD_6nhKP5k2NMPx4AaABAg"},
{"text": "Hahahaha CO ANKLE!  What a fuck up!﻿", "time": "2 months ago", "author": "Rarrrrrr", "cid": "Ugzzi16BykgVqoWsBsd4AaABAg"},
{"text": "what a fake new advertisement﻿", "time": "3 months ago", "author": "Jon Schmitt", "cid": "UgzB6uLE_up3WzLPp3F4AaABAg"},
{"text": "He really deserves to be rich.﻿", "time": "3 months ago", "author": "M&M Knight", "cid": "Ugw-VYduI_NvUT7piAt4AaABAg"},
{"text": "what if Steve still alive?﻿", "time": "3 months ago", "author": "Derek Zhang", "cid": "UgzIAJFgxsrOEbMJLd54AaABAg"},
{"text": "Well, he's not.﻿", "time": "2 months ago", "author": "SBCuber", "cid": "UgzIAJFgxsrOEbMJLd54AaABAg.8YC0Fc6IB5l8Z1-A3wn_Mz"},
{"text": "Respect﻿", "time": "3 months ago", "author": "Thaudem Shamu", "cid": "UgwWLJB9nFjhdVhF8Xd4AaABAg"},
{"text": "It is such a shameful act to take credit for polio eradication in India. It was a gradual result of decades of sustained effort by tens of thousands on healthcare workers in India. All his organization did was to conduct a few surveys - which helped, of course. But is in no way a major factor in eradicating polio in India. Shame on you, Bill﻿", "time": "3 months ago", "author": "Sreeram Mullankandy", "cid": "UgywzABINRD8dKDSPHx4AaABAg"},
{"text": "I am an Indian\nThanks Bill Gates!﻿", "time": "3 months ago", "author": "Prakash Katariya", "cid": "UgzPV0GoI73kQ_OVegB4AaABAg"},
{"text": "And now he’s once again the richest man in the world!﻿", "time": "3 months ago", "author": "Fox", "cid": "UgwDcRg7XKIGuk6xT2x4AaABAg"},
{"text": "respect to bill gates sir﻿", "time": "3 months ago", "author": "WarchilD exclusiVe", "cid": "UgzhC808M1uhrwott_54AaABAg"},
{"text": "This is awesome\nhttps://youtu.be/rW0A7-Uw8ks﻿", "time": "3 months ago", "author": "Gaurav Deora", "cid": "UgzP8xoxLNaODIGmzfR4AaABAg"},
{"text": "We got Bill Gates the Batman and Elon Musk the Iron Man﻿", "time": "3 months ago", "author": "Zheezy", "cid": "UgymQXECL-wizdutbhZ4AaABAg"},
{"text": "I don’t see jobs doing anything to save the world...oh wait, he’s dead.﻿", "time": "3 months ago", "author": "BrianTheNoob", "cid": "UgyMG9Jx8FGqrTL_EQp4AaABAg"},
{"text": "This is what happens when smart ppl get smarter﻿", "time": "3 months ago", "author": "SuperTopCat", "cid": "Ugxrz33aRMZ-zQC_QYJ4AaABAg"},
{"text": "this is a good man.﻿", "time": "3 months ago", "author": "TheAmoscokkie", "cid": "UgwfPeZZH5hDHc-xpXh4AaABAg"},
{"text": "Skip to 3:40 to hear about Jobs.﻿", "time": "3 months ago", "author": "rs232killer", "cid": "UgxnR0EspyJ1IdoeWNB4AaABAg"},
{"text": "bill gates is a villan﻿", "time": "4 months ago", "author": "mufalme", "cid": "UgxRuKZtzzxAquihFNx4AaABAg"},
{"text": "Co-ankle's my father.﻿", "time": "4 months ago", "author": "Maxwell Kinney", "cid": "UgwF_SvG6t_0YzgQn9B4AaABAg"},
{"text": "It would be a beautiful thing if it were true. The irony of it all is that their mission coincidentally includes the usage of GMOs in the subsidized seeds\nthe Bill and Malinda Gates foundation underwrote. And how they were leading the charge for the Globalists in usage of vaccines to help eradicate diseases while simultaneously causing the sterilization of the same peoples! How clever to focus on controlling the world population even though it does usurp their free will and self determination by this Trojan Horse eugenics!﻿", "time": "4 months ago", "author": "Truly1Tom", "cid": "UgwMKbsqL1I4abYx1UF4AaABAg"},
{"text": "Why are people against gmos used in agriculture? If done right they can work wonders. The main concern here is the monopolization of the industry. We are living in a time where we don't have the luxury to enjoy organic everything. If you want to feed the world, its going to require sacrifice.There is no free lunch.﻿", "time": "4 months ago", "author": "Alex Shi", "cid": "UgzYOMeVy74GVH4jYu54AaABAg"},
{"text": "3:34 Video begins﻿", "time": "4 months ago", "author": "AndyColton", "cid": "UgwjJ1mhmwFDud46s3l4AaABAg"},
{"text": "My co ankle﻿", "time": "4 months ago", "author": "Hype Blitz", "cid": "UgxRjBjs44aCXuOM_ph4AaABAg"},
{"text": "The world needs more people like bill gates.  So helpful to the world﻿", "time": "5 months ago", "author": "David Robitaille", "cid": "UgxixryETXbKNg9CwZB4AaABAg"},
{"text": "The \"harverd drop out\" part kinda pissed me off who gives a shit he knows a ton more than a whole lot of Harverd Graduates﻿", "time": "5 months ago", "author": "UnusualPlague", "cid": "UgjanORN3E5jfngCoAEC"},
{"text": "This man is a piece of shit﻿", "time": "5 months ago", "author": "NoDaysOff", "cid": "Ugg0sp1RsttnB3gCoAEC"},
{"text": "GMO is fine﻿", "time": "5 months ago", "author": "B Day", "cid": "UghlF7AHiCmHyngCoAEC"},
{"text": "Reading some comments about Steve Jobs invented stuff, but honestly, all of his inventions were plagiarism, including the design. Google it.﻿", "time": "5 months ago", "author": "buxx", "cid": "Ugg1XxzTWH4iengCoAEC"},
{"text": "i dont't buy it﻿", "time": "6 months ago", "author": "mnemosine itahncristos", "cid": "Ugjqpn3ByuzzX3gCoAEC"},
{"text": "Why don't the Jewish bankers who laugh at Bill Gates minor money help out. The rothschilds and Rockafellas﻿", "time": "6 months ago", "author": "Christianity Boxing Mafia", "cid": "UghhhiMBteEwWHgCoAEC"},
{"text": "1:05 Bill Gates ensures we never run out of call center workers. Gawd Bless ya Bill!﻿", "time": "6 months ago", "author": "Akula A", "cid": "UghVpMaZ3qjO9HgCoAEC"},
{"text": "Bill really looked up to steve... it's so cute and sad at the same time..﻿", "time": "6 months ago", "author": "GameAndElse", "cid": "UghZWn6BHYbKkngCoAEC"},
{"text": "tonight he talks with my co-ankle—er... co-anchor﻿", "time": "6 months ago", "author": "pausebeforeviewtube", "cid": "UgiXnr830vAcs3gCoAEC"},
{"text": "I love all of the communists in the comments talking about redistributing wealth and how all wealthy people are shitbags.﻿", "time": "6 months ago", "author": "Lewis Johnson", "cid": "UggchcCLbqWpiXgCoAEC"},
{"text": "Only poor people deal with mosquitos?\nSo only poor people live in or near the tropics?﻿", "time": "6 months ago", "author": "Lewis Johnson", "cid": "UggKcNTLzvZUm3gCoAEC"},
{"text": "with all the Steve Jobs movies that came out after his death, how is it that none of them focused on this relationship, maybe after Bill Gates dies they will﻿", "time": "6 months ago", "author": "Mark Guerrero", "cid": "UggJRSYLmZrKIHgCoAEC"},
{"text": "Monsanto is same as Nestle. In other words, they are the fucking devil.﻿", "time": "6 months ago", "author": "MrJchristopher7", "cid": "Ugi7iW2wrbF7XHgCoAEC"},
{"text": "Co-wanker﻿", "time": "7 months ago", "author": "Gerardo Trejo", "cid": "Ugh_iMLqFmj273gCoAEC"},
{"text": "we always find a better soulution and cure to every problems wer riding as long as we keep working harder on it, until the time comes we all people in this world are not blind anymore from sin and we live worthy and meaningful. and everyone can become jesus the saviour of mankind﻿", "time": "7 months ago", "author": "Richard Rado", "cid": "Ugglv3jlzxwrCXgCoAEC"},
{"text": "Why there is no woman like them in this world ? \nWho made a BIG impact ? \nlike, BIG ...﻿", "time": "7 months ago", "author": "Izayoi Higurashi", "cid": "UgjQvI6D-4zYW3gCoAEC"},
{"text": "Let me talk to your co-ankle!﻿", "time": "7 months ago", "author": "pyr0pete", "cid": "UghCuTzpVpMypHgCoAEC"},
{"text": "I'm dyinggg.. xDD﻿", "time": "7 months ago", "author": "Aly Ariel", "cid": "UghCuTzpVpMypHgCoAEC.8SsXvb6XOO08TRbwwJrWLT"},
{"text": "*Bill*ionaire Gates want's forced mandatory vaccines worldwide. \n\nAs in he want's governments to have the rights to your body, and the lawful ability to penetrate your veins as they deem necessary.﻿", "time": "7 months ago", "author": "LIGER ZERO", "cid": "UggZPDX976s9a3gCoAEC"},
{"text": "LIGER ZERO good!!! There is no reason that everybody should not be vaccinated﻿", "time": "2 weeks ago", "author": "Dom Anca", "cid": "UggZPDX976s9a3gCoAEC.8SmGP8AK0G58akrTZwbTd8"},
{"text": "Hds getting old :( Lk at his face/denture﻿", "time": "8 months ago", "author": "Ma S", "cid": "UgjXl31JJufhFngCoAEC"},
{"text": "All millionaires should use their money to improve humanity and the environment on this planet. It´s a lot more satisfying than buying more materialistic stuff!﻿", "time": "8 months ago", "author": "blocbonbon", "cid": "UggXPf0MpmuhoHgCoAEC"},
{"text": "Co ankle﻿", "time": "8 months ago", "author": "Penguinexpress", "cid": "Ughha6XrbaFm83gCoAEC"},
{"text": "we are so blessed to have witnessed two great pioneers and leaders of this era...﻿", "time": "8 months ago", "author": "Ilyas Khan", "cid": "Ugj4Cp_k_L2iBXgCoAEC"},
{"text": "bill gates: just watch the movie﻿", "time": "8 months ago", "author": "Blu", "cid": "UgiMVxnKBtLvNngCoAEC"},
{"text": "YEAH AFTER UK INVASION AND MAKING A GENOCID OF 10 M OF PEOPLE  UR GONNA SAVE THEM NOW .... BUT ANYWAY AT THE END OF THE DAY 1 GOOD  ENGLISH MAN FROM NEW YORK﻿", "time": "8 months ago (edited)", "author": "Stefan Panaiotov", "cid": "UggWPF8MsBmhL3gCoAEC"},
{"text": "Oh man I love talking to my co ankle.﻿", "time": "8 months ago", "author": "ConquistadorBob The Bob man", "cid": "Ugg5Ui5DLAPmVngCoAEC"},
{"text": "Poor Steve Jobs apple is a bit worse﻿", "time": "8 months ago", "author": "MLG Defender", "cid": "UgirRgu_T0dKXngCoAEC"},
{"text": "Last sentence from Bill hit me hard... choose wisely.. limited time...﻿", "time": "8 months ago", "author": "fiffeel", "cid": "UgiGrG65u8ygUHgCoAEC"},
{"text": "Steve Jobs was an egotistical copycat cunt. Bill Gates is a nice guy.﻿", "time": "9 months ago", "author": "Moustachio", "cid": "Ugixiwcpxg7GqngCoAEC"},
{"text": "Bill Gates said if you are born poor it's not your fault but if you die poor it IS your fault.  Truer words have never been spoken.  Resist the communist welfare state.﻿", "time": "9 months ago", "author": "Fast Frets", "cid": "UghmltUkLA0BcHgCoAEC"},
{"text": "I like Bill Gates when he talks about Steve Jobs.﻿", "time": "9 months ago", "author": "Jean-François Joubert", "cid": "UgxZ6q60IobZPpMkqid4AaABAg"},
{"text": "He uses the gates foundation as a tax dodge.﻿", "time": "10 months ago", "author": "service@cal1.net", "cid": "UggQUsTkxoEs7XgCoAEC"},
{"text": "LOL investing in GMO the worst idea i have ever heard﻿", "time": "10 months ago", "author": "Цветан Захариев", "cid": "Ugizc1NhKHGBv3gCoAEC"},
{"text": "Hailed as heroes but unleashed evil.﻿", "time": "10 months ago", "author": "Joe Jackson", "cid": "UggtfPb6Lx03S3gCoAEC"},
{"text": "once you hear the word MONSANTO anyone associated with that company is compromised and thus loses all credibility﻿", "time": "10 months ago", "author": "Dean Konstantian", "cid": "Ugjq-n4_1Bp-WHgCoAEC"},
{"text": "Steve Wozniak was the engineer, Steve Jobs was the designer and the salesman.﻿", "time": "10 months ago", "author": "Max The Great", "cid": "UgiA4yXtfRCIrXgCoAEC"},
{"text": "This man needs to be the next president of the United States﻿", "time": "10 months ago", "author": "Kim Harry", "cid": "UgiADUcmibauangCoAEC"},
{"text": "CO-Ankle!﻿", "time": "10 months ago", "author": "uc1hamadara13", "cid": "UgjD51C2rB28ZHgCoAEC"},
{"text": "When I was in high school,   my friends and I joked that Bill Gates was evil....  but it was just a joke.   All of us computer nerds built businesses on the Microsoft based computer.    Gates was a very hard worker,  and a true programmer/engineer.   I tip my hat to a boss that worked in the trenches with the crew.﻿", "time": "10 months ago", "author": "DeadKoby", "cid": "UghtF5Xuzgj1SHgCoAEC"},
{"text": "how did they let this DOOOOSSHHHH interviewer get anywhere NEAR one of our most treasured geniuses.....﻿", "time": "10 months ago", "author": "RideMyTruck", "cid": "Ugh_beL6OEmqOXgCoAEC"},
{"text": "Bill Gates shows us what every billionaire should be doing. When you have the money to take every homeless person off the streets. When you have enough money to eradicate diseases. To save millions of people. \nWhen you're sitting on a disproportionate amount of wealth, I think you have a responsibility to invest it back into the world from which you acquired it. If you don't use the excess money you have earned after spending as much as you possibly can on yourself, you are deliberately restricting and depriving the economy on which we all depend on from the poorest to the wealthiest.﻿", "time": "11 months ago", "author": "Stuntman707", "cid": "UgjEFBFDMaIIYHgCoAEC"},
{"text": "Monsanto is the most evil company on Earth.﻿", "time": "11 months ago", "author": "Siva Selvarajah", "cid": "UggK94ehgXkbuXgCoAEC"},
{"text": "Monsanto is the most evil company on Earth.﻿", "time": "11 months ago", "author": "AdamPastor", "cid": "UghrB4r1YJuuY3gCoAEC"},
{"text": "That facepalm when you know more about biology than the average Joe and you hear the accusations that people throw at GMO food...﻿", "time": "11 months ago (edited)", "author": "Horny Fruit Flies", "cid": "UgiYMwrk5MHkGHgCoAEC"},
{"text": "So much this.﻿", "time": "11 months ago", "author": "Piotr Czajkowski", "cid": "UgiYMwrk5MHkGHgCoAEC.8O7YbYIl9nn8O7YsnkykTe"},
{"text": "YES!! The anti gmo craze is just fear mongering. The US would starve without GMOs﻿", "time": "3 months ago", "author": "Mannycore", "cid": "UgiYMwrk5MHkGHgCoAEC.8O7YbYIl9nn8YPAhJ2uELP"},
{"text": "Bill donates millions of dollars to prevent diseases in children whilst using poor Indian children in his factories﻿", "time": "1 year ago", "author": "csenge varkonyi", "cid": "UgjFK_tCR3utU3gCoAEC"},
{"text": "source on that?﻿", "time": "1 year ago", "author": "Isac Norling", "cid": "UgjFK_tCR3utU3gCoAEC.8N-l2YThZoF8Ndy6dsi6nf"},
{"text": "csenge varkonyi bullshit.﻿", "time": "10 months ago", "author": "Vernon Tauro", "cid": "UgjFK_tCR3utU3gCoAEC.8N-l2YThZoF8P6QaefNZgk"},
{"text": "When someone says something good about steve job sir bill gates in this comment section, someone comes in and says they are both horrible people who shouldn't be fingered by Edward scissor hands﻿", "time": "1 year ago", "author": "MAT PO", "cid": "UgjuaujRsS1eM3gCoAEC"},
{"text": "GMO IS A TROY HORSE FOR THE POOR COUNTRIES﻿", "time": "1 year ago", "author": "lai kankan", "cid": "UggM7ZnEYd_CGHgCoAEC"},
{"text": "Elaborate.﻿", "time": "11 months ago", "author": "Horny Fruit Flies", "cid": "UggM7ZnEYd_CGHgCoAEC.8MKcVkNPgTQ8O7YfQE1lGE"},
{"text": "rewind to 0.9 sorry﻿", "time": "1 year ago", "author": "Philip Parker", "cid": "UghYqIVc0FVSSXgCoAEC"},
{"text": "rewind too 0.12 listen to the............ co w..ker news reporter one more time lol﻿", "time": "1 year ago", "author": "Philip Parker", "cid": "Ugh3xxFVznaafHgCoAEC"},
{"text": "I have always been a supporter of GMO crops. It is the only way out for our ever growing population.﻿", "time": "1 year ago", "author": "prince chhabra", "cid": "UgjbyyOADwQr8HgCoAEC"},
{"text": "Ricardo Semler is the greates entrepreneur, See: Bombała, B. (2014). Phenomenology as the Epistemological and Methodological Basis of Management Sciences, International Journal of Contemporary Management, 1, 150-172.﻿", "time": "1 year ago", "author": "servant", "cid": "UgjOSeNSslbt2HgCoAEC"},
{"text": "Terry what is wrong with your eyes!?﻿", "time": "1 year ago", "author": "michael brown", "cid": "UgjMGIM8kND3GHgCoAEC"},
{"text": "Guys, direct truly    looks likedeepl| gredt monument  xD﻿", "time": "1 year ago", "author": "Nathaniel Gordon", "cid": "Ugi63qSihkK_F3gCoAEC"},
{"text": "3:40﻿", "time": "1 year ago", "author": "zamardii12", "cid": "Ughr5G_tmF4miXgCoAEC"},
{"text": "zamardii12...there it is he was about to cry﻿", "time": "1 year ago", "author": "Timberlee Smith", "cid": "Ughr5G_tmF4miXgCoAEC.8JBkxwFyXv68LWATfp3TR7"},
{"text": "All bullshit. Bill invests in companies like Coca Cola, Monsanto and other evil cooperations! He's pretending to be an angel, but truly he's a descendent of the devil. Look it up yourself if you don't believe me!﻿", "time": "1 year ago", "author": "QNXDR", "cid": "UginxkXxyiLgD3gCoAEC"},
{"text": "stfu u cant do shit for the world lol﻿", "time": "1 year ago", "author": "Primed Salt", "cid": "UginxkXxyiLgD3gCoAEC.8J9wLYsC9tS8JCD6_tMWNb"},
{"text": "Coca Cola is run by fantastic people. I am sure you are scared of them because they expect you to work and don't want to give you handouts anymore.﻿", "time": "1 year ago", "author": "Silver Fox", "cid": "UginxkXxyiLgD3gCoAEC.8J9wLYsC9tS8JJfgas0Ayg"},
{"text": "why is coca cola evil﻿", "time": "1 year ago", "author": "aiden soler", "cid": "UginxkXxyiLgD3gCoAEC.8J9wLYsC9tS8M3m_TzjrQW"},
{"text": "coke has no health benefits though lol.﻿", "time": "4 months ago", "author": "Frances Jenny", "cid": "UginxkXxyiLgD3gCoAEC.8J9wLYsC9tS8WXmpglRSv5"},
{"text": "are you fucking kidding me I bet you're your the type of guy that thinks the earth is flat just because he read it online.﻿", "time": "3 months ago", "author": "Stormagaming", "cid": "UginxkXxyiLgD3gCoAEC.8J9wLYsC9tS8XmmZNYa7y-"},
{"text": "That is easily the most ignorant, unfounded hate message ever.  Written by a dumb ass loser.  Thank You Mr. Gates.﻿", "time": "4 weeks ago", "author": "Mark Murray", "cid": "UginxkXxyiLgD3gCoAEC.8J9wLYsC9tS8aD1L_vw1Cz"},
{"text": "Stfu﻿", "time": "1 week ago", "author": "Mickey Em", "cid": "UginxkXxyiLgD3gCoAEC.8J9wLYsC9tS8aoT62l_oXx"},
{"text": "Co-Wanker.﻿", "time": "1 year ago", "author": "samhailes", "cid": "UggjYRgJT82DWngCoAEC"},
{"text": "I find this interesting that at one point in his life it was about competing and beating Steve & Apple, but competition only goes so far, turning away from competition to do a great good with your achieved success is what we should all be doing.﻿", "time": "1 year ago", "author": "evenbetterdanthereal", "cid": "UgipLfu3oMLXc3gCoAEC"},
{"text": "evenbetterdanthereal \nthere should be a balance﻿", "time": "1 year ago", "author": "Elijah _", "cid": "UgipLfu3oMLXc3gCoAEC.8IzNpvE7EGm8LoHI9zOvGb"},
{"text": "He is a great man really. Not like some of those other billionair asses. He really cares about the world and the legacy he leaves behind. The only thing that i found absolutely horrible was when he decided to work together with Monsanto who is most likely one of the biggest **** companies in the world.﻿", "time": "1 year ago", "author": "Alexander Heim", "cid": "UgiKT9OdLt3-UHgCoAEC"},
{"text": "It´s not about the mutation. Monsanto is making billions of dollars with seed contracts that basically make the farmer their slave.﻿", "time": "1 year ago", "author": "Alexander Heim", "cid": "UgiKT9OdLt3-UHgCoAEC.8IeaX4XLy8u8NZaIpP7rZw"},
{"text": "i think its more like: monsanto has the tech and know-how that the gates & melinda foundation require, and so they \"hire\" monsanto to do their work. monsanto are gonna be supreme cockheads whether or not gates make use of their abilities, and so why not \"force\" a bad company to do good?\n\nat least i hope thats the way he's thinking﻿", "time": "1 year ago", "author": "Isac Norling", "cid": "UgiKT9OdLt3-UHgCoAEC.8IeaX4XLy8u8Ndxh03CD2r"},
{"text": "depopulation﻿", "time": "9 months ago", "author": "Lil Rick", "cid": "UgiKT9OdLt3-UHgCoAEC.8IeaX4XLy8u8RCGc8EdjgA"},
{"text": "He recently turned human feces into clean drinking water with one of his inventions.. While i respect Steve jobs for the advancements he made in turning the phone into the handheld supercomputer it is no, still.. Bill gates has done more for humanity than god.. And that's pretty huge..﻿", "time": "1 year ago", "author": "Thepizzatree", "cid": "UghWcC6TtjURD3gCoAEC"},
{"text": "lol god is the reason we have trees, grass, water , YOU, food and life on this earth you cant compare anyone to god﻿", "time": "1 year ago", "author": "HOF Pussy Eater", "cid": "UghWcC6TtjURD3gCoAEC.8I69czuTKQz8L74K1R0pSp"},
{"text": "TOUCH ME !!! - lol gtfo﻿", "time": "1 year ago", "author": "Maxerns", "cid": "UghWcC6TtjURD3gCoAEC.8I69czuTKQz8LPMRUFhTed"},
{"text": "God is fucking dead I raped his corpse﻿", "time": "1 year ago", "author": "Cholla", "cid": "UghWcC6TtjURD3gCoAEC.8I69czuTKQz8LilagGDsfn"},
{"text": "+TOUCH ME !!! Except that there is not god.﻿", "time": "11 months ago", "author": "Horny Fruit Flies", "cid": "UghWcC6TtjURD3gCoAEC.8I69czuTKQz8O7YlCyosKH"},
{"text": "He's a cool dude but he needs to score some hotter pussy and ditch that old shit﻿", "time": "1 year ago (edited)", "author": "Abigail Sockeye", "cid": "Ughe05tUeFzH_XgCoAEC"},
{"text": "Lol!  Hmmm now let me guess… maybe someone like… You!?﻿", "time": "1 year ago", "author": "C&MEntertainment", "cid": "Ughe05tUeFzH_XgCoAEC.8E2IKwNdMvg8EOHRwuswzQ"},
{"text": "Donating to Monsanto is not a great idea...﻿", "time": "1 year ago", "author": "Ayesha Qureshi", "cid": "Ugi44Xxh_cSfWHgCoAEC"},
{"text": "+Ayesha Ashoo They didn't donate, they invested.\n\nIt's more like hiring a consultant for a specific task. Gates Foundation has money, Monsanto has the tools and the technology. So Gates Foundation can get Monsanto to design the specific seeds or whatever.﻿", "time": "1 year ago", "author": "yugandhar beesetty", "cid": "Ugi44Xxh_cSfWHgCoAEC.8Dczs4G3ycp8E2Om7OgWem"},
{"text": "How is it not?﻿", "time": "5 days ago", "author": "Victor Diaz", "cid": "Ugi44Xxh_cSfWHgCoAEC.8Dczs4G3ycp8b8RHT9cqNr"},
{"text": "Yes but he planning to slaughter half the world's population from his hi tech underground lair inside an extinct volcano.    I believe he also has a revolving armchair and a white cat......called steve﻿", "time": "1 year ago (edited)", "author": "funkmasterjee", "cid": "Ugh4t2qbs8XNXngCoAEC"},
{"text": "Bill gates is the BOMB﻿", "time": "1 year ago", "author": "Dizzy Dane", "cid": "UgjlU48Q8h6RJngCoAEC"},
{"text": "He has killed us all. There are too many people on Earth. The planet can barely contain 1 billion.. but now we are 7. Fuck you Bill.﻿", "time": "1 year ago", "author": "RuthsFood", "cid": "UgjCjea-Pg1eq3gCoAEC"},
{"text": "You know if we stand shoulder to shoulder every human could fit in the city of L.A? There is plenty of room we just have to be smart and know how to properly do things. like DONT WASTE﻿", "time": "1 year ago", "author": "Zach Simpkins", "cid": "UgjCjea-Pg1eq3gCoAEC.89jQea6eYnz8Ipxh1vORPr"},
{"text": "Mr. Vaccine.  When the vaccinator becomes the poisoner.﻿", "time": "1 year ago", "author": "HighPacheChief", "cid": "UgjfCtd0EnLoTHgCoAEC"},
{"text": "Monsanto is f... EvilCorp ! Fuc. GMO!﻿", "time": "2 years ago", "author": "beastie 77", "cid": "UgjLrvcYo6GUtXgCoAEC"},
{"text": "+beastie 77 Everything you eat today are GMOs. Wild apples are so acidic you'd vomit. Wild bananas contain huge amounts of seeds as big as blueberries. You can get grapes with and without seeds. Wild watermelons are not even close to as big as the ones we have in the store, they are normally no bigger than grapefruits. Let's not even get into the citrus fruits.﻿", "time": "1 year ago", "author": "Senatsu", "cid": "UgjLrvcYo6GUtXgCoAEC.87q6BatqgpP8Cog-Ryquai"},
{"text": "Bill Gates says \"There's no reason only poor people should have the experience\". Everyone laughs thinking he's talking about people in Africa even though to him it's everyone in America.﻿", "time": "2 years ago", "author": "YouTube Comments Critic", "cid": "Ugi7GSEbiqADf3gCoAEC"},
{"text": "+YouTube Comments Critic lol﻿", "time": "2 years ago", "author": "Y Y", "cid": "Ugi7GSEbiqADf3gCoAEC.86fM4ddwmtP88PaAwdqnKf"},
{"text": "Great observation, you're absolutely right.﻿", "time": "10 months ago", "author": "REVERSE WALRUS", "cid": "Ugi7GSEbiqADf3gCoAEC.86fM4ddwmtP8P4O8fdGpRv"},
{"text": "YouTube Comments Critic 😂😂😂😂😂﻿", "time": "8 months ago", "author": "Michael del cid", "cid": "Ugi7GSEbiqADf3gCoAEC.86fM4ddwmtP8SHjHaryB4u"},
{"text": "YouTube Comments Critic Why the fuck does he assume everyone in or near the tropics who has to deal with mosquitos is poor﻿", "time": "6 months ago", "author": "Lewis Johnson", "cid": "Ugi7GSEbiqADf3gCoAEC.86fM4ddwmtP8U0aCy9lsKE"},
{"text": "because they're third world countries, which sadly in a way means poor maybe not in the way you think but yeah﻿", "time": "6 months ago", "author": "NonsensicalVids", "cid": "Ugi7GSEbiqADf3gCoAEC.86fM4ddwmtP8URYFdWac1R"},
{"text": "I don't get it. What do you mean? Malaria is unheard of in the US.﻿", "time": "5 months ago", "author": "Tyler Evans", "cid": "Ugi7GSEbiqADf3gCoAEC.86fM4ddwmtP8VsokePfY80"},
{"text": "He’s a globalist asshat who is actively trying to dismantle the United States through disease and biological warfare.﻿", "time": "1 day ago", "author": "Brian W", "cid": "Ugi7GSEbiqADf3gCoAEC.86fM4ddwmtP8bIUH-Xvxmh"},
{"text": "PISS'N'¨SHIT﻿", "time": "2 years ago", "author": "hjuler123", "cid": "UgixS-QEcgRKMHgCoAEC"},
{"text": "Bill is only 59, considering all the money he has, he should be able to afford all the necessary check ups and be around for hopefully another 20 years!! or even more lol, he is pretty rich...he could be the first cyborg﻿", "time": "2 years ago (edited)", "author": "King Kaiden", "cid": "Ugi6l1SVBPh7t3gCoAEC"},
{"text": "0:09- so \"co-angle\" huh. We'll let that slide.﻿", "time": "2 years ago", "author": "CKCLUTCH", "cid": "UgjOkA7WjUJZgHgCoAEC"},
{"text": "+Rez co-ankle﻿", "time": "2 years ago", "author": "BunnyCentauri", "cid": "UgjOkA7WjUJZgHgCoAEC.82nzr3PIMJF71ZNuOqlK-T"},
{"text": "+Rez Bill Gates will go to haven 100% ;p[﻿", "time": "1 year ago", "author": "Bizzle", "cid": "UgjOkA7WjUJZgHgCoAEC.82nzr3PIMJF8AnIzELSYQl"},
{"text": "Apple is will be long gone if not because of Bill Gates bailing them out but Microsoft Windows will not be as it is today if not because of Apple.﻿", "time": "2 years ago (edited)", "author": "JG", "cid": "UgiA-nzhOKW5CHgCoAEC"},
{"text": "+TheSuperk25 they always worked together﻿", "time": "2 years ago", "author": "VengefulSage", "cid": "UgiA-nzhOKW5CHgCoAEC.80xw4B9aD-470RjWHcYEv9"},
{"text": "gates has a good cover story. his \"vaccines\" murder 1000's of kids,  the fact that he sponsors monsanto is a red flag,  the US is the only country where monsanto is leagal﻿", "time": "2 years ago", "author": "ObamaBinLaden", "cid": "Ugil-aPlT34_MngCoAEC"},
{"text": "The person doing the interview actually gave me pity...dressing up and walking like a big shoot...the things you have to do to appear great.﻿", "time": "2 years ago", "author": "2000Betelgeuse", "cid": "UgjVSmXn9owXtXgCoAEC"},
{"text": "He should help out with building desalination plants.  Freshwater is getting more and more difficult for people in a lot of countries to get.﻿", "time": "2 years ago", "author": "Hobo Aquatics", "cid": "UghCReYTTYByhXgCoAEC"},
{"text": "I could stand a couple million if you are giving money away.  I am like my father, he worked hard all his life, and the only thing they gave him was, more work.﻿", "time": "2 years ago", "author": "Dave Van Meter", "cid": "UgiimfzQE1oFNHgCoAEC"},
{"text": "Co ankle hahahaha wtf﻿", "time": "2 years ago", "author": "Jeffery Hoogs", "cid": "Ugin04XWvTaPqHgCoAEC"},
{"text": "Gmo. Haarp creating floods to allow excuse fore gmos﻿", "time": "2 years ago", "author": "Intelligence Over Evil Evil Under Intelligence", "cid": "UggD7OP_BYL0KngCoAEC"},
{"text": "Geogenecist ,mercury in vaccines impiding creativity to obstruct competition﻿", "time": "2 years ago", "author": "Intelligence Over Evil Evil Under Intelligence", "cid": "UgjQBeMKakgJWngCoAEC"},
{"text": "The other guy looks and speaks like a top-secret FBI robot project designed at MIT\nto give the impression of a \"perfect, handsome American politically correct interviewer\". Pukable.﻿", "time": "2 years ago", "author": "ekhangel", "cid": "UgjkyCJ58tsinXgCoAEC"},
{"text": "Pcs are better﻿", "time": "2 years ago", "author": "Abraham serrano", "cid": "UgiRUYAveoVmungCoAEC"},
{"text": "co-ankle﻿", "time": "2 years ago", "author": "jiimmy567", "cid": "UgjnAPMeSL0uDHgCoAEC"},
{"text": "Bill Gates and Steve Jobs... 2 amazing heroes for the industry's.. Let's see what they did and are doing right now.\n\nBill Gates: Invented Windows,Vaccine against Malaria, Donates 2 bilion (2,000,000,000) Dollars a year for children in India.\n\nSteve Jobs: Invented iPhone,iPad,iMac and so on. Put a computer in every school (mid 19's) And made the Phone Industry so much better.\n\nThose 2 humans are truly amazing.. I will never forget them.﻿", "time": "2 years ago", "author": "Keishin", "cid": "Ugid28AmwJS0x3gCoAEC"},
{"text": "Steve Wozniak did most of the work in the beginning don't forget﻿", "time": "2 years ago", "author": "Joshua Laskowski", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF71Rr7Uw6VYn"},
{"text": "True.﻿", "time": "2 years ago", "author": "Keishin", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF71TzE0z0t0l"},
{"text": "+GamerPlaysAll at least you're not a Apple hater. I respect you for that.﻿", "time": "2 years ago", "author": "Joshua Laskowski", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF71Ubl92WV2L"},
{"text": "I use apple myself. (iPhone 4)﻿", "time": "2 years ago", "author": "Keishin", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF71WN5EUPRfX"},
{"text": "+GamerPlaysAll You mean to tell me he donates 2 bill a year to India and they're still in the shitter?﻿", "time": "2 years ago (edited)", "author": "MastaGambit", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF72A6rfWYAwe"},
{"text": "Yeah? But remember, India does have 1 bilion people living in there.﻿", "time": "2 years ago", "author": "Keishin", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF72CK8KMQIe-"},
{"text": "Actually it was Bill Gates who bought computers for different schools around the world. Watch the documentary﻿", "time": "2 years ago", "author": "DrakothRieth", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF74NlD-vk12h"},
{"text": "+Illuminate420 Bill Gates polio vaccinations campaign caused 47.500 deaths in India.﻿", "time": "2 years ago (edited)", "author": "Andrawewa", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF76nw-E_MTzs"},
{"text": "+Illuminate420 actaly apple didint invent shit...\nthe smartphone, tablet, notebook wasnt invented by apple you can check if you want\nand bill gates didint invent the vacine for malaria its stil out there﻿", "time": "2 years ago (edited)", "author": "SpaghettiMilk", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF76x6Ud5WS3x"},
{"text": "+DarkShiv shut up, gates saved millions of life and jobs didn't invent stuff, he just made them a lot better, such as phones and tablets﻿", "time": "2 years ago", "author": "AnEasyGuy22", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF77EgHV136sQ"},
{"text": "I tought you were been sarcastic... weren't you? I mean, they actually did remarkable things, but not unforgetable 'sacrifices' for our planet and society.\n\nJobs clearly wanted to be a millionaire but wasn't a threat; Gates in the other hand is like Mark Suckerberg: they not only want money, they want direct control over the population.﻿", "time": "2 years ago", "author": "Alberto González Olay", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF7Af87jOvyIa"},
{"text": "+KeishinUchiha They are not humans they are gods :)﻿", "time": "2 years ago", "author": "3PodGamingHD", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF86dUotnuTYG"},
{"text": "+3PodGamingHD ^-^﻿", "time": "2 years ago", "author": "Keishin", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF86f9ilieVF6"},
{"text": "+KeishinUchiha bill is still alive﻿", "time": "2 years ago", "author": "zz dragon", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF87j3oIQ5bVa"},
{"text": ".﻿", "time": "1 year ago (edited)", "author": "zz dragon", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF89ITC8EHIzF"},
{"text": "+Hannibal Barca search google for \"the mother of all demos\".. Xerox didn't invent any of them.﻿", "time": "1 year ago", "author": "Amit Raam", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF8AZoy3LjFww"},
{"text": "Oh sure ignore the R&D teams.﻿", "time": "1 year ago", "author": "cha0s65065", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF8CGmiZtrVZT"},
{"text": "@keishin\n1.5 Billion People in INDIA\nAnd he doesnt donate every year lol...life'snot disneyland lol wake up..:D\n@joshua Laskowski They are not still in shitter(english plz)....its a growing economy..but still their current economy is could have been 100 folds better if WHITE CUNTS like ur forefathers didnt colonize and drained 90% of its wealth,cause mass famine,genocide ...ect﻿", "time": "1 year ago", "author": "rohan64bit", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF8MHdTwQ_Edc"},
{"text": "rohan64bit i was like 13 then i didnt know shit﻿", "time": "1 year ago", "author": "Keishin", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF8MHd__5WQSF"},
{"text": "rohan64bit bro back the fuck up and respect peoples opinions﻿", "time": "7 months ago (edited)", "author": "WildFireGaming", "cid": "Ugid28AmwJS0x3gCoAEC.7-H0Z7-7eeF8SuA1_Lefa4"},
{"text": "CO-ANKLE?!?!?!?! What a dick﻿", "time": "2 years ago", "author": "High Brow Comedy", "cid": "UggVnLXhj6R9e3gCoAEC"},
{"text": "Damn like you've never stumbled over a word﻿", "time": "1 year ago", "author": "terpentine", "cid": "UggVnLXhj6R9e3gCoAEC.7-H0Z7-7KOx8AmVMbaPBi2"},
{"text": "+Jack Labarge it's a joke dawg﻿", "time": "1 year ago", "author": "High Brow Comedy", "cid": "UggVnLXhj6R9e3gCoAEC.7-H0Z7-7KOx8AmVQKQxElv"},
{"text": "+High Brow Comedy I don't get it﻿", "time": "1 year ago", "author": "terpentine", "cid": "UggVnLXhj6R9e3gCoAEC.7-H0Z7-7KOx8BLoIbxouEe"},
{"text": "+Jack Labarge it's too high brow for you﻿", "time": "1 year ago", "author": "High Brow Comedy", "cid": "UggVnLXhj6R9e3gCoAEC.7-H0Z7-7KOx8BM16xdjpnC"},
{"text": "I just seen a rich idiot - have you?﻿", "time": "2 years ago", "author": "Sergey Khochay", "cid": "UgiyCLj9yeuKQHgCoAEC"},
{"text": "+Simon Quigley no, access denied when I tried to enter to his new home.﻿", "time": "2 years ago", "author": "Sergey Khochay", "cid": "UgiyCLj9yeuKQHgCoAEC.7-H0Z7-RemD72DER0-Rny3"},
{"text": "+Sergey Khochay Pfft, better than anything you'll accomplish.\n\nAlso, what were you trying to enter his house for? ;)﻿", "time": "2 years ago (edited)", "author": "MastaGambit", "cid": "UgiyCLj9yeuKQHgCoAEC.7-H0Z7-RemD72j8WB2L66f"},
{"text": "better than what ?﻿", "time": "2 years ago (edited)", "author": "Sergey Khochay", "cid": "UgiyCLj9yeuKQHgCoAEC.7-H0Z7-RemD72kA1TB-Oon"},
{"text": "I did - didn't went well . As you can tell﻿", "time": "2 years ago", "author": "Sergey Khochay", "cid": "UgiyCLj9yeuKQHgCoAEC.7-H0Z7-RemD72l-pLETIFh"},
{"text": "After all the struggle I've had with Microsoft products over the years and all the money I've paid for it, I am glad to see that money is doing good in the world. Thanks mister Gates.﻿", "time": "3 years ago", "author": "Ron", "cid": "Ughca6KJiq9UEXgCoAEC"},
{"text": "has GMO something to do with spraying of aluminium on soils so then only GMO seeds would be able to grow on contaminated soil? What about chemtrails?﻿", "time": "3 years ago", "author": "gr8deals2do", "cid": "UghKh2sakFlFEXgCoAEC"},
{"text": "+gr8deals2do Chemtrails? Really?\n\nWhat about organic foods? Unless they use pesticides, they will lose more than half the crops, but the only pesticides they're allowed to use contain so much copper it makes the ground useless and infirtile after a few growth cycles. Leading to the growth of \"organic\" foods requiring moving the crops to different fields all the time to avoid poisoning the plants, and the groundwater. The amount of aluminium used in modern pesticides for \"non-organic\" foods are in such small amounts that they don't get picked up by the plants to any harmful degree to neither humans, animals, or vegetation, and they don't poison the groundwater, which means the same area can be used again and again.﻿", "time": "1 year ago", "author": "Senatsu", "cid": "UghKh2sakFlFEXgCoAEC.7-H0Z7--Fsj8Cogr7moKAq"},
{"text": "There's no other Billionaire on earth that has given the majority of their wealth away like Gates. He's an example of what sharing the wealth means. ﻿", "time": "3 years ago", "author": "apiece ofdirt", "cid": "UghCOYKU-rCbxngCoAEC"},
{"text": "Warren Buffett Did﻿", "time": "10 months ago", "author": "Justin Liu", "cid": "UghCOYKU-rCbxngCoAEC.7-H0Z7-GD6j8PwrAd9ERc4"},
{"text": "That's true but it was Bill Gates who convinced Buffet to join the charity program﻿", "time": "9 months ago", "author": "leftyfourguns", "cid": "UghCOYKU-rCbxngCoAEC.7-H0Z7-GD6j8QDpY59-M3k"},
{"text": "leftyfourguns Wrong! Buffett's first wife had this idea of giving back value to the world. So basically she influenced him not Gates!﻿", "time": "9 months ago", "author": "kilo Spaghetti", "cid": "UghCOYKU-rCbxngCoAEC.7-H0Z7-GD6j8RB5l4XLFvy"},
{"text": "apiece ofdirt Stupid liberal﻿", "time": "6 months ago", "author": "Lewis Johnson", "cid": "UghCOYKU-rCbxngCoAEC.7-H0Z7-GD6j8U0a7IC2lQ0"},
{"text": "apiece ofdirt you’d expect that from the richest man bub﻿", "time": "3 months ago", "author": "John Gotti", "cid": "UghCOYKU-rCbxngCoAEC.7-H0Z7-GD6j8YJxofOVDPk"},
{"text": "apiece ofdirt google and see, how much the TATAs earn and donate... If he would not have donated his 65% income he would have been a billionaire too easily top 10 richest people...﻿", "time": "1 month ago", "author": "ProNoob", "cid": "UghCOYKU-rCbxngCoAEC.7-H0Z7-GD6j8_98dcJA9oi"},
{"text": "He has given away a lot but nowhere close to a majority of his wealth. And the money he \"donated\" was to his own charity where tens of billions still sit.﻿", "time": "1 month ago", "author": "John Charles", "cid": "UghCOYKU-rCbxngCoAEC.7-H0Z7-GD6j8_fd0DC4iaU"},
{"text": "You need money to make money. It would be irresponsible to just throw it all away when you can feed a lot of it in research.﻿", "time": "1 month ago", "author": "Nex", "cid": "UghCOYKU-rCbxngCoAEC.7-H0Z7-GD6j8_lSJkMg8v9"},
{"text": "Bill Gates, eugenicist.﻿", "time": "3 years ago", "author": "Bryon Lape", "cid": "UghtDQG7-GnLl3gCoAEC"},
{"text": "well, PCs are like Honda and Toyotas, and Apples are like BMW and Benz.﻿", "time": "3 years ago", "author": "aquarius", "cid": "UgjWkI0jp7Mbb3gCoAEC"},
{"text": "Exactly, because Apple is expensive!﻿", "time": "3 years ago", "author": "Zirploide ​", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY7-OaA8SHPGd"},
{"text": "true and the world needs them all﻿", "time": "3 years ago", "author": "videowatcher", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY7-guuzq2DoF"},
{"text": "PCs are expensive too if you buy one with powerful specs. So some PCs could be like powerful manual cars because they are powerful yet more difficult to operate. Apple is exactly like BMW and Benz who are adored for their aesthetic looks. ﻿", "time": "3 years ago", "author": "BRBallin1", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY7-piWYvldYT"},
{"text": "First of all, it's actually Windows vs Apple, not PC vs Apple. If I wanted to, I can build a desktop and then use Hackintosh to install iOS and the PC I built will be running Apple platform iOS then. You were comparing hardware to software. Get some knowledge before bashing Windows platform.\n\nI built my friend's desktop, which is composed of i7 4th generation, OCZ 64GB DDR3 2000Mhz ram, 200GB SSD, 3TB Western Digital Hard Drive 7200 RPM, XFX Radeon R9 8GB GPU ram with liquid cooling, Asus touchscreen 24 inch monitor, Logitech Performance MX Mouse, Logitech K800 keyboard, Thermaltake liquid cooling case while also having 8 big fans, this beasty machine that I assembled for my friend beats ANY Apple desktops and laptops and its future models ANYDAY. And I know there are gamers out there who can even blow this specs out of the water with better specs. It'll take Apple about 5 years to barely match upto my friend's desktop. And he bought all of this at either half the price or less than the most expensive Apple desktop. My friend installed Windows but he could've used Hackintosh and installed Apple iOS if he wanted to. But of course, he and I both hate Apple iOS platforms.\n\nApple sucks. It's features are limited and it has lot of compatibility issues. It's only for people who don't do much with their computers besides basic activities such as listening to music, surfing the web, checking emails. For someone who are either serious gamers, programmers, video editors, etc, Apple sucks. Apple however due to its limited platform, is simplistic that DJs use it since there's lower chance of crashing than Windows since platform is very limited and simplistic. If I was a DJ or musician, I would however use macbook bcz I don't have to worry or risk crashing.﻿", "time": "3 years ago (edited)", "author": "EdDy4RheelZ", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY7-xqyUyIIHn"},
{"text": "+EdDy4RheelZ  You mean OSX ? Because IOS is for Iphones.﻿", "time": "3 years ago", "author": "try0003", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY70V5X0ztE3r"},
{"text": "+EdDy4RheelZ You'll never convince anyone because in their minds more  expensive = better product ﻿", "time": "2 years ago", "author": "catfoosh", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY71gqIzwOgni"},
{"text": "Yes true, Hondas (pc), good value for money and the merc (Apple) overpriced. You are right﻿", "time": "2 years ago", "author": "Jason", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY73Ee5IBB6M8"},
{"text": "+EdDy4RheelZ good job you saved me the 5 minutes of my time it would take me to type up such a comment. unfortunately for everyone else who appears to be mostly just regular consumers you cant compare cars to computers so easily. the difference between software and hardware makes it hard to compare computers to anything. regular PC's can be custom but macs are basically what you bought them as.﻿", "time": "2 years ago", "author": "Zalphor", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY73yrrsY9m7u"},
{"text": "+chaurasia hariprasad No, that's your opinion!﻿", "time": "2 years ago", "author": "Cesar Alvarez", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY74Fo1U0FotV"},
{"text": "+chaurasia hariprasad If by that you mean a pre-built, nice-looking ripoff then sure. ;)﻿", "time": "2 years ago", "author": "MastaGambit", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY74X_pj6snJ6"},
{"text": "+chaurasia hariprasad So what you're saying is that PCs last longer and Apples needs to be fixed constantly?﻿", "time": "2 years ago", "author": "Mark Batarina", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY78cYh9J1MCy"},
{"text": "+Mark Batarina more like an Apple gets replaced constantly, for one reason or another. once you build a PC it can last anywhere around 10 years without an issue. assuming you didn't put it in a volcano for at least 2 of those years(or as long as your build isn't crap).﻿", "time": "2 years ago", "author": "Zalphor", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY78d1QipHgzV"},
{"text": "Zalphor that's just bullshit. Anyone who's older than 10 year old will remember how much time wasted on fixing Windows.﻿", "time": "2 months ago", "author": "alphazar", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY8YryABbNgWq"},
{"text": "Overpriced, surely. I'm content with my Mazda, thank you very much﻿", "time": "1 month ago", "author": "Michał Tądel", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY8ZxeHLA9Lld"},
{"text": "r u dumb﻿", "time": "17 hours ago", "author": "Jacob Berry", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY8bLHOxk3U5B"},
{"text": "EdDy4RheelZ I think you won gg﻿", "time": "17 hours ago", "author": "Jacob Berry", "cid": "UgjWkI0jp7Mbb3gCoAEC.7-H0Z7-KhSY8bLHYM3rIgN"},
{"text": "What, Steve Jobs in a tux?﻿", "time": "3 years ago", "author": "Nebolsi", "cid": "Ugg2HWoQLNw_UHgCoAEC"},
{"text": "Super weed﻿", "time": "3 years ago", "author": "Kenny Mayne", "cid": "Ugjo5STtIbbZqXgCoAEC"},
{"text": "Is bill going to help with Ebola hope he is we can't have it spread across the world\n﻿", "time": "3 years ago", "author": "Gold Gecko Gaming", "cid": "UgiLU0rnch2XGngCoAEC"},
{"text": "Monsanto =\\﻿", "time": "3 years ago", "author": "Mc Doggerson", "cid": "UghOk2SmOw5gPXgCoAEC"},
{"text": "My Co-Ankle...﻿", "time": "3 years ago", "author": "Jordan Silberman", "cid": "UgheZ25dvvdCRHgCoAEC"},
{"text": "Two men that truly have impacted the world, you have to look along way back in history to find a man that impacted the world so much.﻿", "time": "3 years ago", "author": "rabbitphobia", "cid": "UgjuYQv7NSEbg3gCoAEC"},
{"text": "People here are talking about how Steve Jobs changed the smartphone world n all. I mean yeah he did. But this is not what its about guys, its about making earth a more livable place for people.\n\nP.S. It wasn't Steve Jobs who created Apple alone, Steve Wozniak did most of the work.This guy deserves way more credit for Apple then he gets.﻿", "time": "3 years ago", "author": "Parveen Bhardwaj", "cid": "UgiGq-2GuJ70m3gCoAEC"},
{"text": "Parveen Bhardwaj but Steve Jobs is a person who everyone respects. He made the IPhone 4s which is the best phone because it have the Hack Pass WiFi thingy (doesn’t hack WiFi) but made that your WiFi have literally 4 firewalls﻿", "time": "3 months ago", "author": "MysticEternal Legacy", "cid": "UgiGq-2GuJ70m3gCoAEC.7-H0Z7-7HBH8Y0Uq4a5Dp5"},
{"text": "Oh Woz definitely gets a lot of credit, I'd say he gets more credit than he deserved. He's left Apple in early 80's yet still riding on Apple's success, when Apple Inc's success after Job's return has nothing to do with Woz.﻿", "time": "2 months ago (edited)", "author": "alphazar", "cid": "UgiGq-2GuJ70m3gCoAEC.7-H0Z7-7HBH8YrwKgnsNFd"},
{"text": "FUN FACT: Steve Jobs founded Apple. So there you go.﻿", "time": "2 months ago", "author": "Billy", "cid": "UgiGq-2GuJ70m3gCoAEC.7-H0Z7-7HBH8ZhL2SCC_S9"},
{"text": "Woz dealt with all the technical issues at Apple, a tech company. So there you go. Jobs dreamt, Woz executed﻿", "time": "1 week ago", "author": "Yu An Shi", "cid": "UgiGq-2GuJ70m3gCoAEC.7-H0Z7-7HBH8b02w2obZqz"},
{"text": "Yu An Shi That's an overstatement. Woz was the co-founder of Apple, and the creator of Apple I and Apple II. That is all. The rest of Apple products and the wildly successful Apple company has little if any to do with Woz. Plus there are many many engineers who contributed to Apple. Apple the company is Steve Jobs.﻿", "time": "16 hours ago", "author": "alphazar", "cid": "UgiGq-2GuJ70m3gCoAEC.7-H0Z7-7HBH8bLM6cyY2Q1"},
{"text": "The comments got me thinking.\nIf there was no Windows, would there be no mac.\nIf there was no mac, would there be an iPhone.\nIf there was no iPhone, would there be no Android.\n\nEveryone has an inspiration and we all have to agree, Microsoft started computing well, and Apple created the smartest phones ever!\n\nThese companies have done two great things.﻿", "time": "3 years ago", "author": "Chillius", "cid": "UgiM0Fs2To5gEHgCoAEC"},
{"text": "It's the other way around: If there was no Mac, there wouldn't be Windows.﻿", "time": "3 years ago", "author": "WannaKnowMyName", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP7-_6S1i67A7"},
{"text": "Windows came out before Mac.﻿", "time": "3 years ago", "author": "Chillius", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP7-_9eEUNexG"},
{"text": "We've got the names wrong. Windows copied Apple Lisa, so if there was no Apple Lisa, there wouldn't have been Windows.\n\n(Apple Lisa, release date: 1983.\nWindows 1.0, release date: 1985).﻿", "time": "3 years ago", "author": "WannaKnowMyName", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP7-_ByYtAITy"},
{"text": "But if there was no MS-DOS, Would there be computers?﻿", "time": "3 years ago", "author": "Chillius", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP7-_C1XCGLgV"},
{"text": "We're talking personal computers here. Also, MS-DOS was late to the party, there were several OS doing similar things.﻿", "time": "3 years ago", "author": "WannaKnowMyName", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP7-_CUGhIbXJ"},
{"text": "And without computer you can't type these comments﻿", "time": "3 years ago", "author": "Zack Herffan", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP7-a0_VOjr85"},
{"text": "Who gives a crap? Competition fuels improvement. Maybe had neither one of them been around, we'd have a completely different world. Just give it a rest people﻿", "time": "3 years ago", "author": "Insertnamesz / Lije", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP7-uOPkEf_xp"},
{"text": "no sir check history macintosh was released first the microsoft coppied from it's graphical user interphase and created the windows os we know today,first ever operating system was built in apple also.﻿", "time": "4 months ago", "author": "PRASENJIT DAS", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP8WgBArT0-jj"},
{"text": "The fact still remains, Microsoft saved Apple back in those days. Steve Jobs looked to Gates for help when returning to Apple. Apple was failing and if it wasn't for Microsoft investing and making applications for the Classic Mac operating system, Apple wouldn't be here today.﻿", "time": "4 months ago", "author": "BlueChinchillaEatingDorito", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP8XRf8T9AmGY"},
{"text": "Apple copied xerox﻿", "time": "2 months ago", "author": "Dan Suno", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP8YgnGmUSoga"},
{"text": "Both of them copied pacman﻿", "time": "1 month ago", "author": "Lavar's Balls", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP8_p0aHBCgp0"},
{"text": "Chillius nope cause bill gates bailed Apple out﻿", "time": "3 days ago", "author": "EDM Raver", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP8bEH8L8V9VY"},
{"text": "Microsoft's first computer was released 8 years after the Apple 1.﻿", "time": "2 days ago", "author": "Densetsu ピロマンサー", "cid": "UgiM0Fs2To5gEHgCoAEC.7-H0Z7-F_rP8bHAfq7p6AK"},
{"text": "Haha! Saving lives with GMO crops! That's a good one XD﻿", "time": "3 years ago", "author": "Shakesphere", "cid": "UghuRnVjbvt46ngCoAEC"},
{"text": "drops \"Harvard dropout\" in the middle of nowhere..what a douche﻿", "time": "3 years ago", "author": "Michael Van Bommel", "cid": "UgiSxoKReKcNj3gCoAEC"},
{"text": "I love Apple computers and almost everyone in my family own one. But I've never been asked about my skills on Apple during a job interview. I've been asked about MS Office 90% of the time. I've helped write five different MRP systems always using a PC, never an Apple.﻿", "time": "3 years ago", "author": "John Little", "cid": "UggAfyFZYr1XxngCoAEC"},
{"text": "well these days are over now. The mac has won that battle too. ﻿", "time": "3 years ago", "author": "Gilles Dezeustre", "cid": "UggAfyFZYr1XxngCoAEC.7-H0Z7-GBw77-vITpjgk5-"},
{"text": "+Gilles Dezeustre\nNot so fast, Gilles. I have a new job and was hired because of my knowledge of MS Office on a standard PC. There was no discussion at all about Macs.  I don't see that significantly changing in the next 10 years at least.﻿", "time": "3 years ago", "author": "John Little", "cid": "UggAfyFZYr1XxngCoAEC.7-H0Z7-GBw77-xBh4y2f7R"},
{"text": "Mac won the battle? \nLast time I walked into any hospital/airport/restaurant/office what do I see? \nPC's. PC's galore! ﻿", "time": "2 years ago", "author": "jesseRYU", "cid": "UggAfyFZYr1XxngCoAEC.7-H0Z7-GBw776l8RJzQ67v"},
{"text": "That news anchor is a total cock sucking faggot if i ever seen one.﻿", "time": "3 years ago", "author": "Marcus Decamp", "cid": "UgiYpnYFbLkcBXgCoAEC"},
{"text": "He has done great things and he will continue.well i hope one day the couple will win the Nobel prize.if they haven't﻿", "time": "3 years ago", "author": "Kaven Tmo", "cid": "Ugi8BKaxf8LE0HgCoAEC"},
{"text": "co-ankle﻿", "time": "3 years ago", "author": "ParadoxTV", "cid": "Uggy8U9unYXoHngCoAEC"},
{"text": "co-ankle LOL﻿", "time": "3 years ago", "author": "Stryfe132", "cid": "UghBBmUdb4ofWHgCoAEC"},
{"text": "Yeah, what a fucking idiot!﻿", "time": "1 month ago", "author": "James Ash", "cid": "UghBBmUdb4ofWHgCoAEC.7-H0Z7-0Hoy8_8-nwJ5Rg4"},
{"text": "Stryfe132 i﻿", "time": "1 month ago", "author": "Fahd Fadl", "cid": "UghBBmUdb4ofWHgCoAEC.7-H0Z7-0Hoy8_9I3LfK3uu"},
{"text": "oh shut up it's not like you say everything perfectly either﻿", "time": "1 month ago", "author": "BecauseICanTBH", "cid": "UghBBmUdb4ofWHgCoAEC.7-H0Z7-0Hoy8_VTJiwDJa7"},
{"text": "Gates is pushing us to the stars a beyond. Whether we like it or not.\n\nGates, Jobs(RIP) and Musk are the Carnegie, Morgan and Rockefeller of the modern age.﻿", "time": "3 years ago", "author": "Occams Razor", "cid": "UgiOWxVzcXNPdXgCoAEC"},
{"text": "Bill you are not us and we are not you, straighten your back you hunch back faggot﻿", "time": "3 years ago", "author": "HELP I HAVE NO SKIN", "cid": "Ugj7daaRAYyDJXgCoAEC"},
{"text": "Keyboard Warrior much?﻿", "time": "3 years ago", "author": "Griffin Mann", "cid": "Ugj7daaRAYyDJXgCoAEC.7-H0Z7-C-GN7-Qla-sdiRc"},
{"text": "0/10﻿", "time": "3 years ago", "author": "A Black Guy Talks About", "cid": "Ugj7daaRAYyDJXgCoAEC.7-H0Z7-C-GN7-vAcz8akF9"},
{"text": "+Terry Shaws -1/10﻿", "time": "3 years ago", "author": "A Black Guy Talks About", "cid": "Ugj7daaRAYyDJXgCoAEC.7-H0Z7-C-GN71IxW8eWm2C"},
{"text": "Most people don't know that in todays market a corporation has to have a humanitarian sector of giving back, microsoft saw this years ago and no Bill Gates is presented as some freaking messiah when all he is and all he ever will be is a cut throat business man, former CEO of one of the nastiest corporations in free market history...Its just funny today to see young people or people new to computers look at Bill Gates as anything but vile scum.﻿", "time": "3 years ago", "author": "HELP I HAVE NO SKIN", "cid": "UggPSrlMWk-TPHgCoAEC"},
{"text": "oh no gmo!﻿", "time": "3 years ago", "author": "teh one", "cid": "UggRnSdQFzMLVngCoAEC"},
{"text": "For a smart person he sure invested in a shitty company. Monsanto is shit and they're killing the world. Fucking dumb...﻿", "time": "3 years ago", "author": "jerkface38", "cid": "Ugic5d6tu6jR5HgCoAEC"},
{"text": "What do you actually KNOW about Monsanto?\nAlso provide some Sources OTHER than Wikipedia﻿", "time": "3 years ago", "author": "Griffin Mann", "cid": "Ugic5d6tu6jR5HgCoAEC.7-H0Z7-QBQr7-XfVCo2-tK"},
{"text": "I know of someone that worked for them spraying pesticides and died of lung cancer in his mid/late 30s and he didn't smoke. There are other cases I'm sure. Oh and if you're wondering, proper precautions were taken.﻿", "time": "3 years ago (edited)", "author": "jerkface38", "cid": "Ugic5d6tu6jR5HgCoAEC.7-H0Z7-QBQr70K9P3VUfI-"},
{"text": "Yeah I love your username﻿", "time": "3 years ago", "author": "Mary Pasquesi", "cid": "Ugic5d6tu6jR5HgCoAEC.7-H0Z7-QBQr74lDhoImJqn"},
{"text": "Watch food inc griffin﻿", "time": "2 years ago", "author": "Elliot Nunez", "cid": "Ugic5d6tu6jR5HgCoAEC.7-H0Z7-QBQr7CTQRalcGTR"},
{"text": "Though GMO is not the best idea for hunger now, later as scientists practice in genetics, it could be a viable source later.But don't break the line between rumor and fact.﻿", "time": "2 years ago", "author": "Ducktales", "cid": "Ugic5d6tu6jR5HgCoAEC.7-H0Z7-QBQr7EalYV_rHa3"},
{"text": "Shoot, my grammar sucks.﻿", "time": "2 years ago", "author": "Ducktales", "cid": "Ugic5d6tu6jR5HgCoAEC.7-H0Z7-QBQr7EaldEf5Pds"},
{"text": "its crazy but he probably made a couple of million while just doing this interview lol﻿", "time": "3 years ago", "author": "Nico Tejeda", "cid": "UgikRxV8lYAwQngCoAEC"},
{"text": "bill gates & steve jobs.\n\nthe most influential figures in the IT/ electronics industry.\n\ni think no one will ever replace the genius steve jobs was.\n\nthe greatest milestone of Microsoft is Windows, used on nearly 80~85% of all computers in the world...\n\nwho would've thought a college drop out would become one of the richest men in the world..?\n\n\nthe greatest failure of tim Cook is that he was unable to become the mentor and inspirational model steve jobs was.\n\n\n(comment posted from my windows 7 PC)﻿", "time": "3 years ago", "author": "Daniel Watson", "cid": "UgjAeOMPFqVWe3gCoAEC"},
{"text": "Monsanto makes me puke, they sell seeds of GMOs that dont give off seeds so the farmers have to buy seeds from them every harvest. in addition to that they destroys the soil. and monsanto is already rich but you HAVE to invest for them??? his cash will just goes to shitting on the poor some more what an idiot.﻿", "time": "3 years ago (edited)", "author": "deduzz", "cid": "UgjaTcRCJ6mdlngCoAEC"},
{"text": "Altering the chromosomes of organisms can often result in infertility so maybe the plants just cant produce seeds biologically?﻿", "time": "3 years ago", "author": "psmanici4", "cid": "UgjaTcRCJ6mdlngCoAEC.7-H0Z7-AQTz720U7Os6tvZ"},
{"text": "+psmanici4 yes, but thats their excuse tho, they can totally wait and 'rebreed' that same strand of DNA so that it becomes stable. Hell man we engineered them to produced more and bigger seed before, there are absolutely no other excuses but PROFIT! ﻿", "time": "3 years ago", "author": "deduzz", "cid": "UgjaTcRCJ6mdlngCoAEC.7-H0Z7-AQTz72dSzxZow0S"},
{"text": "+psmanici4 The GMO are not infertil(the biggest part) they use the \"GURT\" for do this job. But in south america they found GMO in no GMO field with no reason. Because the Mosento GMO are not infertil and if you use the seed(even if we don't know) you can be condamned like mosento do with Vernon Hugh Bowman.﻿", "time": "3 years ago", "author": "Raoulos Iers", "cid": "UgjaTcRCJ6mdlngCoAEC.7-H0Z7-AQTz72gZNHLlNAT"},
{"text": "It's clear to me that Bill's ideas are not even close to the calibre of Steve's ideas﻿", "time": "3 years ago", "author": "Carol Hathor", "cid": "UghUVeEt56HcgXgCoAEC"},
{"text": "You're spot on.  Microsoft created an empire by stealing an Apple product.  Apple on the other hand has a culture of  constant innovation. This is why Apple continues to revolutionize markets while Microsoft have lost their identity as PC desktops are becoming more and more obsolete. ﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU7-JKDXFykjA"},
{"text": "+HereAtApple\n Are you sure Bill stole from Apple? You sure Steve didn't ripped of Xerox in 1979? Xerox demonstrated GUI, mouse and windows in 1979. Xerox 3 button mouse had a price tag of $15, while apple had the price tag of $300. Don't freaking talk about Innovations by stealing. Computers became personal because of windows, not because of Apple. Most of the world would not be able to afford computers, if they had to buy Apple craputers rather than windows PCs.﻿", "time": "3 years ago", "author": "Shariar Bizon", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU7-MGnf65uyy"},
{"text": "+Shariar Bizon Apple saw a prototype at PARC, but the work they did on GUI was extensive.  Microsoft stole Apple's innovations on GUI while Apple rightfully had access to PARC and even used PARC employees to develop Mac/Lisa.  Gate just straight up stole it.  Thats why Microsoft is going downhill, they're not successful from innovation, just one copied product.﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU7-MsFi_S7PG"},
{"text": "+Shariar Bizon Yes Bill stole from Apple.  Theres thousands of prototypes for different innovations. Bill stole GUI because Apple was working on it.  Apple paid lots of equity for that free tour around PARC.  Bill stole GUI from Apple by breaching a contract.  ﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU70dlV1Ag-RP"},
{"text": "+MexicanGuppy Downhill?  Haha, their greatest invention will be unveiled in October.  Apples about to explode.  ﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU70dlYBqsTl1"},
{"text": "+HereAtApple \"Apple paid lots of equity for that free tour around PARC\" \nReally???? :O﻿", "time": "3 years ago", "author": "Shariar Bizon", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU70fB60Bu6Zl"},
{"text": "Yup, look it up.  They gave shares to Xerox for that tour.  They had full rights to GUI. Gates, stole it from Apple.﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU70fhcK38GQ7"},
{"text": "As you already know the fact, why don't you give the Link or reference :D ﻿", "time": "3 years ago", "author": "Shariar Bizon", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU70hAPf8c-EF"},
{"text": "+Shariar Bizon If you want the truth, seek it.  I won't shove it in your face. ﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU70hICdz4uOP"},
{"text": "Can you tell when Steve Jobs had humanitarian ideas to save people from diseases?Bill Gates is also much more human than Steve Jobs. Steve Jobs was so full of himself and pretty much betrayed everyone he worked with. Go and read about him backstabbing Woz on one of their first projects together.﻿", "time": "3 years ago", "author": "Ali Hadizadeh", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU71AnabpaoeW"},
{"text": "+Ali Hadizadeh Actually Steve Jobs donated tons of money to charitable causes.  He just did so anonymously, and it was revealed only after he died.  So whose full of himself now?﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU71CfvzdqFEm"},
{"text": "+HereAtApple\nHe did not. You can't pull stuff out of your ass. You know that, right? He donated some money only after he received a donated organ, liver, from another person. I guess anyone would be kind at that point.\nI'm not saying Bill Gates is Buddha or Gandhi, by the way but he is definitely a better person than Steve Jobs.\nI don't want to continue this debate with you. Like they say: \"Never get involved in an argument with a stupid person because an observer can't tell the difference.\"﻿", "time": "3 years ago (edited)", "author": "Ali Hadizadeh", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU71Ci-iNc6tR"},
{"text": "http://www.news.com.au/finance/money/steve-jobs-secretly-gave-millions-to-charity-publically-criticised-for-not-doing-enough/story-e6frfmd9-1226650636880\n\nThere, now do me a favor, look in the mirror, and call yourself an asshole.﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU71HpQfutL4Q"},
{"text": "Bullshit, Apple hired Microsoft in 1980s to write their software. Microsoft never really hired Apple at all they admit this in an interview together! Steve was playing catch up and guess what Steve was never the richest man in the world but tried his hardest by making everything ridiculously priced. Bill gates wanted to improve the world with cheap tech for everyone Also there is interview! He wanted people to afford a PCs. PC run more software than Macs. Macs are shit﻿", "time": "3 years ago", "author": "wtfMYRON", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU71vFt2y3s20"},
{"text": "+HipDubHopStep Exactly, Apple gave Microsoft a computer, and said \"Write us some apps.\"  Microsoft ended up stealing the entire computer.  Bill is not creative, he's just a shrew businessman.  Steve was an artist.  ﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU71wWR7XaxQW"},
{"text": "+HereAtApple Bill went around the world Giving away PCs and has since given away 26 billion $ and possibly more now of his wealth and asked other billionaires to do the same and has irradiated polio from India. and is working in African countries. So wtf has your artist done but make expensive plastic things with lights? ﻿", "time": "3 years ago (edited)", "author": "wtfMYRON", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU72NNnldschn"},
{"text": "+HipDubHopStep Jobs was also involved in philanthropy, just not publicly.  And he didn't work with most big charity organizations because in classic Steve style \"They had it all wrong.\" And he was probably right about that. ﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU72OTEt5D5gm"},
{"text": "+HipDubHopStep I respect Bill for his philanthropy, but Steves inventions did more good for the world than all of Bills philanthropy.﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU72OTLL7G1r6"},
{"text": "+HereAtApple Was Gates wrong when I destroyed polyo in India?﻿", "time": "3 years ago", "author": "deckkie", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU72S_ZIz2JvB"},
{"text": "+HereAtApple \"PC desktops are becoming more and more obsolete. \" HAHAHA, have you seen the phrase \"PC MASTER RACE\"? It's fucking growing more than ever with gaming and performance overkill over consoles.﻿", "time": "3 years ago", "author": "Joseph Serrano", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU72YXgxfg1mx"},
{"text": "+Joseph Serrano Yea PCs are still the best for gaming, and thats about it.﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU72YYazDYOFV"},
{"text": "+HereAtApple Sound Production and Video Editing is about the only thing I could think of that Mac might be better for, even then not by much. They are well made machines but ridiculously overpriced, a Macbook is the only Apple product I would ever consider buying. ﻿", "time": "3 years ago", "author": "Ben Bourke", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU738wsK3euOK"},
{"text": "+Ben Bourke Macs are better at the most important things: Using the internet, navigating an interface, and making stuff.  Using a Mac will save you hours of your life just from doing those three tasks more efficiently. ﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU739WHSNgFJb"},
{"text": "+HereAtApple\nI think you forgot to add, \"YHBT. HAND.\"﻿", "time": "3 years ago", "author": "Curtis Dyer", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU73a58E2lWzX"},
{"text": "Hi﻿", "time": "3 years ago (edited)", "author": "Harman Rao", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU74BrSxa6p2Q"},
{"text": "It seemed to me he didn't really want to\nTouch on Steve Jobs neither﻿", "time": "3 years ago", "author": "Mark Jones", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU74HlQ5IMxQW"},
{"text": "+Harman Rao He did give his wealth to charity, anonymously. Some of the greatest minds on Earth have used drugs. You only see the negatives, because you feel like you've discovered a hidden truth.  But in reality you can't critically analyze obvious truths for shit.  Basically you're a dumbass. ﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU74LFzjgZZ3o"},
{"text": "+Time8 fucking ass wipe bitch﻿", "time": "3 years ago", "author": "abc1234", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77H2pSAzi_E"},
{"text": "+tjkr3658 Hos gonna ho ﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77HiSIX8Vnj"},
{"text": "+Time8 Lick my cunt﻿", "time": "3 years ago", "author": "abc1234", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77HrRdkEYcR"},
{"text": "+tjkr3658 word﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77JYM6246WW"},
{"text": "+Time8 fuck off you asshole﻿", "time": "3 years ago", "author": "abc1234", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77JfGdRMD1J"},
{"text": "+tjkr3658 teeheeehee﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77Jg8UJvA4x"},
{"text": "shut the fuck up﻿", "time": "3 years ago", "author": "abc1234", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77Jg_uCYAx3"},
{"text": "+tjkr3658 fiiiineee﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77JsLy00I4h"},
{"text": "+Time8 cunt﻿", "time": "3 years ago", "author": "abc1234", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77KALvKhB-1"},
{"text": "+tjkr3658 ass﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77KK0RJny66"},
{"text": "shut up bitch﻿", "time": "3 years ago", "author": "abc1234", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77KMUs3ZQLm"},
{"text": "+tjkr3658 We caaaaant stop....we woooont stop ﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77KUdQ3fzY9"},
{"text": "macfag﻿", "time": "3 years ago", "author": "abc1234", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77KYDp0Y5U_"},
{"text": "+Time8 paki﻿", "time": "3 years ago", "author": "abc1234", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77KYaLccqYK"},
{"text": "+Time8 cuntface nigger bitch﻿", "time": "3 years ago", "author": "abc1234", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77KYbNjUoVU"},
{"text": "+Time8 lick my fucking ass you stupid white motherfucker ﻿", "time": "3 years ago", "author": "abc1234", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77KYeNfuP1t"},
{"text": "+Time8 bitch﻿", "time": "3 years ago", "author": "abc1234", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77KYfBXfTTa"},
{"text": "+tjkr3658 we could'v had it all﻿", "time": "3 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77KZ6n64O-F"},
{"text": "+Time8 suck my dick whity﻿", "time": "3 years ago", "author": "abc1234", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77KZmbak_u4"},
{"text": "Yeah, man, combining a phone, mp3 player, and web browser all in one way outstrips eradicating fucking malaria, you bourgeois twit.﻿", "time": "3 years ago", "author": "PagerNinerTwelve", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU77U9MCzRzUQ"},
{"text": "+Time8 You're so wrong about PC desktops becoming \"obsolete\" lmao.﻿", "time": "2 years ago", "author": "MastaGambit", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU7BVyXrN_wxR"},
{"text": "+MastaGambit slowly but surely﻿", "time": "2 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU7BW-k1IUCbV"},
{"text": "+Time8\nYeahno.  Just because a majority of people in the world are computer-illiterate does not mean that laptops will completely obsolify desktops. ;)﻿", "time": "2 years ago (edited)", "author": "MastaGambit", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU7BW16HrdiPu"},
{"text": "+MastaGambit I'll never forget having a meeting from a rep from Microsoft, and another meeting with a rep from Google.  Both using MacBooks.  ﻿", "time": "2 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU7BWAJ5TeEvS"},
{"text": "+Time8\nThat doesn't mean desktops are obsolete though.﻿", "time": "2 years ago", "author": "MastaGambit", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU7BWAwuiKCUk"},
{"text": "+MastaGambit I didn't say the are obsolete. I said they were becoming obsolete.﻿", "time": "2 years ago", "author": "Time8", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU7BWMAaDojC9"},
{"text": "+Time8\nyouknowwhatimean.jpg﻿", "time": "2 years ago", "author": "MastaGambit", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU7BWzmU9qUOk"},
{"text": "Carol Hathor How about you guys stfu and stop doing these apple vs microsoft wars. They were both great humans﻿", "time": "7 months ago", "author": "Lasko Tii", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU8SiXFy8Ya4B"},
{"text": "2 year ago or not, you're a fucking moron﻿", "time": "5 months ago", "author": "stephen ledford", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU8VmgdON5Xcn"},
{"text": "If you think Apple has contributed to technological innovation more so than gate's you're just a plain idiot.﻿", "time": "5 months ago (edited)", "author": "Tyler Evans", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU8VsospSkPuo"},
{"text": "Bahhh bahhh﻿", "time": "3 months ago", "author": "tubenachos", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU8YBemZ07pYz"},
{"text": "Shariar Bizon you're a pathetic little liar. It was Xerox's mouse that was $300, Jobs made Apple mouse for $15 and made it reliable and mainstream. Xerox Alto was never intended for personal use because of extremely high price tag. Jobs also didn't steal anything from Xerox, he got the demo after offering Apple stocks to Xerox at a discount. Xerox made millions from Apple stock, all Apple got was a demo. Apple developed their GUI entirely in-house.﻿", "time": "2 months ago", "author": "alphazar", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU8YrxLIXskNW"},
{"text": "Yeah, because that's what this video is about.  Moron.﻿", "time": "4 weeks ago", "author": "Darrin Nunyah", "cid": "UghUVeEt56HcgXgCoAEC.7-H0Z7-QifU8aEhVWNixHY"},
{"text": "@AskTHE NSA And Steve Jobs saved millions of kid by building a ridiculous massive private yacht... --'﻿", "time": "3 years ago", "author": "", "cid": "UgjEpFfDEswf0ngCoAEC"},
{"text": "I usually pee on the side of the toilet so it makes less noise﻿", "time": "3 years ago", "author": "John S", "cid": "UghrpRCdDMJMF3gCoAEC"},
{"text": "no sound?﻿", "time": "3 years ago", "author": "McBmMusic", "cid": "UgiEUZUM5TnMmHgCoAEC"},
{"text": "This is what we need for the future. The wealthy who know when they have plenty and give the rest. The score should be not, how much I have, but how much I have given away.﻿", "time": "3 years ago", "author": "Lillieannen Sorensen", "cid": "UgjsLGlkjiXO-3gCoAEC"},
{"text": "Just think that these two men have changed the world 5x over. ﻿", "time": "3 years ago", "author": "Jon MRC", "cid": "UgiQYOpjdLMCO3gCoAEC"},
{"text": "interviewing Bill, reading notes from an iPad, brilliant.﻿", "time": "3 years ago", "author": "Rowan Evans", "cid": "UghM6FDmMM12MngCoAEC"},
{"text": "Google, the developers of Android, primarily use i Macs in their office. They even encourage their developers to get one free of cost. Dont be too surprised lol.﻿", "time": "1 month ago", "author": "Nikhil Pandey", "cid": "UghM6FDmMM12MngCoAEC.7-H0Z7-UuuK8_BETDHLAvh"},
{"text": "Poison and kill millions with your GMO foods﻿", "time": "3 years ago", "author": "AskTHE NSA", "cid": "UgiA9kIkcWs96ngCoAEC"},
{"text": "Bill Gates is a evil child molester illuminati pheened.﻿", "time": "3 years ago", "author": "AskTHE NSA", "cid": "UghASW9nc8gjpHgCoAEC"},
{"text": "CO-ANKLE!﻿", "time": "3 years ago", "author": "primeevil", "cid": "UghZ28jSm7OESHgCoAEC"},
{"text": "Bill Gates has his heart in the right place, but he doesn't realize that by supporting Monsanto, he is promoting the foods into becoming pesticides themselves. This is not good. Yes, bugs won't eat them, but some things (like Mother Nature) are not meant to be tampered with. We don't want our foods to become pesticides - yikes! ﻿", "time": "3 years ago", "author": "Diana D", "cid": "UgilUrqArZV9zXgCoAEC"},
{"text": "Diana D     Internet fear mongering with nothing to back it up but poster board slogans.   Yawn﻿", "time": "2 months ago", "author": "J Shepard", "cid": "UgilUrqArZV9zXgCoAEC.7-H0Z7-3GHb8ZBFrk9TroD"},
{"text": "I'm a bit displeased with Microsoft's decision to help Monsanto, a company that has no ethics and would do anything to control the entire food market, while Bill Gates gives medical aide around the world. The world will change once we understand that by manipulating the environment we give great cause for many future problems. I really wonder if Bill Gates and or the Corporate of Monsanto actually eat their own product?  ﻿", "time": "3 years ago", "author": "David B", "cid": "UgjJGDU5fpNnLngCoAEC"},
{"text": "You can bet your ass they don't and you can bet your ass Bill Gate's kids don't go to a school that teaches Common Core Education.﻿", "time": "3 years ago", "author": "james rae", "cid": "UgjJGDU5fpNnLngCoAEC.7-H0Z7-EnO57BenTJR5T_7"},
{"text": "what a hero.﻿", "time": "3 years ago", "author": "Judge Dead", "cid": "Ugj9jJNM3UlKL3gCoAEC"},
{"text": "WOW! almost cured a whole disease! great job bill you are awesome!!!!!﻿", "time": "3 years ago", "author": "Steve", "cid": "UgjsyGw0QUw163gCoAEC"},
{"text": "Bill Gates is a great human being.﻿", "time": "3 years ago", "author": "SOLID MOE", "cid": "Ugj_iMl0RZiAZXgCoAEC"},
{"text": "Agreed. Bill Gates > Steve Jobs. There is no contest.﻿", "time": "3 years ago", "author": "powerpsi /", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO79xIQcKZ-7P"},
{"text": "Tru Dat!!!!﻿", "time": "2 years ago", "author": "Dave Van Meter", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO7FPlDAzwIeq"},
{"text": "+powerpsi / Or we could just live with the fact that both human beings have spearheaded equally great advancements and we don't need to have a god-damn dominancy test for every single person whose ever been in competition with one-another. Jeez...﻿", "time": "2 years ago (edited)", "author": "MastaGambit", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO7Gtjq4e-ks7"},
{"text": "+MastaGambit So I take it either you're a woman or a low testosterone male is that it?﻿", "time": "2 years ago", "author": "powerpsi /", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO7H2ChT3I8_d"},
{"text": "+powerpsi /\nAnd I take it that you're an ignorant male whose heavily insecure about his lack of a penis and compensates for it by targeting other people's penises instead? :^)\n\nGod I can't believe people like you still exist here... >_>﻿", "time": "2 years ago (edited)", "author": "MastaGambit", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO7H2f9Id62CH"},
{"text": "I think you're misconstruing his message too make yourself feel better about what ever personal dilemma you are or potentially have gone through, not to say i know for certain because i certainly do not. But equally great? Absolutely not, not even close. Steve Jobs was an amazing character DO NOT get me wrong he was indubitably a truly brilliant individual. Steve wasn't of the same caliber as Bill Gates; Nor were his achievements. Bill has proven to his friends, colleagues, investors, family and many more to be true to his word. Unlike Steve Jobs, Bill has stood the test of time and has changed this world in ways Steve couldn't have in his wildest dreams. So as for their achievements being \"equal\" absolutely not.﻿", "time": "10 months ago", "author": "hueyhewton", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO8Pa8KxgIZIE"},
{"text": "Name one iTrash product that is an \"advancement\" in technology﻿", "time": "9 months ago", "author": "Bacon", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO8QaM2XIrpE9"},
{"text": "that wants human depopulation﻿", "time": "9 months ago", "author": "Lil Rick", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO8RCGZhfe55A"},
{"text": "Little Riiiick!﻿", "time": "8 months ago", "author": "Jousty Birdington", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO8RtBXKtSqKg"},
{"text": "@ rick,   7 billion and counting, a little depopulation ain't a bad thing.﻿", "time": "8 months ago", "author": "Bredbeddle deHautdesert", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO8RziEnOA_Mw"},
{"text": "SOLID MOE i agree, steve jobs is a prick﻿", "time": "7 months ago", "author": "Mario Carmona", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO8TY0QTH-1tZ"},
{"text": "he is a great person you ever will be in your pathetic life﻿", "time": "6 months ago", "author": "Lucifer Deathdig", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO8U9E1c88Hox"},
{"text": "If we have to be precise, Bill Gates is worst of the worst.﻿", "time": "3 months ago", "author": "Antun Šturlić", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO8YeKXGqmeOt"},
{"text": "Isnt this a diversion..? Wasn't it Bill Gates that signed the document agreeing to kill half the population on earth?﻿", "time": "1 month ago", "author": "Lavar's Balls", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO8_p0mUgecZ2"},
{"text": "hueyhewton ...l  agree. ..couldn't have put it better myself. ..and if jobs was alive today ..he'd agree as well. ..who knows your self  better then ..well. ..your self. ..I'm sure jobs never thought of himself as a great humanitarian even a good person...who would know there own flaws better then themselves. ..no doubt gates has flaws to...we are only human after all...but there's no denying what bill and his wife have done for humanity and will continue to do...the world's a better place with people like the gates in it.﻿", "time": "20 hours ago", "author": "David Hemopo", "cid": "Ugj_iMl0RZiAZXgCoAEC.7-H0Z7-2zdO8bKyjlRofuB"},
{"text": "Co-Ankle!!! But you have 2 already.﻿", "time": "3 years ago", "author": "SOLID MOE", "cid": "Ugj2Xl7KJMNa0HgCoAEC"},
{"text": "Monsanto will control the food of the world. No GMO's!!!﻿", "time": "3 years ago", "author": "Lisa Vegan Aus", "cid": "UgiBn9Le8vQHvngCoAEC"},
{"text": "Lisa Vegan Aus      You really haven't figured out that the market controls Monsanto, not the other way around?   The paranoia is strong with this one.﻿", "time": "2 months ago", "author": "J Shepard", "cid": "UgiBn9Le8vQHvngCoAEC.7-H0Z7-5YR08ZBFY6jKO8C"},
{"text": "Come on guys, there are alot worse people who could be the richest person in the world.  ﻿", "time": "4 years ago", "author": "Wendel Bolide", "cid": "Ughh8Up_6lpXsXgCoAEC"},
{"text": "What do you mean? He is pretty much the number one philanthropist. How can he be bad?﻿", "time": "3 years ago", "author": "Pokemon_Jesus", "cid": "Ughh8Up_6lpXsXgCoAEC.7-H0Z7-HVni79BxHIlgU2W"},
{"text": "he is richest person now﻿", "time": "4 years ago", "author": "Muscab", "cid": "UgiVtZuqgmWu63gCoAEC"},
{"text": "bill gates obituary \"he copied people with better ideas and made lots of money.\"﻿", "time": "4 years ago", "author": "Lavalambtron", "cid": "UghUJ3ZOzvaBOngCoAEC"},
{"text": "your obituary: loser talking shit about people who have done more than you ever could in a 1000 lifetimes.﻿", "time": "4 years ago", "author": "Jeanny Tse", "cid": "UghUJ3ZOzvaBOngCoAEC.7-H0Z7-3-mD7-bNvd9Qq3E"},
{"text": "+Jeanny Tse\nGo back to china and eat dog.﻿", "time": "4 years ago", "author": "Lavalambtron", "cid": "UghUJ3ZOzvaBOngCoAEC.7-H0Z7-3-mD7-cSOcSl5Wn"},
{"text": "why, I love dogs..... they are delicious﻿", "time": "4 years ago", "author": "Jeanny Tse", "cid": "UghUJ3ZOzvaBOngCoAEC.7-H0Z7-3-mD7-iuAHjEZ3l"},
{"text": "+Jeanny Tse LOL good one.﻿", "time": "3 years ago", "author": "Rafael De Oliveira", "cid": "UghUJ3ZOzvaBOngCoAEC.7-H0Z7-3-mD79vMBJHiBQv"},
{"text": "You're all going to Hell.﻿", "time": "3 years ago", "author": "Lavalambtron", "cid": "UghUJ3ZOzvaBOngCoAEC.7-H0Z7-3-mD79wrcWUS1Rs"},
{"text": "co-ankle\n﻿", "time": "4 years ago", "author": "Eric", "cid": "UgxN3phXv5Zrar-NvKx4AaABAg"},
{"text": "Bill Gates just gave the Amendment 66 campaign in Colorado 1 million dollars. I didn't know that Bill Gates had a horse in the Amendment 66 race in Colorado. Living in Colorado, I resent outsiders influencing our politics with their money.﻿", "time": "4 years ago", "author": "Erik Swenson", "cid": "UgwErCtKzpqSPXR3KXh4AaABAg"},
{"text": "i love this guy!﻿", "time": "4 years ago", "author": "trifio5242", "cid": "Ugz-kHOAdGiLh3Yq9fF4AaABAg"},
{"text": "Charge him with donating $26 Billion? lol to HELP? lol. How much have you donated since this comment? Probably $0 ﻿", "time": "4 years ago", "author": "Dweebix", "cid": "Ugx4mOJOTg83e_NwBy94AaABAg"},
{"text": "Anybody care about talking about the co-ankle? lol.﻿", "time": "4 years ago", "author": "Dweebix", "cid": "Ugx_a9YNhZ62x5GGiEl4AaABAg"},
{"text": "Yup this site is just sending out 100% free Black Apple iPads for today only. \r\n\r\nBut you do have to be fill out your address but it is all real, I claimed my one a few minutes ago. Better hurry up! UPAD3.COM\r\n\r\nI was going to rise, do some typing and coffee drinking in the kitchen all day since at that time work, work was my dominant thought, not love- not the pain which impels me to write this e﻿", "time": "4 years ago", "author": "mohammed sajad", "cid": "UgxOF7Z1A7UfrQK7IzJ4AaABAg"},
{"text": "They should also try making a cure for nuts like you..﻿", "time": "4 years ago", "author": "Tony Wayne", "cid": "UgwaAyF2P45poGwUlgB4AaABAg"},
{"text": "LOL you think Monsanto and GMO foods are good!! Good luck with your life xD﻿", "time": "4 years ago", "author": "mattyguitar22", "cid": "UgwmOSKH_JrsrxuvoE94AaABAg"},
{"text": "monsanto is a evil corporation. Sorry Bill. ﻿", "time": "4 years ago", "author": "vlun121", "cid": "UgwwQIkzNPaXFi0bGpx4AaABAg"},
{"text": "The people getting treatment are more concerned about NOT dying than a job in some other country thousands of miles away. Try improving your chances of getting that job instead instead of blaming others for your problems﻿", "time": "4 years ago", "author": "Cue Mage", "cid": "UgzqOUwwDhVPsREaJl54AaABAg"},
{"text": "How many times has a pharmaceutical drug been released for public consumption only to be banned due to unforeseen future side effects? But hey since you know how science works and all, and don't mind being a guinea pig, continue to stuff your face with GMO foods. ﻿", "time": "4 years ago", "author": "vitamincisgoodforme", "cid": "Ugwm33YIRkRYBzdbD4h4AaABAg"},
{"text": "The mainstream scientific community does, so I do. It's up to the anti-GMO sillies to prove that they do have any harmful effects, because they haven't yet after so many years of trying. That day will never come, but if it did, you'd change my mind as soon as you showed me the evidence, since, you know, that's how science works.﻿", "time": "4 years ago", "author": "Alex Delarge", "cid": "Ugy6rqmeNbs4ojl_NQZ4AaABAg"},
{"text": "If Bill Gates is donating so much money how is he getting richer? lol ﻿", "time": "4 years ago", "author": "vitamincisgoodforme", "cid": "Ugx4wt0nh3zQcBCvazd4AaABAg"},
{"text": "May your children grow up strong and healthy on genetically modified soy and rice lol ﻿", "time": "4 years ago", "author": "vitamincisgoodforme", "cid": "Ugx5Ygv3oe5gePCivDJ4AaABAg"},
{"text": "Ok everybody Alex Delarge say's GMO foods are totally safe, lets all take his word for it! ﻿", "time": "4 years ago", "author": "vitamincisgoodforme", "cid": "UgygpGFgF9LSajStceh4AaABAg"},
{"text": "Bill eradicaed polio from India ???!!!\nHey, Indians have internet & youtube too ! Don't bullshit so blatantly !\nIt's about 2 generations since we saw a polio case in India; and it's taken a lot more than one man's surplus money to do that.﻿", "time": "4 years ago", "author": "BR Gurunandan", "cid": "UgzmhyGStzXvH84kKN14AaABAg"},
{"text": "GMOs are absolutely no different from non-GMO food and there is no scientific evidence to prove otherwise. Anyone who hates Monsanto for GMO foods let their opinion be changed by that shitty Food Inc. movie.﻿", "time": "4 years ago", "author": "Alex Delarge", "cid": "UgygKVQufy_h6mC4SDx4AaABAg"},
{"text": "LOL Bill Gates eradicated polio from India. Are you serious ? India has been working on eradicating polio for last 3 decades.﻿", "time": "4 years ago", "author": "mumbai3008", "cid": "UgxaBWS1cAohCOdFA114AaABAg"},
{"text": "fuck monsanto﻿", "time": "4 years ago", "author": "Daniel Pagan", "cid": "UgwhlM_W2X7weeFMwMR4AaABAg"},
{"text": "yeah so?﻿", "time": "4 years ago", "author": "Md Ha", "cid": "Ugyr3ZuHBYvvNubl4vN4AaABAg"},
{"text": "so where is the conflict of of interest? would you care to elaborate?﻿", "time": "4 years ago", "author": "Ilsimeone", "cid": "UgwVh10hGtAYFvfTq814AaABAg"},
{"text": "Do you have a source for all that nonsense?﻿", "time": "4 years ago", "author": "KaptainEpik", "cid": "UgwVeJ0C-De0RVGwZct4AaABAg"},
{"text": "I've already explained what tests and regulations I've seen and even taken part in involving GMO's and how any negative affects are caused by taking it to extremes, and how GMO is a vague term and so deeming it all bad is ridiculous, the fact that people are downvoting my comments that are backed up with actual experience whilst yours are conspiracy driven under the idiotic idea that mass genocide is the goal of GMO's have no backing to them, makes me loose faith with the intelligence of today.﻿", "time": "4 years ago", "author": "Dr Matt Phillips", "cid": "Ugygk-jtjwYhqVCFz8V4AaABAg"},
{"text": "Lol why is it the giant corporations who are for gmo's, while it's the individuals who (for the most part) are against them? ﻿", "time": "4 years ago", "author": "Nicole D", "cid": "UgxICwuSmw-R2jxdOhx4AaABAg"},
{"text": "glad someone thinks so.... still waiting on Kaptain Epik's proof that GMO's are 100% safe and Bill Gates doesn't have alterior motives.. oh wait, according to Monsanto we don't need to test them for safety.. it's all good! There is only one way and that is for us as a population to wake up - it is happening, but I fear too slowly.... ﻿", "time": "4 years ago", "author": "Mitch Callander", "cid": "UgwQ_JpBknVvCWQEwQ54AaABAg"},
{"text": "cool story﻿", "time": "4 years ago", "author": "KyleChristopher", "cid": "UgzoEwtAvzh8vBxZump4AaABAg"},
{"text": "Nature has selected you for self administered extinction.﻿", "time": "4 years ago", "author": "Alexander Federowicz", "cid": "Ugz_yO8iO0cxLJFJO0x4AaABAg"},
{"text": "plausible deniability is your answer to all, and I also suppose you deem A. Hitler as the greatest humanitarian of his time.﻿", "time": "4 years ago", "author": "Alexander Federowicz", "cid": "UgwrNw9QuUIKCWZzTCh4AaABAg"},
{"text": "maybe you would like to eat a steady diet of it. go ahead be my guest.﻿", "time": "4 years ago", "author": "Alexander Federowicz", "cid": "Ugyj_c0R9uOu1mHyq9Z4AaABAg"},
{"text": "That is a simple conflict of interest. It's called logic 101.﻿", "time": "4 years ago", "author": "Alexander Federowicz", "cid": "UgygDltQ6bwzMKAzFT54AaABAg"},
{"text": "Thank you :-)  Eloquently Stated.﻿", "time": "4 years ago", "author": "Alexander Federowicz", "cid": "UgzPaL6ZcVGJWWQ1UKx4AaABAg"},
{"text": "Good luck with bonding pesticide producing DNA to yours. ALL the Monsanto LAB RAT's got tumors after 2 years, and Monsanto ended the term of those experiments just before the tumors developed. This has been published in scientific journals. You or your children certainly deserve to die from cancer in place of any 3'rd worlder's who have no access to internet data, but would not eat the crap if they knew. Most likely you are hired to write for Monsanto. ﻿", "time": "4 years ago", "author": "Alexander Federowicz", "cid": "UgwvbCCtrzfYWRp71pZ4AaABAg"},
{"text": "Good luck with bonding pesticide producing DNA to yours. ALL the Monsanto LAB RAT's got tumors after 2 years, and Monsanto ended the term of those experiments just before the tumors developed. This has been published in scientific journals. You or your children certainly deserve to die from cancer in place of any 3'rd worlder's who have no access to internet data, but would not eat the crap if they knew. Most likely you are hired to write for Monsanto. ﻿", "time": "4 years ago", "author": "Alexander Federowicz", "cid": "Ugwv722OWnXb68HLbCJ4AaABAg"},
{"text": "Btw, tremendously high population growth is one of the biggest challenges that mankind is facing today, the human population is growing by 200.000 people per day and 1.8% per year, in 2050 there will be 10 bn ppl on earth. High population growth will create only further misery, destruction and war on this planet.﻿", "time": "4 years ago", "author": "Ilsimeone", "cid": "UgyFsg_uChOTK6RN6Bt4AaABAg"},
{"text": "Don't spread lies here, he did not advocate the reduction of the human population, he advocated limiting population growth by using vaccines that drop the mortality rate, because it is a proven fact that as soon as mortality rates start to fall, birth rates follow (Forbes 11 Feb 2011: \"With Vaccines, Bill Gates Changes The World Again\").﻿", "time": "4 years ago", "author": "Ilsimeone", "cid": "Ugw_y1oFHQ-1GegGipV4AaABAg"},
{"text": "I take it you have proof of your allegations? A simple link perhaps?﻿", "time": "4 years ago", "author": "hedegaard8", "cid": "Ugy1pDy3M7G4nziRgix4AaABAg"},
{"text": "yeah. alright. penny stocks trading needs good patience and advice from experienced professionals. be mature and do this, One of my friend making tons of money from penny stocks with professional easy guidance. its worth a try here  ==> bit.ly/17AP9kh?=qyubrt﻿", "time": "4 years ago", "author": "pavan chandra", "cid": "UgzXJfnh9z9ZCXvC19R4AaABAg"},
{"text": "Eugenics and Bill Gates: Software billionaire Bill Gates, who previously has advocated the reduction of the human population through the use of vaccines, and his wife Melinda marked the 100th year since the First International Eugenics Congress in London with a “family planning” summit with abortionists and the United Nations.﻿", "time": "4 years ago", "author": "lazymo2", "cid": "Ugzw3n00MhaxGnrPfoV4AaABAg"},
{"text": "you better do some reading...﻿", "time": "4 years ago", "author": "lazymo2", "cid": "Ugys7ussvxCwPcEIHzp4AaABAg"},
{"text": "Shut. The. Fuck. Up. ﻿", "time": "4 years ago", "author": "KyleChristopher", "cid": "UgxIWYDxVK7BWhj3qkd4AaABAg"},
{"text": "I don't work for myself, I work with a large group of people who also do the same research as I and come up with the same results, if it were a chance of me getting it wrong then fair enough, but a large group of qualified people all doing their independent research and getting the same results? it does older the DNA when the GMO is taken to particular extremes, however with basic editing that is being used that Gates speaks of, DNA alters would never happen, which is why context is important.﻿", "time": "4 years ago", "author": "Dr Matt Phillips", "cid": "Ugw6T7T5Jd_JiTwsxOd4AaABAg"},
{"text": "I never said my career was as a researcher I said research is a large part of my career, Anything genetically modified isn't negative to the system, I can point to hundreds of cases were food has been modified so people with particular allergies won't be negatively affected by them, no negative affects were shown from the intake of that food, that's one of many examples, assuming everything in such a wide and broad category is bad is just lazy, your constant attacks at me really speak volumes. ﻿", "time": "4 years ago", "author": "Dr Matt Phillips", "cid": "UgxXEcQ5Cj5OMfBfFCl4AaABAg"},
{"text": "Last one, and then I'm done with this.  Anything that's modified IS mutated.  Do you even read what you write before you hit 'post', or does the bullshit just come off the top of your head with absolutely no thought whatsoever?  Good luck in your life and your 'career as researcher'.  Hopefully someday your research will help to find out why people can be so naive when the truth is staring them right in the face.﻿", "time": "4 years ago", "author": "Briandrum", "cid": "UgzUYNSadEXJYO8296N4AaABAg"},
{"text": "Your replies implied you shared other users beliefs, You clearly don't know what you're talking about do you even know what GMO's are? Genetically modified organism which is a very vague term since any small modification can be put under that class so it's about context, how genetically modified are they? yes if you started turning it into a mutant then it would be harmful however in this context that Gates speak of, there is no harm, something being GM doesn't automatically make it bad.﻿", "time": "4 years ago", "author": "Dr Matt Phillips", "cid": "Ugx55pqn3UExiFPzgA14AaABAg"},
{"text": "Tell me something, where in any of my comments did I say a thing about mass genocide because of GMO's?  Wait.  I didn't!!  GMO's are bad for human consumption.  Period.  If some conspiracy nuts want to take it to another level and say because GMO's do such harm to humans that it's a form of genocide, let them.  At the end of the day, you thinking that GMO's are perfectly healthy is asinine.  Way too many stupid people not knowing what they're talking about is the problem with this world.﻿", "time": "4 years ago", "author": "Briandrum", "cid": "UgzSW-72s8wdNasuXQx4AaABAg"},
{"text": "Well, the research you've done through your career has failed you.  Hopefully you work for yourself, because if anyone has hired you to do said research, they definitely aren't getting what they paid for...even if they're paying you in dry toast.  What does the altering do to a human?  Hmm, it alters their DNA for starters, which can transform them into a cancerous cell, which will eventually lead to a cancerous tumor.  Please stop saying you've done research.  You sound like fool.﻿", "time": "4 years ago", "author": "Briandrum", "cid": "UgwPVu72x8Ajkc8pPAB4AaABAg"},
{"text": "Oh someone on Google posted something about conspiracy and mass genocide? Well then it must be true! I also read on google that the 3rd president of the United states was in fact a piece of fruit, so maybe we shouldn't take everything we know from Google without doing your own research like I have done, if your only evidence is other nut-jobs who believe in mass genocide through GMO's then you shouldn't be so quick to call other people not bright. Go do your own research in actual GMO labs.﻿", "time": "4 years ago", "author": "Dr Matt Phillips", "cid": "UgwLnCBjKrHDR2TkTmB4AaABAg"},
{"text": "You do not know me, nor do you know my career base or achievements but I can tell you from much research I've done for my career, the altering of plants has no negative affect on people, if you think that this is some attempt to cause mass genocide then I'm currently talking to a crazy person and there's no reason to continue this conversation. Do you even know what the altering does? and what affects it has? It makes food able to withstand poor surroundings so people in poverty can eat.﻿", "time": "4 years ago", "author": "Dr Matt Phillips", "cid": "UgyyibmO1Wjeq_k1LJt4AaABAg"},
{"text": "'Learn science before judging it'...hello pot, meet kettle.  That comment is HANDS down one of the most idiotic things I think I might have ever read.  These regulations that you speak of....do you know who's 'in charge' of said regulations?  I'll just sit back and await your response.  I'm 90% sure I know what it will be, and if I'm right, and you think that it's ok, then man do you have some reading to do!﻿", "time": "4 years ago", "author": "Briandrum", "cid": "UgxEAb6Kw1swOMSTJOh4AaABAg"},
{"text": "You're unbelievable.  So I don't overload you with facts, I'll just simply ask you to do a quick google search w/ 'why gmo's are bad for humans'.  Have a good time, and make sure when you're finished with having your mind blown up, you go look at yourself in the mirror and say, 'I'm really not too bright...I hope someday I will actually think for myself and not listen to what MSM says'.  You dolt.﻿", "time": "4 years ago", "author": "Briandrum", "cid": "UgzDzKekgBTtiAXgdit4AaABAg"},
{"text": "I know you don't want me to halt the fear mongering with logic and facts, why you don't I'm not sure, perhaps you make a living selling tin foil hats or something.﻿", "time": "4 years ago", "author": "Dr Matt Phillips", "cid": "UgzpOGRR9RmBrxJayJx4AaABAg"},
{"text": "I'm saying that there are many regulations that are done and anyone who knows anything about Science or GMO's knows that in the case that Gate's speak of is safe. The idea that this is all apart of a plan to cause mass genocide is loony beyond belief. Bill Gates saves Millions of lifes and because he does it with scientifically altered planets the person thinks he's a war criminal, look up the details of the altered plants before you just assume it's \"bad\". Learn Science before judging it.﻿", "time": "4 years ago", "author": "Dr Matt Phillips", "cid": "Ugy8hrJc4Vb2Cr7TxYJ4AaABAg"},
{"text": "smh...﻿", "time": "4 years ago", "author": "Briandrum", "cid": "Ugwc7_ZpG2LcTNFKQmh4AaABAg"},
{"text": "Whoa....so you're saying that you think GMO's are safe?!  Now THAT is hilarious!!  Keep eating what you're eating....don't pay attention to what's on the 'side of the box'.  Good luck.﻿", "time": "4 years ago", "author": "Briandrum", "cid": "UgxJmqokSiC0f_YFsu54AaABAg"},
{"text": "There is a Giant Pink Elephant penis in your butt!!! ... lol﻿", "time": "4 years ago", "author": "ATTACKaMAC", "cid": "UgwXDsfLY_bBbyAlDZh4AaABAg"},
{"text": "This is hilarious to read, I'm really glad you could be so satirical and show everyone how stupid over-the-top paranoia sounds... you were being satirical right?﻿", "time": "4 years ago", "author": "Dr Matt Phillips", "cid": "UgyqTiWC8eIYstnn7XB4AaABAg"},
{"text": "Well \"God\" clearly isn't doing a great job with all the billions dying of starvation, if modified plants can be more durable for lasting in foreign locations and therefore meaning there is a more durable supply of food, which will save life's then it makes logical sense, people who don't understand science automatically start fearing it.﻿", "time": "4 years ago", "author": "Dr Matt Phillips", "cid": "UgxEPeGYESCaF8ZRdPV4AaABAg"},
{"text": "God Planted all Crops! Bill Kills All Plants! Gods Wonders and Wisdom are more abundant than Microsoft!﻿", "time": "4 years ago", "author": "Ivann Lopezz", "cid": "UgxnHt0Bm2gK8Pb0iKx4AaABAg"},
{"text": "I've no doubt he has met resistance to what are now called \"GMO\" (like we haven't been crossbreeding plants for centuries, lol), but I'm surprised that he hasn't, or maybe they didn't mention it, had resistance from anti-vaccers.  I think he will find that poor people will try their hardest to stay poor and miserable for as long as they can.﻿", "time": "4 years ago", "author": "l337pwnage", "cid": "UgxtV6oK-ylcYbi5EZJ4AaABAg"},
{"text": "He is suffering from Affluenza.  It's a tough illness to overcome.﻿", "time": "4 years ago", "author": "l337pwnage", "cid": "UgwculDbwchR-lSAnud4AaABAg"},
{"text": "who is the presenter looking at!?﻿", "time": "4 years ago", "author": "Jbandtheb Jbandtabee", "cid": "UgzckuQsbPwDCv4pAVp4AaABAg"},
{"text": "Do some research before you claim 'conspiracy' and don't rely on traditional media - they only exist to serve these people's interests, not yours or mine - step outside the box, become inquisitive, don't let them make you delusional. ﻿", "time": "4 years ago", "author": "Mitch Callander", "cid": "UgwgYED9DKqhARpwjFl4AaABAg"},
{"text": "Yes, exactly - where is your evidence that Gates' and Monsanto's intentions are without ulterior motive ? If so concerned about alleviating poverty, why patent the seeds/ pesticides, make them self terminating so the seed can not be saved by farmers? Research! Of course this will be an 'agree to disagree case, but you show me your evidence that his intentions are without motive, and I will be open to changing your thoughts,,,, I guess we will know in the future. enjoy your GMO foods, my friend.﻿", "time": "4 years ago", "author": "Mitch Callander", "cid": "Ugw0Ye-MHfE0ZISUl5p4AaABAg"},
{"text": "if swallowing mid sentence is your \"evidence\" then you have some serious issues.﻿", "time": "4 years ago", "author": "zack hayward", "cid": "UgytPUPuf154tfHVl4R4AaABAg"},
{"text": "He should just find a way to live forever be has enough money﻿", "time": "4 years ago", "author": "Oreo1298PvP", "cid": "UgxOK8k2DE4BT4N3qtl4AaABAg"},
{"text": "You can't count anything in India﻿", "time": "4 years ago", "author": "Preston Tsamassiros", "cid": "UgxjhmeDp7DrZXCELZd4AaABAg"},
{"text": "There is a pink elephant on the moon!!!!﻿", "time": "4 years ago", "author": "Md Ha", "cid": "UgygPd6wF_eTSOhQA5J4AaABAg"},
{"text": "If you tell me there's a giant pink elephant on the moon am I supposed to believe you because I can't prove otherwise? No.\n\n\"What is asserted without evidence can be dismissed without evidence.\"﻿", "time": "4 years ago", "author": "KaptainEpik", "cid": "Ugx0W5YiGHlDASLctBF4AaABAg"},
{"text": "Don't worry my friend, some are still aware of this and not blinded by the propaganda - just look at Gates' body language when asked about Monsanto by the reporter - he can't stop fidgeting - from 2:48 - hear that little 'gulp', he shifts on his chair, stutters nervously again - he is full of shit. People such as 'Kaptain Epik' unfortunately are oblivious.﻿", "time": "4 years ago", "author": "Mitch Callander", "cid": "UgzuvcIATC_BHx0qc7R4AaABAg"},
{"text": "Where is the evidence to negate it? I guess we will see in the end.﻿", "time": "4 years ago", "author": "Mitch Callander", "cid": "UgwqZzz1Asr_7QnWoyt4AaABAg"},
{"text": "A whole load of bullshit with no evidence to support it.﻿", "time": "4 years ago", "author": "KaptainEpik", "cid": "UgwrQlmRCtLZzj_GhhR4AaABAg"},
{"text": "Thanks. I was ready to post it until I read your comment. What a good quote.﻿", "time": "4 years ago", "author": "lmc2664", "cid": "UgwfvFfwcZE_oVdFxH94AaABAg"},
{"text": "He needs to cut his ties with Monsanto﻿", "time": "4 years ago", "author": "torylelandkirgiss", "cid": "UgzqCI7MJamqFjoIMGx4AaABAg"},
{"text": "learn english﻿", "time": "4 years ago", "author": "Mc Swabin", "cid": "UgzwPL-fC2ssPCXKq-J4AaABAg"},
{"text": "Still not a Microsoft fan, but more and more a Bill Gates fan.  I hope some of the foundations use will be here in the U.S.  We have hungry kids too.﻿", "time": "4 years ago", "author": "Mc Swabin", "cid": "UgwVD1FQAgf_0m15JtV4AaABAg"},
{"text": "absolutely right. when you do  penny stock trading get good suggestions from professionals is the wise idea. dont think its funny, even my mom started making descent money from penny stocks trading using a professional service. have a try now here : bit.ly/18Y8tec?=pxwhzn﻿", "time": "4 years ago", "author": "Swamy Pabbisetty", "cid": "UgzhiqV2_iyNhkKy6qN4AaABAg"},
{"text": "At least Bill Gates knows how to use his money ﻿", "time": "4 years ago", "author": "Tyrion L", "cid": "UgwSu7yxZXN9Y130zql4AaABAg"},
{"text": "No thanks﻿", "time": "4 years ago", "author": "Mattias Gramstad", "cid": "UgwWwDHF2flVvchjPzl4AaABAg"},
{"text": "You guys should check out this EXTRAORDINARY website called FIREPA.COM . You can make money online and start working from home today as I am!\n\t\tI am making over $3,000+ per month at FIREPA.COM !\n\t\tVisit Firepa.com and check it out!\nThe ordinary care quantifys the wound.\nWhy does the chalk win the utter rub?﻿", "time": "4 years ago", "author": "Clark Johnson", "cid": "Ugx2GC-nUwVQLTM7lfd4AaABAg"},
{"text": "You guys should check out this EXTRAORDINARY website called FIREPA.COM . You can make money online and start working from home today as I am!\n\t\tI am making over $3,000+ per month at FIREPA.COM !\n\t\tVisit Firepa.com and check it out!\nWhy does the dependent room accommodate the fold?\nWhen does the minute instruct the gamy copper?﻿", "time": "4 years ago", "author": "Clark Johnson", "cid": "UgwaBOKbOe_Ea5KQKvN4AaABAg"},
{"text": "You guys should check out this EXTRAORDINARY website called FIREPA.COM . You can make money online and start working from home today as I am!\n\t\tI am making over $3,000+ per month at FIREPA.COM !\n\t\tVisit Firepa.com and check it out!\nWhen does the man communicate the black-and-white behavior?\nThe learned chalk influences the fear.﻿", "time": "4 years ago", "author": "Sam Barney", "cid": "Ugws-Vl5stflPBiWjAh4AaABAg"},
{"text": "why it was funny ?\ndont belive ?\n\nPls watch \"Die apple story\" , it's a documentation about how the apple company was found, around 28 min comes the part, when Steve Jobs \"stole\" the OS of the Macintosh.\n\nLater, Bill Gates payed million of dollars to Steve Jobs to forget this moment, and the truth disappear...﻿", "time": "4 years ago", "author": "DareWerner", "cid": "UgwBPJrqEpepZ8r2mkN4AaABAg"},
{"text": "That was funny to read.﻿", "time": "4 years ago", "author": "aTANK nameMURDER", "cid": "Ugyq7fFVSYOC_dUx6ZJ4AaABAg"},
{"text": "Pls dude, without Steve, Bill not be.\nPls informate about microsofts history, then u know, Bill was a thief...﻿", "time": "4 years ago", "author": "DareWerner", "cid": "Ugzrz1z4TwgaG62IKMp4AaABAg"},
{"text": "so you say you love genocide ?﻿", "time": "4 years ago", "author": "Alexander Federowicz", "cid": "UgwMHF9uLBNI4IMjAkZ4AaABAg"},
{"text": "He is not investing in health. Monsanto exists only to control the global food supply, and their toxic GMO's are designed to bond to human DNA, and cause toxic death, sterilization, and is part of the Agenda-21 genocide plan to eliminate over 7 billion human beings. This is a crime against every species on the planet, because it is also causing the genocide of the worlds bee populations. Charge this man with war crimes.﻿", "time": "4 years ago", "author": "Alexander Federowicz", "cid": "UgxH-YEiplZPtWIQaRl4AaABAg"},
{"text": "everything you have stated in the comment is incorrect ﻿", "time": "4 years ago", "author": "micgamer16", "cid": "UgxCqvIW9CRfftHLZEl4AaABAg"},
{"text": "Don't understand why he would invest in Monsanto. The only thing I don't agree with Gates.﻿", "time": "4 years ago", "author": "Chris Jones", "cid": "UgxdzWS5aMwK8LmhhUB4AaABAg"},
{"text": "Gates will really burn himself on GMOs. Most countries in the world have already banned them completely. More will follow until only USA and India will remain.\nGMOs, while in control of criminal organizations like Monsanto are extremely dangerous!﻿", "time": "4 years ago", "author": "mijav2", "cid": "UgwcSXmMbFE8V2V_bJ14AaABAg"},
{"text": "You got to pick important stuff because you only have limited time.﻿", "time": "4 years ago", "author": "joetube01", "cid": "UgyBnOcW_TReGSzFZBx4AaABAg"},
{"text": "Show me a peer reviewed scientific paper that ever concluded that GMOs are harmful to anyone and I'll agree with you.﻿", "time": "4 years ago", "author": "MSG685", "cid": "UgxeeUmzGx7edOzANU14AaABAg"},
{"text": "So you tell me why places like Hungary are burning down GMO crops? Oregon farmers burning down gmo sugar beets because the Chinese wont buy there gmo contaminated wheat .. why would all these people be so against GMOS but in America we have retards pushing for it like they know without a doubt ..there are countless studies going down the dark sides of gmos. India 100s of thousands of farmers committing suicide due to Monsanto. bees dying from there chemically engineered foods AND U SAY ITS OK .﻿", "time": "4 years ago", "author": "LOST OCEAN EXPERIENCE", "cid": "UgwbopHI2e9Xgg04Jy14AaABAg"},
{"text": "Bill Gates is awesome and I respect him very much but it's Microsoft as a company I have a problem with.﻿", "time": "4 years ago", "author": "jjjjjjjjjj11ify", "cid": "UgyQTi-esNy2MhhOlkF4AaABAg"},
{"text": "CoAnkle.﻿", "time": "4 years ago", "author": "NKWTI", "cid": "Ugz3LE_Eb_Leuy1whnV4AaABAg"},
{"text": "Show me a peer reviewed scientific paper that ever concluded that GMOs are harmful to anyone and I'll agree with you. You can't because there simply aren't any. GMOs feed thousands of people everyday while using far less pesticides .﻿", "time": "4 years ago", "author": "MSG685", "cid": "UgznWjYu8pGTd6DiMrt4AaABAg"},
{"text": "Don't try speaking for me, your intelligence won't let you anyway. ﻿", "time": "4 years ago", "author": "trevenman", "cid": "UgxS9cxzRdcvwu9GBmN4AaABAg"},
{"text": "So test it on mass amounts of starving people good plan asshole!!﻿", "time": "4 years ago", "author": "LOST OCEAN EXPERIENCE", "cid": "UgxPgASNNzFniKy4HZx4AaABAg"},
{"text": "QUALITY OVER QUANTITY EVEN WHEN TRYING TO FEED THE HUNGRY!! Feeling self righteous for feeding them all but possibly causing there bodies harm is not a right idea !! To the prick who said first world cunt . this kind of enviromental terrorism from Monsanto is disgusting!!﻿", "time": "4 years ago", "author": "LOST OCEAN EXPERIENCE", "cid": "UgyLkZ9rMf_8fqVcx8x4AaABAg"},
{"text": "How can you say that there are reasons why China, Europe and multiple other countries have completely banned Monsanto and gmos . There's a reason its the top five cancer causing food , There are plenty of studies not conducted by people lobbying to make these foods legal. Which is quite easy when you have tons of ex Monsanto employees in congress including the head of the Fda .India has had 100s of thousands of suicides due to Monsanto's gmo farming practices look it up I've done my research!!﻿", "time": "4 years ago", "author": "LOST OCEAN EXPERIENCE", "cid": "UgxhSpIOxXFsJTDN_OB4AaABAg"},
{"text": "The European union is working hard for the development of science and technology that is beneficial to our food security. That's why GMOs are  not banned in the EU. GMOs are grown in France, Germany, Poland, Portugal , Romania, Slovakia, Spain and the Czech republic. A number of GMO products, deemed safe by the EFSA, are sold on the food market. ﻿", "time": "4 years ago", "author": "trevenman", "cid": "UgzaF76XoL6EzTkvI6x4AaABAg"},
{"text": "well... lots of countries did ban it? even the european union banned it. do you think they banned it purely out of ignorance? i think that's unlikely. obviously using the technology responsibly through strict regulations and research would be ideal, but monsanto is a publicly traded company. so in the interest of its shareholders, profits often come before public safety/ ethics.﻿", "time": "4 years ago", "author": "Raymond", "cid": "UgzHWkXK_K5XXqT-Y2p4AaABAg"},
{"text": "So what is the biggest gamble with peoples lifes - banning an extremely powerful technology or use it responsibly? Every new technology and every new prototype needs trials and safety testing. ﻿", "time": "4 years ago", "author": "trevenman", "cid": "UgyQXI8vz4_5K28BBih4AaABAg"},
{"text": "it's not that there is no future with gmo, but the current technology sucks. it's literally trial and error which could be directly translated to gambling with people's lives.﻿", "time": "4 years ago", "author": "Raymond", "cid": "UgzIpGSVD4nQhn7J5MF4AaABAg"},
{"text": "quality over quantity, i would rather get an apple computer than a samsung because the samsung would break in a couple weeks. i would get a sony or an hp over apple though because they are more reasonably priced﻿", "time": "4 years ago", "author": "Trevor F.", "cid": "UgwOUPKcfj7ovYsgg654AaABAg"},
{"text": "I used to believe that too . It's pretty much all bullshit propaganda. There has never been a scientific peer reviewed study that found anything wrong or harmful with  GMOs. 24 thousand children under the age of 5 starve to death everyday. People are scared of things they are not properly informed about so please inform yourself and enjoy your dinner.﻿", "time": "4 years ago", "author": "MSG685", "cid": "UgzUp0jwfw6rn2IMu6F4AaABAg"},
{"text": "Bill gates invented none of that. He BOUGHT the DoS OS for $50,000.\n\n﻿", "time": "4 years ago", "author": "MassDivide", "cid": "Ugxm1VGECr9-1rxhiLd4AaABAg"},
{"text": "LOL I like the showing of a potato bug in mutant insects, I admit before they get the hard shell they are disgusting looking.﻿", "time": "4 years ago", "author": "Endtimescoming", "cid": "UgzY_rnHAk841PWyM8l4AaABAg"},
{"text": "this guy is a hero﻿", "time": "4 years ago", "author": "legolas0029", "cid": "UgzkHbvCx_h6uSMT4LF4AaABAg"},
{"text": "Bill Gates is the kind of guy that makes me proud to be an american..... He's a great man........ I find it very inspiring and refreshing that he has given so much to so many.....﻿", "time": "4 years ago", "author": "Mac Machead", "cid": "UgxW1jWUmhcS7tT8HpR4AaABAg"},
{"text": "What the fuck does that even mean? If he had a few hundred trillion left over after 90%, you are suggesting he has atleast over $1quadrillion in his bank? That kind of money would make the continent of Africa a superpower. ﻿", "time": "4 years ago", "author": "xCoNxKarMa", "cid": "UgzlPpdZ1ilLOQxy8bt4AaABAg"},
{"text": "since bill gates believes in population control and \"lowering\" control through medication in exchange for \"cures\"  Look it up he actually made a video conference on it.  So lets see how many miscarraiges and population drop now in india.  ﻿", "time": "4 years ago", "author": "GinTheHallow", "cid": "Ugzx7g827bqpE5jvLBp4AaABAg"},
{"text": "Over population is not an entitlement of the human race.﻿", "time": "4 years ago", "author": "Harrysound", "cid": "UgwtqAGMncG1E9PG5TB4AaABAg"},
{"text": "great photo @ 4:01﻿", "time": "4 years ago", "author": "calabiyou", "cid": "Ugy-T5GRyWwDrxuQVOR4AaABAg"},
{"text": "When people say Apple made the first \"modern\" laptop.\n\nGod, I'm sorry, but that is wrong. I'm not going to say why, as I cannot be fucked, but it is.﻿", "time": "4 years ago", "author": "Sam Coulson :)", "cid": "UgzibrpT4cPGNaiBesx4AaABAg"},
{"text": "21 Year Old Making Money At Home Just By Blogging.\n\nDon't Need To Do A 9 - 5 Every Again!\n\nEmail Me To Know More Info: Andrew.T.Ssansa@hotmail.com\n\n......\n\nCheck Out My Youtube Channel Aswell!﻿", "time": "4 years ago", "author": "MoneyThroughBlogging", "cid": "UgxtBfqHfTQ-x6HYk-94AaABAg"},
{"text": "I'm sure this is true as of now, my issue is when they start making major changes to crops. Maize for example, was a fairly large change, but it was also only part of the diet of the people who ate it, and it was done over generations, my real issue is what happens when everything in our diet is changed at once? and quickly? or changing crops to produce their own pesticides? (which is something i've already heard of, but it's only hearsay, I don't know if they've even tested it yet)﻿", "time": "4 years ago", "author": "Curatiokyte", "cid": "Ugxf5QtP6kSmvQ6Q25N4AaABAg"},
{"text": "Those are valid questions and thats why tests are conducted. One thing is sure; we have never altered any crop so drastically with modern genetic engineering as we have, over the past couple of centuries, with tratidional breeding. We have been directing the evolution of our farm animal and crops and never asked our selves about the risks. The bigger the maize ears, the better. For all people against eating altered food: you might skip it all; eat only what the jungle or open seas has to offer. ﻿", "time": "4 years ago", "author": "trevenman", "cid": "UgyQpGMTRRd6IWfzUHt4AaABAg"},
{"text": "i agree that is most of it, and I'm not trying to say GMO's are inherently bad, it does entirely depend on what you're doing to their genetics, for example, if you add extra growth hormones to corn, how do we know what consuming them will do to us? or if you change them to produce their own pesticides, what will happen when we eat those pesticides? will they continuously build up in our bodies to cause damage? Will the changes destroy or get rid of existing nutrients that our bodies need?﻿", "time": "4 years ago", "author": "Curatiokyte", "cid": "UgyJqAq2aauFDeMdyo94AaABAg"},
{"text": "Homo sapiens have ceased its evolution. Where in the modern world, with social security nets, do you se a selective force that drives our development in a particular direction? You get on average 2 kids, almost undependent of the genetic makeup you have. For much of the food you eat today, you have NOT evolved to handle over millenia. Is it free of toxic compounds? \"Good\" says the intestine, and: \"Lemme chop the nutritious macromolecules into simple compounds and digest it without your whining\" ﻿", "time": "4 years ago", "author": "trevenman", "cid": "UgwLZRNx7TVIGgCK5OJ4AaABAg"},
{"text": "our bodies have evolved over millennia to handle not only certain nutrients, but also certain levels of those nutrients, the key to staying healthy is maintaining a balance in our bodies, and while consuming too much of a particular nutrient occasionally isn't a big deal, if you're consuming too much of it every time you eat, your body will have a much harder time dealing with the excess, it will be difficult for our bodies to do so until we evolve to handle it, which could take centuries.﻿", "time": "4 years ago", "author": "Curatiokyte", "cid": "UgxI59LMbnPgyo9Wh_p4AaABAg"},
{"text": "\"The damages of GMO\"  ? Did you know, GMO can be a billion different things. The only reports I've heard about bad GMO safety were conducted with sub-standard methods, unconventional statistical methods, bad choices of experimental animals, no data given about important parameters and so on. ﻿", "time": "4 years ago", "author": "trevenman", "cid": "UgxYOngXBd7j7WTGxap4AaABAg"},
{"text": "What is there to get adapted for ? GMO food often have the same biochemical profile as non GMO - the difference is often only the proportion of various types of nutrition. In any way, we test GMO safety. However, we have not conducted large scale health effect trials on regular, non GMO, food. No one knows if for example soya contains natural, cancerogenic substances. ﻿", "time": "4 years ago", "author": "trevenman", "cid": "Ugwj2q7xfGEvGCRDSzZ4AaABAg"},
{"text": "the damages of GMO are well documented, testicles of rats changed etc. If we hadn´t got involved with the third world and allowed them to breed even more we wouldn´t had this problem, give Monsanto control of the entire food in the world is absolutely madness.﻿", "time": "4 years ago", "author": "Hymer300", "cid": "UgwgNd-tf28eHnDrer94AaABAg"},
{"text": "True, but our bodies have also been adapting to particular foods for time immemorial, who knows what the effects on our bodies will be when we make immense changes in our foods, especially in a short period of time where our bodies don't have time to adapt... I'm not saying it's all bad, just that we shouldn't be too eager to have everyone jump in with both feet before we know what the genetic changes to our foods will do to effect us.﻿", "time": "4 years ago", "author": "Curatiokyte", "cid": "UgyLLi1H-LmDh1Pfafx4AaABAg"},
{"text": "What do you guys do, make up stuff and post it as if it fact?\n\n\"He didn't write the orignal Windows but purchased from a goverment scientist.\"  LOL, that is one of the most ignorant statements I have ever read.﻿", "time": "4 years ago", "author": "bibbler227", "cid": "UgxQuw0kQ5hjbcLqPld4AaABAg"},
{"text": "he donated over %90 of his money. he donates %90 more then any other rich guy.﻿", "time": "4 years ago", "author": "Chilly gamer", "cid": "UgwV7IGrvvtaF9YhN8Z4AaABAg"},
{"text": "I don't think that there is one factual statement in your post.﻿", "time": "4 years ago", "author": "bibbler227", "cid": "Ugz1_n0fQL6Y1jVUTlR4AaABAg"},
{"text": "Leaving only a few hundred trillion or so left over to lavish himself with. ﻿", "time": "4 years ago", "author": "iYearn4Cats", "cid": "UgzENeC1K2QjgVmr9BR4AaABAg"},
{"text": "If Bill Gates and other members of the 1% are still dying, either two things: life extension is not possible; or even with ultimate resources, money, and influence has failed to bring forth those types of things, this far in time. If the latter, then use that as a reference point to how powerful they actually are: powerful, but not so powerful yet that it is out of our reach. I submit this idea to the 99% to encourage you to act before it's too late and the future of computers use us for the 1%.﻿", "time": "4 years ago", "author": "Sage Mantis", "cid": "UgwDd2DnREj_DHW_s_54AaABAg"},
{"text": "Coankle﻿", "time": "4 years ago", "author": "Sage Mantis", "cid": "UgzjmT1YnkZZYofVOEx4AaABAg"},
{"text": "*Don't\n﻿", "time": "4 years ago", "author": "LOST OCEAN EXPERIENCE", "cid": "UgzgJRF5UEdZJoUx1zd4AaABAg"},
{"text": "Im far from uninformed and  GMOS ARE SHIT AND MONSANTO IS CURRUPT! I do need a chemical company making my food !!﻿", "time": "4 years ago", "author": "LOST OCEAN EXPERIENCE", "cid": "Ugy4bJBTviZoPHAyAbF4AaABAg"},
{"text": "Unfortunately all those known outcomes are in the Lab and biodome, when out in the enviroment with all the variables available, life has shown us how a good intention suddenly becomes a cthulian nightmare. Monsanto engineered terminator genes in food products and those transposed on to other non localised food plants (polination) rendering them toxic for consumption. The terminator gene's were for the pupose of pest resistance only.﻿", "time": "4 years ago", "author": "DARTHMOBIUS", "cid": "Ugwn35gC1_PRzjmh-GV4AaABAg"},
{"text": "bill is such a nice guy, i mean he is the best rich guy out there. donating %90 of ALL his money. ﻿", "time": "4 years ago", "author": "Chilly gamer", "cid": "UgzKmoQL9FFbS0gW-eF4AaABAg"},
{"text": "I consider Bill Gates a super-hero because he helped so many people and he gave us so many things in the technological industry   ﻿", "time": "4 years ago", "author": "Lion", "cid": "UgxPBQUIwzGWgQ53o7V4AaABAg"},
{"text": "The ability to tinker with nature is truly a double edged sword. I remember hearing of a set of genes that were used to cause I think corn to release a natural pesticide, the problem was that it caused allergic reactions in humans. Before the problem was addressed it was part of the seed stores. Even with all that, who's to say that the mutations nature naturally makes will be any better? At least the engineered crops have known outcomes.﻿", "time": "4 years ago", "author": "Corey Carnes", "cid": "Ugy6fCOccCjd_sC1nPN4AaABAg"},
{"text": "BILL GATES LOOKS NICE NAKED﻿", "time": "4 years ago", "author": "Teodor Medby", "cid": "Ugxu75teiUpFmKQu32p4AaABAg"},
{"text": "s3lvr, in all sincerity you actually made me laugh.  Thanks for that!﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgyJgTAMeylGvj_e0rt4AaABAg"},
{"text": "Dear me, you're hardly in a position to judge me, not if that's what you really believe because of your own myopic preconceptions.  Now run along and play nicely, there's a good boy.﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgxReNyd5UeSQaFJ_qN4AaABAg"},
{"text": "Biotechnophobia is a confusion that affects uninformed people with filled bellies. ﻿", "time": "4 years ago", "author": "trevenman", "cid": "UgzMADzWuXtqDk5LMaN4AaABAg"},
{"text": "At least youve got humility i'll give you that lol﻿", "time": "4 years ago", "author": "Gaius Julius Caesar", "cid": "Ugw7I_RQCj7QoknwlSl4AaABAg"},
{"text": "The problem is not seed viability and crops it's water and fertile earth.  What is going on is exploitation, not long term solutions.  ﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgzWjWY9OtwxsK-ZM1d4AaABAg"},
{"text": "They're not ideas, they're facts.  Learn the difference, otherwise you keep your ignorant opinions to yourself and do the world a favor.﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgwBL2EmyUPT9mJEqHB4AaABAg"},
{"text": "Rounded but not an expert .﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "UgxiPxiTu30BpBohsZB4AaABAg"},
{"text": "Move to Africa and talk crap like that!﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "UgyG46i4hf2fl4v_ZXl4AaABAg"},
{"text": "When you are willing to starve for some prissy ass kid moral. That is dumb . reply freely. ﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "UgzxrQZaOeGJN1Qpllt4AaABAg"},
{"text": "When you are willing to starve for some prissy ass kid moral. That is dumb . reply freely. Until then just keep yor goofy ass shitty ideas to yourself.﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "UgwhlP9hnWwPrHDqk8l4AaABAg"},
{"text": "According to whom?  Native Americans have grown corn for centuries without any problems?  Why reinvent the wheel when it's not broken?  Oh, yes, because there's more money in convincing people it's needed.  Being robust as a grain doesn't mean it has to be able to withstand agent orange type pesticides.  That just means you're able to get the pesticide into the human body without killing the plant first.  There is no intelligence or humanity behind this technology except corporate greed.﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgzJfn6-LeY9CjEkYOV4AaABAg"},
{"text": "You're wrong. This is exactly what the world needs - the truth. Bill Gates is not an idiot.  He will have done his research, so that makes him as guilty as Monsanto for crimes against humanity, for destroying thousands of human livelihoods, and contributing to their suicides.  These are not 'theories', they are facts.   You need to find someone actually worthy to look up to instead of being impressed by these phoney philanthropists that are given air time just because they are rich.﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "Ugz48tu0xkq9TBDNaJp4AaABAg"},
{"text": "yes I know I agree thanks for reminding me﻿", "time": "4 years ago", "author": "maria loves green", "cid": "Ugx5qSU8BC2XR91SuP14AaABAg"},
{"text": "That you say . Corn wasnt a robust grain ,without messing with the genes .  ﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "Ugw26LdTrJ_cY7J4fXl4AaABAg"},
{"text": "You seriously have issues dude, stop being such a conspiracy theorist and negative - the world doesnt need this.﻿", "time": "4 years ago", "author": "Alex Bender", "cid": "Ugy1RvTVs5snBewQryp4AaABAg"},
{"text": "95%?  Do we have evidence?  Only someone who stands to profit like him is prepared to give money away.  As a member of the Iluminati, having married into it, the cause of ethnic cleansing and population reduction is the greater incentive.  But the means of attaining it is rather nefarious - sterilising vaccinations and foods that will cause famine due to their propensity to fail after the first or second harvest.  Starvation by design.  The man is a psychopath and doesn't have normal emotions.﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgyfrUTnmB0OoblSlKJ4AaABAg"},
{"text": "45 years? You are kidding.  GM organisms were only introduced into the food chain in 1994 in tomato.  The sterilising effects and organ failure caused by some GMOs such as maize and soy take a few generations to impact, as shown in animal studies over a few years.  Animals have had to be destroyed.  Humans can put up with a lot, but this is just another danger we can all do without, especially since we are being weakened by so many other environmental hazards like radiation and pesticides etc.﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgzIQQdKCxxeRGQrTzh4AaABAg"},
{"text": "You wouldn't starve to death.  That is a myth. GM food has WORSE yields than non GM food.  Proven facts.. ﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgwMrQUiQvGc1WIFMp54AaABAg"},
{"text": "Im not an expert but I have lived on mostly GMO's for 45 years with no ill effect.﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "Ugzs_4ftvY5A8s4L4254AaABAg"},
{"text": "So you would be the first  willing to starve to death , when we change to all organic food?﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "Ugykx_usqx9MuZm_Ms14AaABAg"},
{"text": "Uh no duh that is how i have found this information out? Im afraid its not fantasy bro do the research and do trust everything you read﻿", "time": "4 years ago", "author": "Gaius Julius Caesar", "cid": "UgwjLQN1aah0XseEslR4AaABAg"},
{"text": "David, you're actually in a minority with your opinion.  Go and ask the peoples around the world what GMO does to their livestock and their own livelihoods and then form your opinion based on FACTS not media propaganda like this. Tell it to the hundreds of farmers who commit suicide everywhere because of Monsanto contracts.  I suppose you'll say that they all had mental illnesses! One wonders why you would have such blind devotion - either you're ignorant or just want something nice to believe..﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgwLCuXRz7z8rRCOUhZ4AaABAg"},
{"text": "You are living in a fantasy world.  Just do the research!﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgzAPzJEGwIDI1ryB2Z4AaABAg"},
{"text": "So what makes YOU the expert then, David Chandler?  Your lovely white hat?﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgxhGgaCcuDvKyTp2Vp4AaABAg"},
{"text": " No one is ever going to starve.  There is plenty of food to go around.  That is just a stupid scare mongering myth perpetrated by the likes of monsanto and bayer who profit from controlling seed patents.  It's global corporations that own governments, not the other way around.  They presently call the shots and we allow them.  Governments are just puppets of the money lenders, always have been. They are all paid off and threatened by these gangsters.﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "Ugymh8cxyBA2UVD9G5l4AaABAg"},
{"text": "But i imagine you have a pretty rounded experience of modern arms then?﻿", "time": "4 years ago", "author": "Gaius Julius Caesar", "cid": "UgyGMRkJDPqEjyC9hOt4AaABAg"},
{"text": "far,far from an expert. especially on the Muskets O own, I have 2 . I have never fired them nor worked on them . Or cleaned them for that matter . They are an investment. ﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "UgzAm8EMN_OFsL_IT4J4AaABAg"},
{"text": "Yeah no matter how experienced you are there is always more to learn and always people you can learn from. Props to you man but ounds like youd be an expert to me lol﻿", "time": "4 years ago", "author": "Gaius Julius Caesar", "cid": "UgzAHpVIx6yhr-Kucnl4AaABAg"},
{"text": "Trust me , the man could care less.\n﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "UgwsGiLl6NmO10Hf0sV4AaABAg"},
{"text": "Hell I am the owner of several guns, and have been around them most of  my 45 years. That doesnt make me an expert on any type of gun. These kids real a little on guns , so that makes them experts.  Thats just an example.﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "UgyuFZNQQTTctwAAO9x4AaABAg"},
{"text": "bill gates must be pissed because the co anchor used an i pad xD﻿", "time": "4 years ago", "author": "Hafiz Bahar", "cid": "UgybiTZH05dBi9Sox0d4AaABAg"},
{"text": "Exactly -.- they pretend like they have studied about the subject their entire life because they googled it and found a few articles. Also just cause its an article doesnt automatically make it a completely reliable source or even true﻿", "time": "4 years ago", "author": "Gaius Julius Caesar", "cid": "Ugy4N8vnbskSFbgBR_Z4AaABAg"},
{"text": "don't know about multitouch. But bringing something in new form is more like good marketing rather than innovation.  ﻿", "time": "4 years ago", "author": "Hirak Sarkar", "cid": "UgyChu1MRi1RIlfau714AaABAg"},
{"text": "Ok expert.﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "UgwpwklzJSOPG0Fs1ON4AaABAg"},
{"text": "I take an interest in what people are doing to our planet. It's my world as much as theirs.  Money can't buy everything you know, certainly not my opinion or blind support.﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgwZ4JOQMpxUyXlwgtt4AaABAg"},
{"text": "right I believe ya!   Yo read that in some article and now you are an expert.\n﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "Ugw2b5Pzrbxh3pNS_st4AaABAg"},
{"text": "In independent testings GMO maize has also been found to contain a chemical which interferes with human fertility which is particularly used in Africa and developing nations. I'm not saying Gates is evil or guilty of population reduction by design, but that maybe he doesn't have all the facts, especially if he's invested so much into Monsanto and only listened to their hard sell.  Monsanto have a terrible reputation globally because of their shady deals and ridiculous contracts.﻿", "time": "4 years ago", "author": "Charlie Brown", "cid": "UgzlbCCT5jBhvdKWpj54AaABAg"},
{"text": "Im all for the super weed.﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "Ugy_1rUcCm63xJYhYqZ4AaABAg"},
{"text": "Ive noticed that they use big words as well. and sometimes in the wrong context , to give the illusion if being really smart.   Or they read a paragraph or even an entire paper, and that makes them an expert.\n\n﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "UgwxWjJfFMOUNFr69oF4AaABAg"},
{"text": "Exactly! your body has the ability to breakdown unusable materials and excrete them sure your poo might be a different color but it in no way actually presents harm to your body unless you have a form of cancer or disease which breaks down or even disables certain digestive organs. People now days will just take any reason they can to blame a stupid conspiracy on problems because they think it makes them sound and feel informed and intelligent -.-﻿", "time": "4 years ago", "author": "Gaius Julius Caesar", "cid": "Ugxg7wJppFjdbx6tGBZ4AaABAg"},
{"text": " What they fail to realize is , that your digestive system will weed out anything that your body cant utilize, and deposit it into your colon. If your digestive system is that weak, something else will kill you . Not a GMO\n﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "UgzRKUYBmcSHr0RGIiB4AaABAg"},
{"text": "Well then finally someone with common sense! GMO is obviously a great alternative. People always think Governments are trying to kill population with it and i think thats so ridiculous -.- Even if they did id rather be poisoned to death then starve XD﻿", "time": "4 years ago", "author": "Gaius Julius Caesar", "cid": "UgwJED6EcDx3T0q_1cp4AaABAg"},
{"text": "Not so much brains as common sense. But I do have a few brain cells in reserve.   If the world was to go completely organic. They could produce enough food to feed 2/3 of the population. I dont see 1/3 of the population volunteering to starve.  ( nevertheless Ill be here in Ohio nice and full of my GMO food)﻿", "time": "4 years ago", "author": "attitudewithoutacause", "cid": "Ugz_zY3B7z0XZsHQTuN4AaABAg"},
{"text": "Oh thank God finally someone with a brain -.-﻿", "time": "4 years ago", "author": "Gaius Julius Caesar", "cid": "Ugw9C8EhSQ2ygugjaBR4AaABAg"},
{"text": "Ever tried to program, play a video game, or do anything that requires a large amount of RAM on an apple? cause if you did it would have been alot easier on a PC﻿", "time": "4 years ago", "author": "Gaius Julius Caesar", "cid": "Ugz4-cr687_Vu--nLjJ4AaABAg"},
{"text": "Close your eyes....It's kermit the frog lmao﻿", "time": "4 years ago", "author": "BlackPowerfoLife", "cid": "UgzSo0DyiMX0UvnTPsV4AaABAg"},
{"text": "Steve didn't innovate them, he stole them from XEROX ﻿", "time": "4 years ago", "author": "Hirak Sarkar", "cid": "UgxVe9y0GKdUkZfrk_N4AaABAg"},
{"text": "As Steve used to say, they didnt did that really because thats not what they do, they made a partnership with people that could do it to deliver the best experience to the consumer, R.I.P. Steve, we will miss your vision to the future...﻿", "time": "4 years ago", "author": "LeoFLT", "cid": "Ugx8HMJwlCqAsrCDSS94AaABAg"},
{"text": "you are rich\n﻿", "time": "4 years ago", "author": "Kerrie Howell", "cid": "Ugx_BWD-3OorPQChb4V4AaABAg"},
{"text": "You are THE MAN Bill.﻿", "time": "4 years ago", "author": "MrLuke", "cid": "UgyiAPyYkkeT3nFCh6N4AaABAg"},
{"text": "Investing in Monsanto is very wise. Good jooooob Bill!! Now we know who you're working 4\n﻿", "time": "4 years ago", "author": "BAB373S", "cid": "Ugz9LQw5b28sq9-M1854AaABAg"},
{"text": "If you bought Windows you probably bought 7-8 times, thanks Bill.  A fortune due to a super deal made with IBM. What is really in those immunization drops apart from Polio vaccine.  The green revolution is an abject failure fail on GMO crops.  Good idea on peer review IMHO.  ﻿", "time": "4 years ago", "author": "Scott Herford", "cid": "UgxfBmS8XS3ClMSlZS54AaABAg"},
{"text": "Correction, Microsoft is better clearly because Samsung got the MicroChip off of Bill Gates. Bill Gates invented the MicroChip which allowed Electronics to be made. Bill Gates also invented the first Computer Language. And he also invented Desktop PC's and Laptops\n﻿", "time": "4 years ago", "author": "rt588killer10", "cid": "UgxsvXuH5nHPnr51NgR4AaABAg"},
{"text": "Umm... Apple makes iPads and computers too... laptops included... not to mention many other consumer electronics...﻿", "time": "4 years ago", "author": "Wolfgang Ninegageus Nozart", "cid": "UgwiVij65QlxCjhBUpB4AaABAg"},
{"text": "I stopped watching after they said about donating to Monsanto. They are fucking evil, just look what they did to the Mexican farmers.﻿", "time": "4 years ago", "author": "ThinLynottFan", "cid": "UgzQ0yBuCo1XtaP_APR4AaABAg"},
{"text": "gmos are not good monsanto is evil ﻿", "time": "4 years ago", "author": "LOST OCEAN EXPERIENCE", "cid": "UgzaJMgmfziddC4oa1B4AaABAg"},
{"text": "Jobs made it clear that he felt his company's products were how to give back to the community.  He didn't believe in charity.  ﻿", "time": "4 years ago", "author": "Vance B", "cid": "UgxBcMSllMYfu57_IZ14AaABAg"},
{"text": "Maybe Steve Jobs preferred to be anonymous when making donations to charity and such, just saying.﻿", "time": "4 years ago", "author": "UnkownSoldier100", "cid": "UgzbQ-AqxZyWuVP0ChJ4AaABAg"},
{"text": "I think it's great steve and bill had a good friendship﻿", "time": "4 years ago", "author": "joostvrolo", "cid": "UgzP47KTuSbZtSs8Exh4AaABAg"},
{"text": "yes, he does \"genocide\" charity. thats the name of the game.﻿", "time": "4 years ago", "author": "An Eye's Cream", "cid": "Ugzp0AloCbCuP0DbnIF4AaABAg"},
{"text": "finally one who actually sees that. and on his \"selfless\" charity, when it comes to funding genocidal activities, GMO, monsanto and all that nasty stuff I am getting nauseated how stupid can mainstream get to promote it this way. I do not feelsorry for morons falling for this scam. \n\n﻿", "time": "4 years ago", "author": "An Eye's Cream", "cid": "UgyQPQ1-0SQljolY4at4AaABAg"},
{"text": "i can't remember a single good act from steve jobs but i already knew bill gates was into charity. not saying steve jobs was a bad man but bill gates is my favorite person right now and i use android.﻿", "time": "4 years ago", "author": "adel aka", "cid": "UgwxRmRL6l7ewUtOw0N4AaABAg"},
{"text": "Wouldn't be so bad if monsanto didn't screw farmers over when monsanto's seeds get carried over to their farm.﻿", "time": "4 years ago", "author": "cxz215", "cid": "UgzFoSEyvoFIarQF1pV4AaABAg"},
{"text": "Bill Gates invested in Monsanto. My God, why did I not see this coming.﻿", "time": "4 years ago", "author": "meinHeld", "cid": "Ugw4BlV5k9PJQJZjUa94AaABAg"},
{"text": "I fucking microsoft but im glad hes doing charity﻿", "time": "4 years ago", "author": "matt Walter", "cid": "Ugxx_YezisFfy4dEyHJ4AaABAg"},
{"text": "Truly selfless act - how many gizilionairs are prepared to give 95% of their fortune back to the needy throughout the world - most are more worried about making another gizilion dolars.﻿", "time": "4 years ago", "author": "Alex Bender", "cid": "UgwgFnk3kViDMlO_Z6t4AaABAg"},
{"text": "Close your eyes... Kermit the Frog o.o﻿", "time": "4 years ago", "author": "tevicroem03", "cid": "Ugyq6h0i2E4EWwUW7CZ4AaABAg"},
{"text": "I'm down.﻿", "time": "4 years ago", "author": "Scott L", "cid": "Ugz2DVhjwUvnwsOAn-l4AaABAg"},
{"text": "Don't be so hard on yourself numbnuts﻿", "time": "4 years ago", "author": "Handsome_Hero", "cid": "UgyWXU5rNya_OzplkG54AaABAg"},
{"text": "who are you to deem yourself better that the ones less fortunate? why would they be the ones to die and not you? ﻿", "time": "4 years ago", "author": "Uldis", "cid": "Ugwg_cSxLFS7i4vF6eF4AaABAg"},
{"text": "He took his daughter Lisa in to live with the rest of his children. Why don't you mention that? He gave to charities also. You sound more pissed off then Steve Jobs ever seemed. He didn't have 1/10th the money Gates does and what Gates is doing is very admirable. I don't like the idea of GMO's though. ﻿", "time": "5 years ago", "author": "bd9598", "cid": "UgwKYvghFcovFhb_szV4AaABAg"},
{"text": "It would be better to let the surplus Africans and Indians die off than to unleash genetically modified hell on the whole planet.﻿", "time": "5 years ago", "author": "Handsome_Hero", "cid": "UgzPjNhRmIWUT_1f8vB4AaABAg"},
{"text": "like a bios﻿", "time": "5 years ago", "author": "back2back005", "cid": "UgxoXTNQtxhYUaB2n8d4AaABAg"},
{"text": "Like a BOSS﻿", "time": "5 years ago", "author": "Economics Coffee", "cid": "Ugz0ET9wNmInpEjrzQ94AaABAg"},
{"text": "On 9/11/2001 I was a French bread delivery driver to central London's investment banks. Today I am a qualified, successful professional trader. To celebrate the launch of my education investment foundation I am willing to teach 100 people, for free (no upfront fee), how to successfully trade the financial markets. Terms and conditions apply.\nGoto: wwwdot100randomacts.co.uk\nemail: professionaltradingcoach@gmail.com\n﻿", "time": "5 years ago", "author": "professionaltrading", "cid": "UgxKLp_Ywi0ML2c3zbN4AaABAg"},
{"text": "Been using Windows since 98 only ever got a blue screen once.﻿", "time": "5 years ago", "author": "ThePatriotsfan01", "cid": "UgwFlwojLBUeTaTtj394AaABAg"},
{"text": "Did i say ''all Americans''?﻿", "time": "5 years ago", "author": "XS7SXSNIPER", "cid": "Ugwa4izPZWnBrVTxNn94AaABAg"},
{"text": "You know what else is sad? thinking all Americans don't think.﻿", "time": "5 years ago", "author": "ThePatriotsfan01", "cid": "UgwxlAEGXsp34kwqMit4AaABAg"},
{"text": "I think therefore I am allowed to bitch and whine. LOL﻿", "time": "5 years ago", "author": "attitudewithoutacause", "cid": "UgymKo20ZqzQ9JdE6TF4AaABAg"},
{"text": "Sadly your right.﻿", "time": "5 years ago", "author": "XS7SXSNIPER", "cid": "Ugy39PKwKHcbCX8-f3Z4AaABAg"},
{"text": "Um....you should read up on Steve's Philanthropy...you idiot.﻿", "time": "5 years ago", "author": "TheWitchfinder1", "cid": "UgyMuQ00da9na7jYzsV4AaABAg"},
{"text": "You may not like Microsoft, but the money he's given away is good.  How much did Steve Jobs give?  Fuck all.﻿", "time": "5 years ago", "author": "Steven Whiting", "cid": "UgxwTqXnnL_tPXOSvCZ4AaABAg"},
{"text": "Thinking isnt a big American pastime.﻿", "time": "5 years ago", "author": "attitudewithoutacause", "cid": "Ugy6ZiuHWTKhQqIeLW14AaABAg"},
{"text": "publicity stunts ﻿", "time": "5 years ago", "author": "XS7SXSNIPER", "cid": "Ugz0jOqfQiTn4xigNDx4AaABAg"},
{"text": "There you go and people don't see that.\n﻿", "time": "5 years ago", "author": "XS7SXSNIPER", "cid": "UgwBZt_peA_DE-TYqDV4AaABAg"},
{"text": "Super weed.﻿", "time": "5 years ago", "author": "TheApatheticGuy", "cid": "UgzLksqSAPYQaIakW9J4AaABAg"},
{"text": "Haha is that an Ipad on the guys lap at 2:34?!﻿", "time": "5 years ago", "author": "fredster", "cid": "UgwNpWIadgaqVfhPwJl4AaABAg"},
{"text": "I guess you're one of the people who have saved more than five million peoples lives. No? Thought so.﻿", "time": "5 years ago", "author": "G3N0Unknown", "cid": "Ugz9xbyJOBy59RoSdJp4AaABAg"},
{"text": "Recent studies of rats being fed GMO feed have formed large tumors and various illnesses, many of which have died after the two year study.  Keep in mind that rats being fed GMO food for 3 months has been the standard for years, until recently which scientists were allowed a duration of 2 years.  Rats being fed GMO food is what made it legal to sell it on store shelves.   It's clear genetically modifying crops is hurting humanity more than it's helping.   ﻿", "time": "5 years ago", "author": "HolographicLotus", "cid": "UgxNk8v_b5-fEgFhIDJ4AaABAg"},
{"text": "Fuck Monsanto.  Go watch Food Inc and see how corrupt and greedy those soulless life suckers are.﻿", "time": "5 years ago", "author": "HolographicLotus", "cid": "Ugz30svEuIbP9KmhrEB4AaABAg"},
{"text": "I bet you voted for Obama.﻿", "time": "5 years ago", "author": "Andre DeNicola", "cid": "UgxmgJX0L7NB1knqMdB4AaABAg"},
{"text": "THE GUY....IS A SAINT.﻿", "time": "5 years ago", "author": "Will Nottus", "cid": "UgxFNAA707AwmmmSry94AaABAg"},
{"text": "co ankle﻿", "time": "5 years ago", "author": "Collin Lewis", "cid": "UgxqJQPWwCH-W6Gx6yV4AaABAg"},
{"text": "He's just like Kermit the frog.﻿", "time": "5 years ago", "author": "JamesHanksy", "cid": "UgxNXOG8jX9PlZ8jTIN4AaABAg"},
{"text": "GMO's or starve to death? Ill take my chances with GMO's.﻿", "time": "5 years ago", "author": "attitudewithoutacause", "cid": "UgxfJtlvJs23HE0vzwd4AaABAg"},
{"text": "The awkward moment when you realize that Bill Gates is a eugenist that finance that finances programs trough NATO to control monitor global resources.﻿", "time": "5 years ago", "author": "Morbitron", "cid": "UgxyWa7aOuee6W1_MlR4AaABAg"},
{"text": "He and his company may be responsible for the worst operating systems ever to exist on this planet, but Bill Gates is a truly wonderful man.  ﻿", "time": "5 years ago", "author": "The Beast", "cid": "UgzDymEwa3bGevTzz7h4AaABAg"},
{"text": "For those who are only interested in the relationship between the two, jump to 3:34﻿", "time": "5 years ago", "author": "GTItoTTS", "cid": "Ugy0V9drkivvs6sOjKJ4AaABAg"},
{"text": "Imagine if everybody saved even half as many lives a Bill Gates has. We would run out of people to save. He is a hero.\n﻿", "time": "5 years ago", "author": "Ryley Verley", "cid": "Ugzz1jvksNrd6bBNrQx4AaABAg"},
{"text": "@Xenopex You can be sued for patent infringement by Monsanto if so much as one of their precious 'patented' seeds happens to find its way into your farm, intentional or not.﻿", "time": "5 years ago", "author": "LolzICanFly", "cid": "Ugw0-_0jLBZVNw58XZV4AaABAg"},
{"text": "End of starvation is the main goal of Monsanto ?! Are you kidding me? Their main goal is to produce higher amount of GM seeds and earn loads of money with patent royalties. Poor countries in India and Africa are big target markets for this kind of thing, apart from US.﻿", "time": "5 years ago", "author": "goldfingerhardcore", "cid": "UgxBbaEu416q-XbHLOB4AaABAg"},
{"text": "How in any way is Monsanto a terrible company? in your eyes would NASA and every other Research and Development company working to better the lives of others and advance technology \"terrible\" companies? Simply because you don't disagree with their methods, their end goal is to develop more resilient crops to help combat starvation, unless your viewing starvation as a good thing and therefore the companies combating it are terrible then you are beyond help.﻿", "time": "5 years ago", "author": "Xenopex", "cid": "UgykOMN8VgqaPvVjVQ14AaABAg"},
{"text": "Sure he is. Donating money to chemical giant Monsanto just shows how cynical he might be. Load of shit. Monsanto is a terrible company. ﻿", "time": "5 years ago", "author": "Felipe Santos", "cid": "UgwoPQ38PXQHYX9de0R4AaABAg"},
{"text": "Watching this video makes it depressing to watch the fanboys bickering like animals over which company is better. The two men that should have hated each other's companies the most are good friends! ﻿", "time": "5 years ago", "author": "Jaals", "cid": "Ugwbb83x6TsWNMl764V4AaABAg"},
{"text": "He's giving away 95% of his wealth and he will still be rich now that's impressive.  ﻿", "time": "5 years ago", "author": "Young Dark Link", "cid": "UgyJKYrEvNCxVwZEP4N4AaABAg"},
{"text": "lol thanx ;)﻿", "time": "5 years ago", "author": "MÁS SERGIO TV", "cid": "UgxbBDMsOlfH8Dro3qp4AaABAg"},
{"text": "lol...nice one...﻿", "time": "5 years ago", "author": "Benjamin Touitou", "cid": "Ugx5VCuxrFXb6KQ7a694AaABAg"},
{"text": "wow, i didnt know hes giving away 95% of his wealth. thats amazing.﻿", "time": "5 years ago", "author": "Conor Rosenberg", "cid": "UgwMnn-HeJaI-4YkPFJ4AaABAg"},
{"text": "Haha, very true!﻿", "time": "5 years ago", "author": "Al-ventures", "cid": "UgygNDVRcwn2ZYAzrB54AaABAg"},
{"text": "I don't disagree, but your initial comment came off as incredibly sarcastic and dismissive of the positive elements of the situation. I never said he'd be poor because of it nor even that he wouldn't still be incredibly, even stupidly, rich by normal standards, but ultimately it's irrelevant to the main crux of the matter.\n\nIt may be the logical thing, but it's depressingly rare nonetheless.\n﻿", "time": "5 years ago", "author": "Al-ventures", "cid": "UgwR_SQ_1lmxYkkU9TN4AaABAg"},
{"text": "Your point? Or do you give 96% of what you earn to charity? Because barring that I fail to see your moral high ground.\n\nTaking your figures, yes - he's giving 95 BILLION to charity. No matter how you slice it that's absolutely brilliant.\n\nI'm not saying Bill Gates is a saint, far from it, but I don't see anyone else on here giving away as much as he has to charity. Can he afford it? Yes. Does he have to do it? No. Ultimately that's what matters.﻿", "time": "5 years ago", "author": "Al-ventures", "cid": "Ugznq_TnpAIjU4MMpLd4AaABAg"},
{"text": "Without a heart he'd be dead ﻿", "time": "5 years ago", "author": "Bence Varga", "cid": "UgxnVQCdf6TrukwVbmZ4AaABAg"},
{"text": "co ankle﻿", "time": "5 years ago", "author": "DEADLYSOMALIAN", "cid": "Ugx2zj5hJQwjObuoYX54AaABAg"},
{"text": "so let me get this strait... bills os gets viruses in the cyber world but gates cures all the viruses and famen in the real world? the irony in that its like entering the twilight zone. O_o'﻿", "time": "5 years ago", "author": "MÁS SERGIO TV", "cid": "Ugy7b1AxhOkmptZ01wB4AaABAg"},
{"text": "I was lazy at the time... but as you wished:\nSo you're saying that charity doesn't help because it doesn't help enough lives? If no one gave anything to charity, millions of people would have suffered! You're an idiot for thinking that it doesn't help because the numbers are too low. YOU'RE THE FUCKING REASON THEY ARE! How the hell can you say negative things about Bill Gates?! HE GAVE FUCKING 95 % OF HIS WEALTH! He deserves to be called a hero, and people should thank him! ﻿", "time": "5 years ago", "author": "Ferhod", "cid": "UgwF5f67b3yjwemZbTR4AaABAg"},
{"text": "I know it's hard, but you need to come up with some better arguments.\n﻿", "time": "5 years ago", "author": "mastr323", "cid": "Ugz1Bl2IfO-0vtH5fB94AaABAg"},
{"text": "Just, no. Don't you fucking get me started...﻿", "time": "5 years ago", "author": "Ferhod", "cid": "UgzD1cqx9N9ozzA0s8l4AaABAg"},
{"text": "I'll bet you're a pathetic Apple/Steve Jobs fanboy. Give credit where it's due. 5 Million people people is freaking HUGE. How many lives have you saved? None. ﻿", "time": "5 years ago", "author": "Nothing", "cid": "Ugw6ab1KElxBHp13Xoh4AaABAg"},
{"text": "Lol, no, he's actually correct. Bourgeois charity is a joke.﻿", "time": "5 years ago", "author": "mastr323", "cid": "Ugxy9k7XBk4ye_VFJoB4AaABAg"},
{"text": "investing in mosanto o__o...ohhhhhhhhhhhhhhhhhhh fuuuuuuckkk that﻿", "time": "5 years ago", "author": "Alexandre Journault", "cid": "UgzdMT8QgzOVMcvsmeV4AaABAg"},
{"text": "@LsTrOfSmG It makes it even better that he doesn't give the money to his kids, but instead he told em to work hard and get their own money﻿", "time": "5 years ago", "author": "송재식", "cid": "UgwpGxK0B5kv6faZ0Md4AaABAg"},
{"text": "You really have to be the most retarded person on the planet to say something like that.﻿", "time": "5 years ago", "author": "Ferhod", "cid": "UgwfhVeka6E2G2Oq3yF4AaABAg"},
{"text": "Bill gates fucked up a lot of people in his life with microsoft monopoly and now he is trying to buy his place in heaven by doing good stuff. Notice that im not saying that what he is doing is wrong.﻿", "time": "5 years ago", "author": "ableite", "cid": "UgydX93C6itpajwOwm94AaABAg"},
{"text": "One of the few americans i respect. God bless this man!﻿", "time": "5 years ago", "author": "TheSixslinger", "cid": "Ugws6_29WFYfBF9Pnq54AaABAg"},
{"text": "You can see an iPad at 2:40 :p﻿", "time": "5 years ago", "author": "amuthan", "cid": "Ugxg6OQSquwPkyrPFk54AaABAg"},
{"text": "COANKLE﻿", "time": "5 years ago", "author": "ghostmouthzach56", "cid": "UgzXNdWkbeVApzP-zel4AaABAg"},
{"text": "Actually it was 136 billion, he is the 12th richest person in history i think ﻿", "time": "5 years ago", "author": "anthony king", "cid": "UgxbJfQJVDMFTC44Nwt4AaABAg"},
{"text": "I never said that Jobs did, or was it not me you meant to reply to?﻿", "time": "5 years ago", "author": "Al-ventures", "cid": "Ugyn_TkpZ2lMxazjkdh4AaABAg"},
{"text": "Dont get me wrong I think Gates is God over Jobs, but I feel Jobs successes in life are just as good if not slightly less as great Gates successes, and I feel Apple/ Jobs ability made Gates step up his mark to be able to help people﻿", "time": "5 years ago", "author": "hayhowwho", "cid": "UgxoHZGgt1g8sI4jZDR4AaABAg"},
{"text": "Jobs changed the aesthetics of the technological world, Bates changed the way technology works and is changing the world now for the people who cant change their fate, there is no way of comparing the two as although Jobs made computer he made computers look good, where as Bates made the computer concept work﻿", "time": "5 years ago", "author": "hayhowwho", "cid": "Ugye0h2TaZxWhoCHwDJ4AaABAg"},
{"text": "HE SHOULD SELL HIS HEART﻿", "time": "5 years ago", "author": "its2in0the1numbers1", "cid": "Ugx1XAY6iSdta6hN7294AaABAg"},
{"text": "So Hitler did a pretty good job to according to your logic. :)﻿", "time": "5 years ago", "author": "MCxDUDE", "cid": "UgzptF1fXZ_YMpZIXXB4AaABAg"},
{"text": "We need to UNDERSTAND:\nEradicate\nGMO'S & Why 3'rd world Countries are the LUCKY ONES?\n\nEradicate- Destroy completely or Completely destroy \n\n3rd world- ORIGIN: translation of French: tiers monde First used in the 1950s to DISTINGUISH The DEVELOPING countries FROM: \"Capitalist\" & \"Communist\" blocs\n(Predominately: Asia, Africa, & Latin America)\n\nGMO'S- Genetic engineering THAT alters THE genetic makeup of an organism \n\nTRUE PLAN: Destroy completely or Completely destroy 3rd world PEOPLE with GMO'S﻿", "time": "5 years ago", "author": "Tony Carr", "cid": "Ugw_MXGAPgV7IxLmd-B4AaABAg"},
{"text": "Bush vs. Kennedy's  ﻿", "time": "5 years ago", "author": "Tony Carr", "cid": "Ugy6zT3o0CUtC-Id3Zh4AaABAg"},
{"text": "If Steve Jobs had done nothing then you wouldn't know who he was.﻿", "time": "5 years ago", "author": "The Awsome Project", "cid": "UgxkL7R0fP3AAuhcM4d4AaABAg"},
{"text": "Steve Jobs changed the lives of millions of people as did Bill Gates but in different ways like this Bill Gates changes the world by helping people with virtually nothing and Steve Jobs changed the way we think about technology so with that i say go fuck yourself.﻿", "time": "5 years ago", "author": "The Awsome Project", "cid": "UgyT-544JItePWC0mlh4AaABAg"},
{"text": "Bill Gates for Prezident.﻿", "time": "5 years ago", "author": "Lukas Ruzevicius", "cid": "Ugzkb5K1g3mbMG0Zsup4AaABAg"},
{"text": "Bill Gates for Prezident.﻿", "time": "5 years ago", "author": "Lukas Ruzevicius", "cid": "UgzuiVQpjhR-LEyVxGl4AaABAg"},
{"text": "hmmmm. not sure about gm foods﻿", "time": "5 years ago", "author": "rogerheaton", "cid": "UgzJkN-O7sIBze7Ijat4AaABAg"},
{"text": "He's giving away 95% of his personal wealth. The (now ex) richest man in the world is giving away 95% of his personal wealth.\n\nLet that sink in... Still only a little? How much of your personal worth have you put into charity? Yeah, though so. Whatever you think of Gates, it's simply impossible to deny that this is incredibly beneficial to many, many people.﻿", "time": "5 years ago", "author": "Al-ventures", "cid": "UgxFLwYcg_ZUakPkJbR4AaABAg"},
{"text": "This.﻿", "time": "5 years ago", "author": "Anthony Tarantino", "cid": "UgzdDjZj2dooJDJgZ6V4AaABAg"},
{"text": "Bill Gates is a humanitarian. He is basically the complete opposite of Steve Jobs, in terms of being compassionate towards others less fortunate than him.\n\nBUT, in the world of technology, both Steve Jobs and Bill Gates changed the world through computers and software. Both men did great things, so stop with all the fanboy fighting.﻿", "time": "5 years ago", "author": "Anthony Tarantino", "cid": "UgwLoTdGscZiRR_eLYF4AaABAg"},
{"text": "And you haven't helped a single person this week, you fucktard.﻿", "time": "5 years ago", "author": "Nostalgia Gaming", "cid": "Ugxz1fJnW20QPNppChh4AaABAg"},
{"text": "Bill Gates is kinda awesome ﻿", "time": "5 years ago", "author": "S4ukk0", "cid": "UgxKaL2ZHGtyUDApUeR4AaABAg"},
{"text": "Like if you think the interviewer is a bit of a douche﻿", "time": "5 years ago", "author": "Lesnar Lulham", "cid": "UgwpBoGOpX8OD7azX8h4AaABAg"},
{"text": "Not all seven billion people have malaria﻿", "time": "5 years ago", "author": "Dan Leonard", "cid": "UgwDWYwqR6Gope4Ml7d4AaABAg"},
{"text": "He also gave away most of his Microsoft shares, with 9.6% left﻿", "time": "5 years ago", "author": "Dan Leonard", "cid": "UgwU6cLM-G7Ft7FCogd4AaABAg"},
{"text": "this was uploaded on my birthday.  :)﻿", "time": "5 years ago", "author": "AngryDoge", "cid": "UgxoYtVrNrOI32sOFLF4AaABAg"},
{"text": "They were so young in that picture!  Now he's alone at the top.  Funny how time passes.﻿", "time": "5 years ago", "author": "valar", "cid": "UgyKKU0jnUMVeoKD8HR4AaABAg"},
{"text": "Over five million lives have been saved?  That doesn't say much in a world population of about 7 BILLION.  Why not over 500 million?  Extreme wealthy like Gates get applauded for the little charity they give and it is little for him.  Better to promote fair wages human and labour rights and small business competion.  The fact that he's invested in Monsanto says it all!﻿", "time": "5 years ago", "author": "g mac", "cid": "UgyyuI9945x5qFFMa794AaABAg"},
{"text": "bill gates peaked at 114 billion. Almost 2x more than the current richest person in the world. He gave most of it to charity.﻿", "time": "5 years ago", "author": "redarrowhead2", "cid": "UgzrhZNQIEExTbS9VY54AaABAg"},
{"text": "Monsanto!! .... That's all I need to hear. Disgusting. ﻿", "time": "5 years ago", "author": "voice2voiceless", "cid": "UgzeRVAP2FCE4a9LvEx4AaABAg"},
{"text": "\"Here's my Co-Ankle\"﻿", "time": "5 years ago", "author": "David Newmon", "cid": "Ugw69dtYl8oX9x1p8ul4AaABAg"},
{"text": "haha didn't know my comment was one of the top ones XD and i guess ur right even though im a mac and pc user but everyone thinks difference i think they were/are both great guys nobody is perfect. ﻿", "time": "5 years ago", "author": "Josh Ochoa", "cid": "UgwDqbVZi55jkLf11uR4AaABAg"},
{"text": "i dont know Why people Adore Mr Jobs he was Good CEO, Gave people Some Good Tech instruments But he never Did Anything For Humanity, He was one of the Most Greediest man ever Held Power. Apple have so Much Cash and So Much Cap but they are charging 30 $ for a 50 cent adapter just to Fulfill their Cash Stacks.  They are Looting, Killing Competition and Paying Nothing Back to Humanity, Unlike Mr Bill Gates Steve is No God Man. He was just a Money Bragging Whore.﻿", "time": "5 years ago", "author": "inTubeHD", "cid": "Ugxra1Vr2WByNjIvUgB4AaABAg"},
{"text": "yes i agree, And the Government was too Much Willing to Launch Genetically Modified seeds For Farmers in India but the public and opposition parites made them to roll back their plans.﻿", "time": "5 years ago", "author": "inTubeHD", "cid": "Ugw4eXwYwtHZbkYZvfN4AaABAg"},
{"text": "No, they are really solid pieces of equipment, both hardware and software. That's 2 of the reasons it became #1 in the world. However, I resent the unnecessary confinements (you have to jailbreak or they suck). After the iphone4 I'll be going to android, but only because I prefer freedom to a walled garden...﻿", "time": "5 years ago", "author": "eaglerising82", "cid": "UgwOAl2sod085Cn9P5J4AaABAg"},
{"text": "Instead of commenting on how wonderful it is that Bill Gates is trying to end all malaria, or how he was friends with Steve Jobs, let's argue about headphones.﻿", "time": "5 years ago", "author": "973terminator", "cid": "UgwW2X758r6Yhz33EVV4AaABAg"},
{"text": "Apple kills chinese ppl to get 12% lower price... Microsoft wins﻿", "time": "5 years ago", "author": "lobsterrj", "cid": "UgzfTzzofoTkeUVMsC94AaABAg"},
{"text": "multi billionaire with a heart thats far more valuable.﻿", "time": "5 years ago", "author": "Sacto911", "cid": "UgxZxE9yisgR2A8aQRx4AaABAg"},
{"text": "what about birth control bill﻿", "time": "5 years ago", "author": "morrisonreed1", "cid": "UgweImygvr_j2AZsgPt4AaABAg"},
{"text": "I tried a pair of beats, they have poor bass response and a really crackly high end, you're paying for the name.\nI actually picked up a Genius headset the other day for about £20 that outstrips them by miles.\nBefore you question my credentials, I'm a sound engineer with a BA in audio production, I'm paid to know which headphones are good.﻿", "time": "5 years ago", "author": "David Gallacher", "cid": "Ugx-JcoH7XVu-UKpgDJ4AaABAg"},
{"text": "they're better than sonys and skullcandys by far﻿", "time": "5 years ago", "author": "Motor City", "cid": "Ugx2HmJQHzLtBOfeY494AaABAg"},
{"text": "His headphones aren't that good... They're a look, a fad if you will. And you know what's better than Beats? Pretty much every other brand in that price range. Why? They're overpriced shit. ﻿", "time": "5 years ago", "author": "Michael Terrio", "cid": "UgxNvSjSGcLh5RBeErF4AaABAg"},
{"text": "Well no im in college, and the school i go to i'd say maybe 25% of the students wear beats headphones because they're great quality worth the price.  You know Dr. Dre is now the richest rapper of all time? cause his headphones are the shit﻿", "time": "5 years ago", "author": "Motor City", "cid": "Ugw9xyZ3nzYZRWJ8Ash4AaABAg"},
{"text": "Hahahahaha. What are you, 12? Bragging about a shitty pair of \"designer\" headphones? Cool story bro. Go tell the other 6th graders what you have. No one here cares.﻿", "time": "5 years ago", "author": "Michael Terrio", "cid": "UgxaknTBVv1nSXWdOV54AaABAg"},
{"text": "bill and steve always had respect for each other and worked closely together in the early days, there was no hatred there just what the press manufactured in the heyday of windows steve wasn't even at apple he came back some years later to sort the mess out apple had created ﻿", "time": "5 years ago", "author": "neil johnson", "cid": "UgzIl7GKTSZEmM1J1Nl4AaABAg"},
{"text": "That's like saying I'm jealous because you have STDs.  You clearly have no perception of anything outside of middle school.﻿", "time": "5 years ago", "author": "DrFindro", "cid": "UgzRn6A9lPnANCxzBYl4AaABAg"},
{"text": "i mean a pair﻿", "time": "5 years ago", "author": "Motor City", "cid": "UgyR4FkOrjxSijf0EDt4AaABAg"},
{"text": "you're just mad cause you don't have beats, i have 2 pairs﻿", "time": "5 years ago", "author": "Motor City", "cid": "UgwVXpbmHv4dQnM39_14AaABAg"},
{"text": "You have beats as your avatar picture, I'm fine with myself.﻿", "time": "5 years ago", "author": "DrFindro", "cid": "UgzXQaq8jwJfe72oFQF4AaABAg"},
{"text": "lol you're so mad﻿", "time": "5 years ago", "author": "Motor City", "cid": "UgwWmJwkfSss4OplEvN4AaABAg"},
{"text": "Not everyone has music and phones but everyone has fucking machinery powered by gas?﻿", "time": "5 years ago", "author": "DrFindro", "cid": "Ugxbgv3BVcA6HKLiPCJ4AaABAg"},
{"text": "LOL @ Crapple being the most valuable company in the world.  Never will an electronic company be the biggest market idiot, not everyone needs music and iphones, but everyone buys gas﻿", "time": "5 years ago", "author": "Motor City", "cid": "Ugy2yhIFrUsSskBDGR14AaABAg"},
{"text": "Steve Jobs money was in Apple, there is a reason he had a $1 salary.  And Apple is the most valuable company in the world for a reason.﻿", "time": "5 years ago", "author": "DrFindro", "cid": "UgxT0-XecH59xFLtW0J4AaABAg"},
{"text": "Bill Gates has 66 Billion dollars right now.  Steve jobs died with 5.7 billion\n\nMicrosoft 1\nCrapple 0﻿", "time": "5 years ago", "author": "Motor City", "cid": "UgyMvJok-QvqMza4qJ94AaABAg"},
{"text": "Monsanto  basically has a monopoly on GM foods, the vast majority of GM foods are by that single company and they have proven again and again that they are the worst hands and even public opinion has shown this. Take a look at any list of most despised corporations in the world, and Monsanto will be at the top of nearly every one. current tech used to modify foods are unsafe, combined with lack of safety studies = disaster. Monsanto knows this, but makes billions pushing gm on the entire market﻿", "time": "5 years ago", "author": "tooosweeet", "cid": "UgwErYnhmMEvlv7NKDx4AaABAg"},
{"text": "When GM Foods are harming people then it has failed it's intended purpose of improving peoples lives. I think in the right hands GM foods can save the world but if in the wrong hands it will harm, maim or kill. ﻿", "time": "5 years ago", "author": "noelsoong777", "cid": "UgzQ7dgsvCbQ83eiHe94AaABAg"},
{"text": "@evanjellymanful Clearly you haven't been learning very much. I guess they don't teach you how to do independent research. Funny how you deleted your comment after likely fact checking what I said is true. You should do your fact checking before you insult others and brag about your 2 week credentials next time. If you did a little research yourself, you could have an intelligent conversation with your nutrition teacher instead of just listening to whatever is covered in the course material. ﻿", "time": "5 years ago", "author": "tooosweeet", "cid": "UgweBqdbT-a2xqlWLh94AaABAg"},
{"text": "Monsanto produces the vast majority of GM, and studies haven't shown many benefits in real world applications, but every 3rd party study has shown they are not as safe as monsanto claims. Monsanto buys off regulators, the news, and has massive marketing campains to push their products to market even though they are massively unhealthy. look up monsanto and fox news silencing investigative journalism. European countries aren't banning monsanto gm crops for no reason. Look up how they gm foods.﻿", "time": "5 years ago", "author": "tooosweeet", "cid": "UgzqfTrveUvS1iqNRMN4AaABAg"},
{"text": "They're not, foods are genetically modified by fracturing the genes at a cellular level , using a virus or bacteria like ecoli to invade the host cell carrying whatever genetic information attached to the modified bacteria.  it includes lot of other genetic information unintended. even intended effects like engineered tomatoes that produce toxins that rupture the stomachs of insects are terrible.  the toxins are absorbed into the human body and caused organ failure in rodent test subjects.﻿", "time": "5 years ago", "author": "tooosweeet", "cid": "UgwLlZ3LEIZdDEq1PZ54AaABAg"},
{"text": "GM foods is like any other kind of foods. If you do not grow them correctly they will cause damage to the human body. GM foods have to be in the right hands. ﻿", "time": "5 years ago", "author": "noelsoong777", "cid": "UgzE4n-Lfq2898EGgGZ4AaABAg"},
{"text": "If only those rich people can think like him, 5% of his money can give him a great and comfortable life and for his family and kids, \nI mean, what do you want to do with those multi millions and billions you have anyway, :/\n﻿", "time": "5 years ago", "author": "Jafar Al-Moosa", "cid": "Ugy6-T6aEx1c9p4NVBF4AaABAg"},
{"text": "*tonight he talks in my co-ankle﻿", "time": "5 years ago", "author": "Mr Jambiwana", "cid": "UgwWfEiLQzRB7kKUyzJ4AaABAg"},
{"text": "I wonder if Bill really knows the research on monsanto GM crops, that they never tested in humans for longer than 90 days and they control the IP very strictly so it's difficult for other studies to work on it. Studies have shown conclusively that it causes organ damage, and the genetically engineered toxins created to rupture bug's stomachs, do get absorbed into your body. ﻿", "time": "5 years ago", "author": "tooosweeet", "cid": "Ugzyjx8F3rqnE7JwsXR4AaABAg"},
{"text": "I like Bill, but monsanto is pure evil. Do the research. Also, Monsanto GM crops are not a \"slight risk\", people take their word for it, but there is a reason European countries are banning it. Every long term and real world study has shown devastating effects. China is now growing GM crops and there has been recent news that the animals and rodents that have been eating those crops are dying off. The crops can cause organ failure, sterility, cancer... Also read how it's done.﻿", "time": "5 years ago", "author": "tooosweeet", "cid": "UgzRRvwQ5JgDJbRCyWx4AaABAg"},
{"text": "it's funny he refers to Gates as \"the harvard dropout\" so to criticize his work for some reason, and a capital Congrats to gates for labeling the interviewer as a traffic cone =] ﻿", "time": "5 years ago", "author": "Keenan Anderson", "cid": "Ugw0RtmXJgQhf4lc0194AaABAg"},
{"text": "He is truly an amazing man.﻿", "time": "5 years ago", "author": "rslipaco", "cid": "UgwN_nn6MQtg9SmqK514AaABAg"},
{"text": "Bill Gates and Steve Jobs changing the world\nNOT Bill Gates VS Steve Jobs ﻿", "time": "5 years ago", "author": "Josh Ochoa", "cid": "UgzeIJ9JP3gyQxo7_qd4AaABAg"},
{"text": "why does the interviewer have ORANGE PAINT all over his face?﻿", "time": "5 years ago", "author": "Datashat", "cid": "UgxoZqsy0eUGt3rwVnJ4AaABAg"},
{"text": "Without genetically modified crops, I don't think we can feed even half the world. Hippies need to chill the fuck out.﻿", "time": "5 years ago", "author": "domdomdrumdrum", "cid": "UgyrQVzRKC8ClhRSvqV4AaABAg"},
{"text": "No﻿", "time": "5 years ago", "author": "Jordan Seaward", "cid": "Ugx7iSJTllBdJ1omn1t4AaABAg"},
{"text": "exactly. Bill Gates is 5x the man Jobs was﻿", "time": "5 years ago", "author": "Motor City", "cid": "UgzpUGjzb7xVhjreMN54AaABAg"},
{"text": "Bill Gates is 5x the man Steve Jobs ever was﻿", "time": "5 years ago", "author": "Motor City", "cid": "UgzBaRX2UjWyxXywVFZ4AaABAg"},
{"text": "I know, and a porsche costs more than a Kia. It's outrageous that superior products are not priced the same as their competitors!﻿", "time": "5 years ago", "author": "eaglerising82", "cid": "UgxSNPcurTFZmVYGhzZ4AaABAg"},
{"text": "\"samgau\" you are extremely ignorant about the workings of cancer.  The root of all cancer is found in our telomeres, the genetic tail of DNA synthesis.  The buffer that enables the coding of DNA to be consistent every time during cellular reproduction.  Don't say shit you don't know, especially the fact that over the internet we accumulate an astonishing amount of inert facts from crap like your comments.﻿", "time": "5 years ago", "author": "Matthew Slack", "cid": "UgxtVG8rHv9oc8ABSqx4AaABAg"},
{"text": "Steve Jobs won't be in history books, he didn't do shit for anyone and over price all of his products. A Windows Phone costs $49 to $199 and an iPhone $199 to $399. Really!!!﻿", "time": "5 years ago", "author": "Cade Ray", "cid": "UgwO4BHjfNGC3kdNNlN4AaABAg"},
{"text": "2 pioneers, throw in Steve Wozniac and Warren Buffet.It is amazing when see people living that will be taught in history books.Sad to see him go. ﻿", "time": "5 years ago", "author": "Daniel Parker", "cid": "Ugxn8vS_kAM8mDeBGpR4AaABAg"},
{"text": "yes he is retarded﻿", "time": "5 years ago", "author": "Daniel Parker", "cid": "Ugwf-ON0CFkPicQrhiF4AaABAg"},
{"text": "I love my co--ankle. ﻿", "time": "5 years ago", "author": "Ryan Simmons", "cid": "Ugz46OTDMm4LCD5Vgup4AaABAg"},
{"text": "that's just the response, not the cure. Tell people with stage 4 cancer (metastasis) where it's spread, and growing everywhere in your body. There's no way to trace it, but just to respond to it. It's basically a slow, agonizing death. Why do you think people with cancer (that has been cured before) relapse? It's in their DNA to recreate the cancerous cells. No cure. ﻿", "time": "5 years ago", "author": "samgao", "cid": "UgwJ2kwj4jlLb2DFYBF4AaABAg"},
{"text": "Spend money to cure cancer. That's really the biggest problem of the world... Once you get it, you can't get rid of it. It's not a virus or a bug. It's your DNA telling your organs to die.﻿", "time": "5 years ago", "author": "samgao", "cid": "Ugy41pjDD3BV4kgpThF4AaABAg"},
{"text": "For what Bill Gates is doing for charity, it is more than many billionaires in the world are doing. His active and personal participation to have his good cause WORK is admirable compare to many charitable organizations. Other organizations probably are hinder by internal politics and self-interest.﻿", "time": "5 years ago", "author": "HuiChyr", "cid": "UgyzjMZlSD6LEQQWsup4AaABAg"},
{"text": "Monsanto is one of the worst companies in the world. GMO is terrible in most cases. Birthrates of livestock fed with GMO feed are extremely low compared to those livestock that were fed with normal feed. Genetically modified crops are usually never good.﻿", "time": "5 years ago", "author": "B4Knight", "cid": "UgxYcxhoRyd7ZkRP1Jt4AaABAg"},
{"text": "i paid for all of this by buying overpriced and poorly designed Microsoft software.﻿", "time": "5 years ago", "author": "thegreathead", "cid": "UgwTAO2ygN8U_OrteP14AaABAg"},
{"text": "co-ankle﻿", "time": "5 years ago", "author": "Mark Pizzutillo", "cid": "Ugz0AAE_UoC7rn8cZrd4AaABAg"},
{"text": "haters are always hatin 'round the clock﻿", "time": "5 years ago", "author": "Sawyer Stoos", "cid": "UgxZLvLlfiq3nAFjdaF4AaABAg"},
{"text": "lets talk to my co-ankle\r\n﻿", "time": "5 years ago", "author": "05keyshawn", "cid": "UgxWtGJUsA9957fNU5d4AaABAg"},
{"text": "Right, because you did more then Bill Gates did to help the world keyboard warrior.  I doubht you would give away $25 Billion assholes.﻿", "time": "5 years ago", "author": "lairdriver", "cid": "UgwFkIRpjivlZnU08U94AaABAg"},
{"text": "Are you retarded?﻿", "time": "5 years ago", "author": "Shakeitupyes", "cid": "Ugyp8LBJ5skEc4V0Qht4AaABAg"},
{"text": "Well, according to the rules of your religion, aren't you supposed to love everyone else in the world no matter what their beliefs and opinions are? Since you aren't following the code of your religion, theoretically, you would be the one going to hell for not loving everyone else the way they are.﻿", "time": "5 years ago", "author": "Alexander Ingram", "cid": "Ugy6-OzMWRKCwN158Ql4AaABAg"},
{"text": "duno but he sure is funny﻿", "time": "5 years ago", "author": "Zenomexican", "cid": "Ugzqg5TeZ9dBt7ZVckR4AaABAg"},
{"text": "MONSANTO KEYWORD MONEY...﻿", "time": "5 years ago", "author": "Jorge M Cisneros", "cid": "UgxaC4fN0KLqKm10Zl54AaABAg"},
{"text": "Drummerdumbass shut up did you do anything to help those people no﻿", "time": "5 years ago", "author": "ROFLcopter781", "cid": "UgxPxfk8ryLlr0udKb94AaABAg"},
{"text": "I'm gonna guess and say that you're Christian?﻿", "time": "5 years ago", "author": "Alexander Ingram", "cid": "UgwJNDRExbWtBzpw23V4AaABAg"},
{"text": "You are hilarious.﻿", "time": "5 years ago", "author": "MewCat100", "cid": "UgwQQLsyvQADxCmYXzB4AaABAg"},
{"text": "Only one typo? How about two in terms of \"caccinations\" and \"droppoing.\" You clearly don't know the first thing about genetic modification, but let's assume, for a second it is bad. You conclude from that that Gates is trying to do something evil, which wouldn't fit with his stated intentions or with the obvious good his actions like reducing polio, reducing malaria, and so forth have done. Thus, your conclusion is wrong.﻿", "time": "5 years ago", "author": "MewCat100", "cid": "UgyeqOIhZGZ0QFVFdzJ4AaABAg"},
{"text": "You work at a mall? Doesn't that require to at least be able to spell some basic words such as \"with\" properly?﻿", "time": "5 years ago", "author": "giovanni9107", "cid": "UgzG4D69Co2kIhRNudZ4AaABAg"},
{"text": "It would be easier to understand what you are saying if it wasn't riddled with typos. I think you just might be insane as well as stupid.﻿", "time": "5 years ago", "author": "MewCat100", "cid": "Ugxp9P-3yxAliuYX3Tt4AaABAg"},
{"text": "With Gates's help, Polio may go the way of Small Pox. He may be the only person to ever accomplish the eradication of a disease his own dime.It is truly amazing accomplishment and if that is all he does in his life it will be more than anyone else has single-handedly done for humanity.﻿", "time": "5 years ago", "author": "MewCat100", "cid": "UgzvxTuW79YCUtzp81Z4AaABAg"},
{"text": "Tonight, he talks with my co-wankle..bwahahaha 0:08﻿", "time": "5 years ago", "author": "Jason DaSilva", "cid": "Ugxt6freIQH1TtOu4AJ4AaABAg"},
{"text": "Have you ever seen a million dollars? just because you can't see it, doesn't mean it doesn't exist!﻿", "time": "5 years ago", "author": "Michael Smith", "cid": "UgzTNyuBKpYW4a-Mgbd4AaABAg"},
{"text": "this made me lol﻿", "time": "5 years ago", "author": "LedgendaryKorn", "cid": "UgyO7-BoXd90HEy1EEt4AaABAg"},
{"text": "I don't know about you but Bill's foundation is what funded my school for the first five years giving over 300 students a free highschool and 2 year college education in only a four year span, granting over $500,000 to us alone. If you really want to call some rich guy a douche, make sure to do your research asshole.﻿", "time": "5 years ago", "author": "LedgendaryKorn", "cid": "UgzELR7JSJQ5fDdkOJx4AaABAg"},
{"text": "CO -Ankle Hilarious﻿", "time": "5 years ago", "author": "Marcole Martin", "cid": "Ugz3so4WJgvA-T5guOt4AaABAg"},
{"text": "Actually he did not. You also missed the point it seems.﻿", "time": "5 years ago", "author": "MD", "cid": "UgzLFqpgkO6s0IjLYnd4AaABAg"},
{"text": "Genies !\n﻿", "time": "5 years ago", "author": "RusssiaImperia", "cid": "UgzjhjEecE3Ziz6T6714AaABAg"},
{"text": "Puts Good Guy Greg to shame﻿", "time": "5 years ago", "author": "Marco C", "cid": "UgyhVi71A77M9W-ib0d4AaABAg"},
{"text": "I really miss Bill as a CEO. Ballmer isn't really my favourite...﻿", "time": "5 years ago", "author": "0oDarkLordRevano0", "cid": "Ugz1gPIAFYH2npfCVSF4AaABAg"},
{"text": "I'm sure sitting in your ass in front of a computer screen puts you in a position of superior enlightenment. ﻿", "time": "5 years ago", "author": "giovanni9107", "cid": "UgxB_yPpWOIGZgWSaYd4AaABAg"},
{"text": "Fair enough.﻿", "time": "5 years ago", "author": "Jasper de Jong", "cid": "Ugwq1LuMG6_bN3jpqyJ4AaABAg"},
{"text": "Hey, thats true, but I only buy one mac per 2 decades xD﻿", "time": "5 years ago", "author": "IRNBRU64", "cid": "Ugy_crZwZNgu9f8VXfN4AaABAg"},
{"text": "Pretty rude to say this, if one third of all humans is poor.﻿", "time": "5 years ago", "author": "Jasper de Jong", "cid": "UgwDsN5S0SQCvJqA7Jp4AaABAg"},
{"text": "Steve jobs has eased my human suffering so much you have no Idea﻿", "time": "5 years ago", "author": "IRNBRU64", "cid": "Ugx-f8tIfgk6-u5klWV4AaABAg"},
{"text": "when mac went broke microsoft had to bail them out or they would get shut down by the government for having a monopoly﻿", "time": "5 years ago", "author": "knightmaher1", "cid": "UgzMPTXrgWzkD6zJZK94AaABAg"},
{"text": "Oh really? Then what the fuck was he doing up until 5 years ago since 1990? I'll answer that you for you idiot, pushing Windows down everyone's throat while trying to screw Apple and their customers in the process. Gotta love shitheads like you that give the Hitler-type credit just because they are doing good deeds TODAY while ignoring all the hell they caused in the past. Loser. ﻿", "time": "5 years ago", "author": "macuser5555", "cid": "UgyvnBAFygGrzHbfyjB4AaABAg"},
{"text": "I wasn't complaining about anything. Some idiot up there thinks religion causes world hunger.﻿", "time": "5 years ago", "author": "Cameron", "cid": "Ugwgw4MXSBcxTmVhF1l4AaABAg"},
{"text": "@highks Because if you do, all religiuos would be after you.﻿", "time": "5 years ago", "author": "DC Fansubs", "cid": "UgxmCPmhFq8HoBiRwMR4AaABAg"},
{"text": "Also, please name something about religion that would cause world hunger or overpopulation ( besides abortion, but there are reasons for that that I won't get into because I want to stay on topic). Don't say contraceptives, there isn't anything in the bible about that. (I can't say for other religions, but honestly grouping all religions together and saying something about them isn't a good idea).﻿", "time": "5 years ago", "author": "Cameron", "cid": "UgyjAIu84st_tbchB-l4AaABAg"},
{"text": "And... what exactly do they DO that upsets you? All I'm saying is that MY religion says that abstinence is good and never says ANYTHING is wrong with contrasceptives. JUST abortion. And I don't understand what the whole, \"Its not what they think, it's what they do\" thing.  To be of a religion you DO what your religion said. All I'm saying is that besides maybe abortions, the bible(my religious book) says nothing that would cause more world hunger. It even teaches abstinence (less overpopulation)﻿", "time": "5 years ago", "author": "Cameron", "cid": "UgyU8TtueYoLUEMUO8B4AaABAg"},
{"text": "your so stupid go to INDIA AND ASK EVERYONE SINGLE PERSON IF BILL GATES HELPED THEM SO SHUT THE FUCK UP﻿", "time": "5 years ago", "author": "shuGRUE123", "cid": "UgxWSCB5m0AnsvfisnN4AaABAg"},
{"text": "JESUS only is our message!# ﻿", "time": "5 years ago", "author": "brawn money", "cid": "Ugx5316-2VywlqG6_w94AaABAg"},
{"text": "What they think is not relevant. What they do is.﻿", "time": "5 years ago", "author": "MD", "cid": "UgxJM_Xtn9_n3N2SOnF4AaABAg"},
{"text": "*no if in the beginning of the last scentence﻿", "time": "5 years ago", "author": "Cameron", "cid": "UgzaK8iCOzU-yiQ7zKx4AaABAg"},
{"text": "*thought﻿", "time": "5 years ago", "author": "Cameron", "cid": "UgzDoiW14naL4-YE4914AaABAg"},
{"text": "Since when has \"religion\" think abstinence doesn't work? The single time at least in MY religion it didn't work was with Mary and Jesus... Plus if why would it think it didn't work if it TAUGHT US it was good?﻿", "time": "5 years ago", "author": "Cameron", "cid": "Ugybq4_16eyNXEqe94R4AaABAg"},
{"text": "\"Abstinence\" does not work. Not according to religion. ﻿", "time": "5 years ago", "author": "MD", "cid": "Ugy1VSR1BCDz3sm-FyB4AaABAg"},
{"text": "It ALSO teaches abstinence until marriage. And there's nothing wrong with condoms of contraceptives, just abortion.﻿", "time": "5 years ago", "author": "Cameron", "cid": "UgxpCovq9PZz272vLc54AaABAg"},
{"text": "Apple stole from Xerox and Microsoft stole from Apple.. so it's not like 1 company is good and the other is bad, Microsoft showed that you can succeed by leasing your software and stuff like that and apple showed that you can be successful by creating a hub for your products..﻿", "time": "5 years ago", "author": "Iam Costaa", "cid": "UgwSLBzzMlcutvgXAvt4AaABAg"},
{"text": "CO ANKLE HAHA﻿", "time": "5 years ago", "author": "Dennis Vassenkov", "cid": "UgyLIMnRAWE6rBsRmzl4AaABAg"},
{"text": "Now I can't curse at him whenever my xBox gets nutty.... Or curse at him anyways because he is Jesus.﻿", "time": "5 years ago", "author": "Belligerent Bass", "cid": "Ugx1Muzg_FghF-e4Xlt4AaABAg"},
{"text": "Oh I don't know, ask the fucking 5 million people in India who are alive because of him.﻿", "time": "5 years ago", "author": "shuGRUE123", "cid": "Ugyaw1W-2WWmPj9RWq94AaABAg"},
{"text": "THIS IS ANOTHER GREAT CHANNEL/VIDEOS I SUB, VIEW, COMMENT & LIKE! CHECK MY (IT) VIDEOS THANKS!!! ﻿", "time": "5 years ago", "author": "ITSystemsAdmin", "cid": "Ugx_0H7AGy9cxZKz9sB4AaABAg"},
{"text": "You honestly be retarded because this man has helped people all over the world. Fucking do something in your pathetic life. ﻿", "time": "5 years ago", "author": "shuGRUE123", "cid": "Ugxf2vjwV0nb2iwAdrJ4AaABAg"},
{"text": "WHEN THE HECK WILL THIS MAN GET A NOBLE PRIZE FOR HIS PHILANTHROPY?\nSWEDE..mofos..are you even listening to me?﻿", "time": "5 years ago", "author": "manvsminaua", "cid": "UgygJAHftKCJRApgH8V4AaABAg"},
{"text": "lol pathetic relentless troll who must have the last saying or else he feels like the retard that he is. go ahead ahole speak to my dick cause my balls are recording﻿", "time": "5 years ago", "author": "Pedro Santos", "cid": "UgxS7Yh7LnNGIdd2KEF4AaABAg"},
{"text": "you really are a retarded hater aren't you?﻿", "time": "5 years ago", "author": "TheImpignorate", "cid": "UgzY2cXbD02Cj_QJ4op4AaABAg"},
{"text": "hes not dead? hahaha dumbshit﻿", "time": "5 years ago", "author": "shuGRUE123", "cid": "Ugyh55zqUIYEKOPddNF4AaABAg"},
{"text": "you got owned get used to it﻿", "time": "5 years ago", "author": "Pedro Santos", "cid": "UgyNqW3zdnMMIOXGPlJ4AaABAg"},
{"text": "whoever raised you as a person had never seen animals before. BOOM﻿", "time": "5 years ago", "author": "Pedro Santos", "cid": "UgzZuffzSWfYBYS5xth4AaABAg"},
{"text": "stick your drums up your arse and calm the f*ck down u hippie﻿", "time": "5 years ago", "author": "Pedro Santos", "cid": "UgxF9KBrt47C3G2q32l4AaABAg"},
{"text": "master troll im sure your parents regreat not using a condom that night﻿", "time": "5 years ago", "author": "Pedro Santos", "cid": "UgytKbDjlDHY1HITOwl4AaABAg"},
{"text": "just stfu u fail at life, stop breathing my air﻿", "time": "5 years ago", "author": "Pedro Santos", "cid": "UgwRCU0uYzOJZJb0o_p4AaABAg"},
{"text": "well if you watched the fucking video retard it says how much he gave away. GG bro﻿", "time": "5 years ago", "author": "shuGRUE123", "cid": "Ugzk1VcBNZSGMQn1o2R4AaABAg"},
{"text": "yea that \"faggot\" gave away 26 billion of HIS money away to help people in india. what a \"faggot\" move of him﻿", "time": "5 years ago", "author": "shuGRUE123", "cid": "UgwOOZ8qzQpUwpZnnxl4AaABAg"},
{"text": "gates and jobs both genius ﻿", "time": "5 years ago", "author": "paszdevil1", "cid": "UgwA1oCxMmX94KC2e_V4AaABAg"},
{"text": "CO ANKLE!﻿", "time": "5 years ago", "author": "James Bong", "cid": "Ugxl_Cs6c6BMacnn2fN4AaABAg"},
{"text": "Jobs looked like a badass when he was young, while Gates looked the opposite. ﻿", "time": "5 years ago", "author": "XxGenociidalxX", "cid": "UgwUQqFlfBVxYJR_O0B4AaABAg"},
{"text": "By telling people contraceptives (and anything related to sex) are evil.﻿", "time": "5 years ago", "author": "MD", "cid": "Ugxo9ITzaC9ES8PjN-h4AaABAg"},
{"text": "Wait, what does religion have to do with this? How does religion affect world hunger?﻿", "time": "5 years ago", "author": "Cameron", "cid": "Ugy5EYyG3t5L_8sDFHJ4AaABAg"},
{"text": "cool, i worked for monsanto, ripping the genitals off of corn, and choping down the retarded stalks﻿", "time": "5 years ago", "author": "SysPowerTools", "cid": "Ugw87FmhMeLM0SbtjJ94AaABAg"},
{"text": "No, science is not \"the truth\". Science has a hypthesis about what could be the truth. As soon as somebody finds out something new and different, other scientists review that work and finally say \"yes, he or she is right, we were wrong and we will have to change our hypothesis\". That never happens in religion. You don't find new evidence in religion, you never change the written truth in religion.﻿", "time": "5 years ago", "author": "highks", "cid": "Ugzt2MivadIqSZjkWV54AaABAg"},
{"text": "the look on his face when the dude brought up steve jobs... fuck bill, I'm sorry. stay amazing and humble.﻿", "time": "5 years ago", "author": "battlecitysinner", "cid": "UgwfHWc8RvWJWTxy9FF4AaABAg"},
{"text": "To billy, get the f--k out of GMO's and Monsanto...  thank you ﻿", "time": "5 years ago", "author": "horseinmail", "cid": "UgxyJRc5Kf8Bkr_hQ1V4AaABAg"},
{"text": "probably cause unlike the PC and MAC fanboys Bill Gates realizes that fighting over computers is stupid and he's above such childish crap.﻿", "time": "5 years ago", "author": "MrAppleJaxs", "cid": "UgwtPz1fWTjShtGFMAB4AaABAg"},
{"text": "right right, i dont. I just know steve jobs stole a very important thing from xerox. I also know that he allways cared about making a good product for the people. Also know that he was a total a-hole as a boss. So yeah its clearly i DO know stuff about him. \n\nAnd i still think bill gates is twice the man, and twice as grown up. Bill Gates seem to be one of the very few, who actully tries to help people.﻿", "time": "5 years ago", "author": "Gouki6669", "cid": "Ugyme3ZZKvS-mOhJh_N4AaABAg"},
{"text": "u clearly don't know anything about Steve Jobs or his younger years and upbringing.﻿", "time": "5 years ago", "author": "Iam Costaa", "cid": "UgyEQikFRuuAdeuQvzF4AaABAg"},
{"text": "co-ankle @0:09 lol﻿", "time": "5 years ago", "author": "TheCoolFusion", "cid": "UgxjTF5wjLL6UM9D4WN4AaABAg"},
{"text": "he does not care anymore, he is trying to save humans, and make a REAL diffrence on earth, not like steve jobs -.-﻿", "time": "5 years ago", "author": "Gouki6669", "cid": "UgyMMYjzHpVv1MwFBPF4AaABAg"},
{"text": "BILL GATES FOR PRESIDENT!!!!!!!!!!!!!!!﻿", "time": "5 years ago", "author": "Gouki6669", "cid": "UgywrefvYSggMnv2mDd4AaABAg"},
{"text": "Bill gates made the first tablet computer. Fact.﻿", "time": "5 years ago", "author": "DobermanIslandRepublic", "cid": "UgwQuD7N0CGTMHFUas14AaABAg"},
{"text": "Also, Bill Gates is more of a hero in my eyes than Steve Jobs will ever be. Jobs isn't even close.﻿", "time": "5 years ago", "author": "My Names not your Business", "cid": "Ugy-W_ihqgdDUthgIm94AaABAg"},
{"text": "co-ankle.﻿", "time": "5 years ago", "author": "My Names not your Business", "cid": "UgyVZJpZ-NuKTuudlSR4AaABAg"},
{"text": "Fair point just seemed an odd thing for a interviewer to do. You would think he would try and avoid bias by using pen and paper or something﻿", "time": "5 years ago", "author": "AlexGrahamVlogs", "cid": "UgyHr7TWFQ0SzVreMIp4AaABAg"},
{"text": "R.I.P.﻿", "time": "5 years ago", "author": "TheCarFanForever", "cid": "Ugx9xqMtwjcbKOjw2Jd4AaABAg"},
{"text": "Fact:\n\nBill Gates donated half of his net worth to help poor people.\nMeanwhile, Steve Jobs and his executives spend their net worth on exotic sports cars and golf clubs.﻿", "time": "5 years ago", "author": "SPACE CAT", "cid": "Ugy1-84zGxJhamlZsrx4AaABAg"},
{"text": "Tonight he talks with his co ANKLE. he must have a smart ankle.﻿", "time": "5 years ago", "author": "Garrett The Great", "cid": "UgyUCq7HN3hwg6jrGRd4AaABAg"},
{"text": "God aint got shit on Bill Gates, HE ACTUALLY SAVES PEOPLE.﻿", "time": "5 years ago", "author": "Said Garcia", "cid": "Ugxm85q4r1yBCr1HOix4AaABAg"},
{"text": "LOL his name is MORON !﻿", "time": "5 years ago", "author": "Umer Farooq", "cid": "UgxVsSwGCfqMfU0iiQh4AaABAg"},
{"text": "He is the greatest man on earth.﻿", "time": "5 years ago", "author": "Vic J", "cid": "Ugxsu06dLZKC3S2qAAd4AaABAg"},
{"text": "Part 2: And with that I will say that it's up to you to decide that you believe that the stone always will fall to the floor, cause you have \"scientifically proven it\" or to believe that something else could happen.﻿", "time": "5 years ago", "author": "LoveZelda3", "cid": "UgwIWsmegSxm_nuxEsF4AaABAg"},
{"text": "Part 1: Like a religious scientist did show me and others at a presentation of his new book, translated: \"footprints in the Cosmos\", he took a stone, lifted it up till he's arm was stretched out and dropped it down to the floor. Then he repeated the action ten times and it kept dropping to the floor. Then he asked what will happen if he drop the stone an eleventh time? Though we can never prove without testing it, in scientific way you say like the stone will fall to the floor 10 of 11 times.﻿", "time": "5 years ago", "author": "LoveZelda3", "cid": "UgxhX9uh2RtaXTYh7Wx4AaABAg"},
{"text": "Science does not consist of beliefs we defend, but hypotheses we tested. Surely you are intelligent enough to notice the difference.﻿", "time": "5 years ago", "author": "MD", "cid": "UgyhX99wLTuLal_sfHR4AaABAg"},
{"text": "No, a religion for a man is just the truth, which we are trying to defend because we claim to believe in it, therefor are science a religion.﻿", "time": "5 years ago", "author": "LoveZelda3", "cid": "UgzW9BM3HhSU3gJEszd4AaABAg"},
{"text": "What gave you the silly idea that science is a religion? It is unlike anything that we call religion.﻿", "time": "5 years ago", "author": "MD", "cid": "UgzKhSENQorUwIZ-a1N4AaABAg"},
{"text": "Science is a religion, so you do always have a religion.﻿", "time": "5 years ago", "author": "LoveZelda3", "cid": "Ugw9G_XaYEI3pT2E6EB4AaABAg"},
{"text": "Why would I believe in any?﻿", "time": "5 years ago", "author": "MD", "cid": "UgyVma_u09b2QZ2A_-Z4AaABAg"},
{"text": "Can I ask what religion you believe in?﻿", "time": "5 years ago", "author": "LoveZelda3", "cid": "UgytU7rGp62lXSwrQ214AaABAg"},
{"text": "I know what you mean, I love Windows but I think the same way about Steve even though I hate Apple, they have both been great men who have changed the history to the better I think.﻿", "time": "5 years ago", "author": "LoveZelda3", "cid": "Ugz759tFTx9mKrtehS54AaABAg"},
{"text": "You cannot modify religions to be what you want them to be. Religions will always behave in ways that are good for their propagation, much like living organisms. Making a lot of children and indoctrinating them is excellent for religion.\n\nThere are infinitely many things you cannot disprove yet people don't believe in all of them.﻿", "time": "5 years ago", "author": "MD", "cid": "UgxH6BtoaSFvnSO36e14AaABAg"},
{"text": "Depend on how rich you mean, but I don't wish I was.﻿", "time": "5 years ago", "author": "LoveZelda3", "cid": "UgyIihiLRuHSNXt7Cnx4AaABAg"},
{"text": "I agree that it's hard to let religion rule a country, cause it will always be people who use it to gain more power to themselfs and all people have their own interpretations of what the religion stands for, so one could easily get it to be just like one want it to. But you can never get rid of religion, because you just can not prove the opposite, that no religion would be true and as long as you can't do that, which we never will do, people are going to believe in something different.﻿", "time": "5 years ago", "author": "LoveZelda3", "cid": "Ugy6TOFXn3kqszlbyqF4AaABAg"},
{"text": "Who's talking about war? I know I am not. I was talking about the role religion plays in people's views on abortion, contraception, procreation and so on.﻿", "time": "5 years ago", "author": "MD", "cid": "Ugw77VT2ygCinUmZLqN4AaABAg"},
{"text": "Then you obviously do not know history, if you believe the biggest cause for war is religion then you are delusional. Mans greed and fear, distrust and blind hate is the reason for war. A king,  president, prime minister send men into war, not religion.\n﻿", "time": "5 years ago", "author": "Naskilla19", "cid": "UgzHGa8IlRRuLlZyD014AaABAg"},
{"text": "Bill has done it all. Good man!﻿", "time": "5 years ago", "author": "mavericksf16", "cid": "UgyvtXR0JEl8G5AWEHB4AaABAg"},
{"text": "No, I can't say I remember religion being banned in Rome.\nIf a human can always play the \"God is on my side\" card, how do you expect them to take responsibility? Are you going to reason with them?\nMany things, but not everything.﻿", "time": "5 years ago", "author": "MD", "cid": "UgwGrXu_Cx8fCjA3x2x4AaABAg"},
{"text": "Remember when Religion was banned in Rome, where they beheaded Christians? Stop trying to blame everything on religion, humans need to take responsibility for what they do and not make excuses. People have killed in the name of everything on this planet.﻿", "time": "5 years ago", "author": "Naskilla19", "cid": "UgxfThvD2bo-vHZdkZR4AaABAg"},
{"text": "Exactly what I was going to say...﻿", "time": "5 years ago", "author": "AnyTechReviews", "cid": "UgxDLkSYsYtqVYpwMO94AaABAg"},
{"text": "Did he just sit there with a ipad in his lap like it was nothing lol?﻿", "time": "5 years ago", "author": "AlexGrahamVlogs", "cid": "Ugz3lItCf4fu8oBDAmt4AaABAg"},
{"text": "I didn't mean that the choice of genes is random.﻿", "time": "5 years ago", "author": "MD", "cid": "Ugzo9K21LNjNkdMa3P54AaABAg"},
{"text": "Such a nice guy.﻿", "time": "5 years ago", "author": "Atticus Koya", "cid": "UgzwDN31dIhLjTs1X2Z4AaABAg"},
{"text": "So your solution is to introduce diversity by randomly inserting bacterial genes and hoping for the best? There's a lot wrong with that idea, IMO. Why not do something about the \"many people\" part instead? ﻿", "time": "5 years ago", "author": "MD", "cid": "UgyPfT13p4jbfyRdNSF4AaABAg"},
{"text": "@MakoVlazkov i agree, but to subsidize because something is not sustainable or profitable on its own isn't the same as subsidizing to get the pioneers off their feet, like with renewable energy or organic farming.﻿", "time": "5 years ago", "author": "InvisiMan", "cid": "Ugxo_zDTBFIFsuIOKld4AaABAg"},
{"text": "They already grow dozens of varieties of tubers in south america. It's been done for centuries.  Other diverse varieties of food is grown all over the world. We have over 100 types of avocado, but stores only sell one or two types... disaster. The problem is that governments subsidize the cheap mono crop growers and tax the organic farms.  It needs to be the other way around or there will be no incentive to grow healthy varieties which become NATURALLY protected from disease and pests... ﻿", "time": "5 years ago", "author": "InvisiMan", "cid": "UgxPizmph0rb0u1Ir7p4AaABAg"},
{"text": "I'm not sure if you understand how modern farming works. The grains we grow get stored for YEARS before it's used... we always have excess and considering that close to 90% of what we grow goes to livestock, one bad crop will never be a disaster.  By diversity, I mean growing 100 varieties of potatoes, not just 3. Grow 500 varieties of apples, not just 5. That way, any single disease or infestation would only impact a very small percentage of the total we grow. Smart farming is better than GMO.﻿", "time": "5 years ago", "author": "InvisiMan", "cid": "UgwPIYA9uhfz8QYMR8F4AaABAg"},
{"text": "The potato famin was a disaster because the entire population relied on ONE CROP to survive... we need diversity and GMO crops don't bring that.  As for meat, it takes far more water and food calories to produce one pound of meat than it does just feeding the grains to people. Meat is the most inefficient source of protein and calories on the planet and is a confirmed ecological disaster.  GMO doesn't even help because it kills livestock and will kill us too! ﻿", "time": "5 years ago", "author": "InvisiMan", "cid": "UgxsRFBnYALzn1gUS3J4AaABAg"},
{"text": "Relying on mono crops is EXACTLY why GMO is dangerous - it removes the diversity in our food by creating single, patented crops controlled by a few companies. It would be a disaster to let GMO's rule. GMO's have the same risk for disease and they create new ones, like bugs which are resistant to pesticides.  Organic farming provides the safest, most nutritious foods around. We can also stop eating meat, as most of the crops we grow are sent to livestock and not people.﻿", "time": "5 years ago", "author": "InvisiMan", "cid": "Ugz8IzS2MRLRpZjajGZ4AaABAg"},
{"text": "1) Get rid of religion.\n2) Teach people about contraceptives.\n3) Watch them stop dying of hunger.\n\nIt's much easier than giving them a plant that has bacterial genes at random places in its genome and hasn't been thoroughly tested. By the way, 10 rats surviving a GMO diet isn't my idea of a thorough test.﻿", "time": "5 years ago", "author": "MD", "cid": "UgyPtZApW-9cq9kW3od4AaABAg"},
{"text": "I am sure Monsanto will say that we \"must\", but I fail to see why anyone would think that.﻿", "time": "5 years ago", "author": "MD", "cid": "UgwgKW3O5rTSKLl3BR14AaABAg"},
{"text": "This is completely false. GMO crops and animals have the potential to destroy the environment and health of everything it touches. Do you think \"terminator seeds\" is something we need in nature? Look up\"Company Charged for Covering Up Animal Deaths from GMO Corn\" and see how safe this food really is... ﻿", "time": "5 years ago", "author": "InvisiMan", "cid": "Ugw70gGqXGIESyVbZvZ4AaABAg"},
{"text": "Wally everywhere but North America.﻿", "time": "5 years ago", "author": "JohnBonhamSinger", "cid": "UgzUKuSJaKfoZfVPuXJ4AaABAg"},
{"text": "27 million to Monsanto... why not 27 million to organic or permaculture farming? You screwed up Bill...﻿", "time": "5 years ago", "author": "InvisiMan", "cid": "Ugxde5IpAmx00G8I7gN4AaABAg"},
{"text": "people always saying micrisoft only scams people\n\nremind me how many times apple used their revenue to eradicated entire diseases..﻿", "time": "5 years ago", "author": "Armathyx", "cid": "UgwbDaydMkb0KqRYojl4AaABAg"},
{"text": "who the fuck is bettman?﻿", "time": "5 years ago", "author": "TheMangubb", "cid": "UgwZDqKLYx1uW8NqcEx4AaABAg"},
{"text": "co ancle﻿", "time": "5 years ago", "author": "Doesnt Exist", "cid": "UgwXM11HdZcKLuVPK854AaABAg"},
{"text": "Stop thinking of bioengineering like it's something you saw in Resident Evil. Bioengineering and stuff like bionics, quantum mechanics or brain-machine interfaces are forming the future of our civilization.﻿", "time": "5 years ago", "author": "Paul-Sebastian Manole", "cid": "UgykGd9_YCjfXMCgYZZ4AaABAg"},
{"text": "The best of both worlds﻿", "time": "5 years ago", "author": "flosdraad", "cid": "UgznUEZXNxo8migTzFd4AaABAg"},
{"text": "0:09 co-ankle lol﻿", "time": "5 years ago", "author": "nikita9251", "cid": "UgzM_LV90MI3-JkfbZR4AaABAg"},
{"text": "Well said!﻿", "time": "5 years ago", "author": "Hanz van Aardt Old Account", "cid": "Ugw1l4yJxnR5Ixf0i2N4AaABAg"},
{"text": "He initially wanted to use his money to make Windows secure, fast, and bug-free. But then he realized that he had to set more realistic, achievable goals for himself. That's why he's now trying to eradicate all illnesses and free mankind from poverty, grief and suffering.﻿", "time": "5 years ago", "author": "Olaf Klischat", "cid": "UgxvwTOBbwTS9jDX9Zp4AaABAg"},
{"text": "I can agree!  I am very involved in the software industry and really did not like Bill Gates - now that he is focusing on his foundation I have come to love and respect him greatly!  What a wonderful life!  He ends with \"pick important stuff because you only have a limited time.\" - very true that!﻿", "time": "5 years ago", "author": "Hanz van Aardt Old Account", "cid": "Ugy7PGMWGkbZV-19HHt4AaABAg"},
{"text": "Yea. What a greedy man, to give away 95% of his money. Are you fucking stupid?﻿", "time": "5 years ago", "author": "Rynan", "cid": "Ugy-ucrHstHCbFurEJV4AaABAg"},
{"text": "Bill gates, you made me cry, wonderful humanbeing, god bless﻿", "time": "5 years ago", "author": "nitinpai77", "cid": "Ugw8h18W_t4moiLlMXR4AaABAg"},
{"text": "i Agree to your view point, humanity is the only thing which touches our core being﻿", "time": "5 years ago", "author": "nitinpai77", "cid": "UgxAEbTVUOMscUnYzu14AaABAg"},
{"text": "Coankle.﻿", "time": "5 years ago", "author": "Boniti1", "cid": "UgyESjHjfV8mVOgEr8t4AaABAg"},
{"text": "There would be nothing more interesting then to hear Bill Gates take on The Illuminati. ﻿", "time": "5 years ago", "author": "Kingzizeeee", "cid": "UgxMvkhIXC_OWBtYYKJ4AaABAg"},
{"text": "Nice guy :)﻿", "time": "5 years ago", "author": "LokiV", "cid": "UgyOceXWN-8qfGcgfrh4AaABAg"},
{"text": "This guy is poisoning your food and you say is better then bettman !?? also he want to reduce human population (is he God) whats wrong with you, every self concusses person on the planet knows that genetically modified food is BAD !!! If he like to save humanity, then he should give a cure of cancer and AIDS.\np.s. Never trust the main stream media!! Research the truth, do your own research, listen the ppl who had experience with GM food etc.etc\n/watch?v=Rml_k005tsU&feature=r­elated﻿", "time": "5 years ago", "author": "WhiteFrequencyNoise", "cid": "Ugyp1WpLtjxTHKSRGKp4AaABAg"},
{"text": "/watch?v=Rml_k005tsU&feature=related\n﻿", "time": "5 years ago", "author": "WhiteFrequencyNoise", "cid": "UgzPTfhsM7OijI-m3rF4AaABAg"},
{"text": "Why don't you like Bill Gates? Because he donates billions to charity? or because he a clinical genius? \n\nNo. Probably because you are really fucking stupid and hate anything that is good. You sir are a disgrace to humanity. If you dropped dead it wouldn't affect anyone, unlike this great man. ﻿", "time": "5 years ago", "author": "Alex Kowalski", "cid": "Ugz_W8boRukqNzTZpPR4AaABAg"},
{"text": "AND VERY GOOD AT COPY﻿", "time": "5 years ago", "author": "Boby Hunter", "cid": "UgyI78Tuj3RLqYj7rg14AaABAg"},
{"text": "OMG! I found Wally!!! 4:01﻿", "time": "5 years ago", "author": "Mucci Made", "cid": "Ugwxr7Zm_EcNNYeYuT14AaABAg"},
{"text": "@milesjohnmabynross what?!﻿", "time": "5 years ago", "author": "w wyborn", "cid": "UgzUcM-_ouh83p0plV54AaABAg"},
{"text": "Steve Jobs is the smartest human who ever existed =3﻿", "time": "5 years ago", "author": "Tovis", "cid": "UgxxCRQDAoJ8-vMrJFp4AaABAg"},
{"text": "Bill Gates is doing wonderful work. Carnegie donated his fortune to education. Money is a tool as both of these philantropists know. May you have a long life Mr. Gates.﻿", "time": "5 years ago", "author": "Edward Ruane", "cid": "UgxSTanaca1o4gdExQN4AaABAg"},
{"text": "gives money doesn't die young of cancer﻿", "time": "5 years ago", "author": "billuvill", "cid": "UgxwsKhqRJ4KctqVJvt4AaABAg"},
{"text": "yeah i really dont give a fuck i just wanted to see the richest mother fucker on the planet﻿", "time": "5 years ago", "author": "w wyborn", "cid": "UgyWiN3gm10ozqA7RY94AaABAg"},
{"text": "Genuinely, I do not see any difference! It seems that 'atheist' is an emotive word in America, but I cannot see the difference between atheist and agnostic. If there's no evidence for something, you cannot know, nor can you, honestly, believe. Agnostics cannot claim to believe in a god so they are the same as atheists. That's how it appears to me anyway but I am always open to argument!﻿", "time": "5 years ago", "author": "melancholiac", "cid": "UgxX6jdXi-SWo7T7MKN4AaABAg"},
{"text": "The guys using an ipad :3﻿", "time": "5 years ago", "author": "Inactive", "cid": "Ugw9HWJvRnvQMmxiLxt4AaABAg"},
{"text": "Atheist people don't believe in god, Agnostics like Bill Gates just don't give a shit.﻿", "time": "5 years ago", "author": "Diljot", "cid": "UgzEJwTkMbne9LVV9yF4AaABAg"},
{"text": "Like, there's a difference!﻿", "time": "5 years ago", "author": "melancholiac", "cid": "UgzHii-g-dJgsXiJHNh4AaABAg"},
{"text": "co ankle﻿", "time": "5 years ago", "author": "Jordan Santacana", "cid": "UgwCSSkzSLOTqW3nvG94AaABAg"},
{"text": "Agnostic not atheist.﻿", "time": "5 years ago", "author": "Diljot", "cid": "UgzxftJz6eJYVn13L494AaABAg"},
{"text": "I suspect he's trying to buy his way into heaven. I've seen Steve Jobs get emotional plenty of times. But I've never seen Bill Gates with other than a smirk. Granted, I'm glad of what he's doing, but God hope I am wrong and he's not doing it for the wrong reasons. He seems like a sociopath.﻿", "time": "5 years ago", "author": "Juan", "cid": "UgxB2mDR4mC4SJT19pt4AaABAg"},
{"text": "Ironic comment seeing as he is an atheist. See! You CAN do good without a god!﻿", "time": "5 years ago", "author": "melancholiac", "cid": "UgzZGhtFY6dreMAiWn14AaABAg"},
{"text": "I have a lot of respect for this man. He will always remain the richest man in the world. Not only monetarily but also empathically.﻿", "time": "5 years ago", "author": "FreeFromWar", "cid": "UgxtSu1czD6OldEkBQt4AaABAg"},
{"text": "besides the Monsanto bit I really like what he's doing. But Monsanto can go fuck itself. ﻿", "time": "5 years ago", "author": "waRr3nxx", "cid": "UgzuFw6YE-pkA8tmqiJ4AaABAg"},
{"text": "i see an iPad at 3:29 :P﻿", "time": "5 years ago", "author": "Matthias Krijgsman", "cid": "UgzR3jty30TXKULwUup4AaABAg"},
{"text": "... 'You only have limited time'. Those are some wise words!﻿", "time": "5 years ago", "author": "youme1414", "cid": "UgwpqTK5bUV_z6D_Fit4AaABAg"},
{"text": "BILL GATES FOR PRESIDENT!!!!﻿", "time": "5 years ago", "author": "Gouki6669", "cid": "Ugx2FKsy0Rs6u75rrSZ4AaABAg"},
{"text": "He thinks of malaria. You think of haircut.﻿", "time": "5 years ago", "author": "Noel Delfin", "cid": "Ugxj0i1RRFZeAXbtUgZ4AaABAg"},
{"text": "hahahaha﻿", "time": "5 years ago", "author": "Tugg Speedman", "cid": "UgzR17qHte9xmXiQBPV4AaABAg"},
{"text": "Stay classy San Diego.﻿", "time": "5 years ago", "author": "Tugg Speedman", "cid": "Ugz5uYDhce_xmuTGabl4AaABAg"},
{"text": "May Bill Gates live long ! Amin.﻿", "time": "5 years ago", "author": "Umer Farooq", "cid": "UgziiE75-NIB-jgQGX94AaABAg"},
{"text": "Pity there aren't many politicians like this great guy (and like Steve Jobs)﻿", "time": "5 years ago", "author": "Jez2008UK", "cid": "UgxlENKjddZjL8cjWfl4AaABAg"},
{"text": "Dark humor there at the end﻿", "time": "5 years ago", "author": "RushOrbit", "cid": "UgwAwuVWNLbhFyS5jhd4AaABAg"},
{"text": "You are speaking to somebody who have idea about generations of computer. Macintosh(now Mac) is a third generation computer introduced by Apple in 1984. I would quickly like you to know the pioneer is IBM not Apple as you are alluding to here. ﻿", "time": "5 years ago", "author": "youme1414", "cid": "UgwtcTgKI2zUIsGKBxB4AaABAg"},
{"text": "I'm a Mac guy but I have so much respect for Bill Gates﻿", "time": "5 years ago", "author": "neverwannaactmyage", "cid": "Ugz6vF8UvcLe33uurCF4AaABAg"},
{"text": "Republicans probably think the money would be better used re-invested into businesses. lol.﻿", "time": "5 years ago", "author": "TheArfdog", "cid": "Ugyo2XIjz0aIVesS2sJ4AaABAg"},
{"text": "Bill and Steve were mate's, they had fun together, why can't windows and osx users enjoy their own preference. and let someone else decide for themselves what they want to use. their both nice to use. for different purposes ﻿", "time": "5 years ago", "author": "Sam Ooms", "cid": "UgybymAA5hI2mGVpWKp4AaABAg"},
{"text": "What approach? Closeup approach? Mac is overblown out of proportion.﻿", "time": "5 years ago", "author": "youme1414", "cid": "Ugw5fn-Cqleyy3lucGl4AaABAg"},
{"text": "Bill Gates is my mentor!﻿", "time": "5 years ago", "author": "youme1414", "cid": "UgxbP2-L5X2w4nNBn6N4AaABAg"},
{"text": "what a nice guy... IM STILL A MAC ﻿", "time": "5 years ago", "author": "guynumber20", "cid": "UgwBOBI22Ikc0FM6WHx4AaABAg"},
{"text": "So because things are \"unnatural\" they shouldn't be done? I'm sick of this idea that because things aren't natural they are automatically bad for you. Yes, there may be some side effects of it that we don't know about yet; however, are possibly \"devastating\" unknown side effects worse than certain death?﻿", "time": "5 years ago", "author": "metalnick", "cid": "UgwUgYZ0b2oTH_mNB3p4AaABAg"},
{"text": "Bill Gates is pretty awesome, but you'd think one of the richest men in the world could afford a good haircut.﻿", "time": "5 years ago", "author": "metalnick", "cid": "UgyiaF0VTbb1JMp0vJ14AaABAg"},
{"text": "Why is it evil?﻿", "time": "5 years ago", "author": "metalnick", "cid": "UgzUP6P89gjAGEVdmpJ4AaABAg"},
{"text": "GMO = Giving Life to those who need it.﻿", "time": "5 years ago", "author": "Patrick Fox", "cid": "UgwRTWip3g_WukQxmE14AaABAg"},
{"text": "Good guy Gates: Know first hand how much of a douchebag Steve Jobs was, still talks of him politely ﻿", "time": "5 years ago", "author": "superspeeed", "cid": "UgyMKGcrg9XHGGvusal4AaABAg"},
{"text": "lol﻿", "time": "5 years ago", "author": "bjapan96", "cid": "Ugw-J5FwyBw1NT0jsNl4AaABAg"},
{"text": "and neither are trolls, yet I'm looking at one.﻿", "time": "5 years ago", "author": "Jontiac", "cid": "UgzlskNxeI8eemiNpMt4AaABAg"},
{"text": "Are you fucking kidding me, they just had to include he was a harvard dropout randomly at 3:00﻿", "time": "5 years ago", "author": "tom hanks", "cid": "UgzZkrwhNlShNg20VJl4AaABAg"},
{"text": "LOL at the inteviewer's ipad﻿", "time": "5 years ago", "author": "ishotguntrolls", "cid": "UgxFdJD6PWMbFVgqJOt4AaABAg"},
{"text": "Polios been eradicated in India but in about ten years %30 of the people will get cancer.﻿", "time": "5 years ago", "author": "websuspect", "cid": "UgyriWFS1EDK7_zfH9B4AaABAg"},
{"text": "fuck outta here.. he tryna give poor people genetically altered foods instead of investing his money into education for them and factories & jobs in these countries so they can receive a wage they can actually live on﻿", "time": "5 years ago", "author": "lordofthecxnts", "cid": "Ugzsf6Xh7GjtQnQTBXZ4AaABAg"},
{"text": "God bless him﻿", "time": "5 years ago", "author": "R1D1", "cid": "UgzpzM9mqPpu-3XZSJF4AaABAg"},
{"text": "@Felminem god isnt real﻿", "time": "5 years ago", "author": "bjapan96", "cid": "Ugz4sLjB4DAH7_MvyZV4AaABAg"},
{"text": "It's amazing the way people's v have changed of Bill Gates. During the 90's he was seen (typically) as super sludy typical it's-all-about-the-benjamins business man. He has truly shown us how great of a person someone can be when they realize what wealth they have and what it can do.\n\nI like to think (and know) that a lot of this must have come from his and Job's friendships. Particularly Job's hippy views.﻿", "time": "5 years ago", "author": "LanIost", "cid": "UgxS-gp2kwVc1sFYz5J4AaABAg"},
{"text": "He's sharing his bank account with the world. Donating and trying to bring an end to the things he could bring an end it. You definitely deserve the money and the fame. After he passes away, all that money is still going to be donated. I swear the world needs more like him. He's that type of guy that would steal drug money across a border just to donate it to those that need it.﻿", "time": "5 years ago", "author": "Zefoo", "cid": "UgyHYPz0_k-Eq5VbZ4V4AaABAg"},
{"text": "@Felminem he is not christian!﻿", "time": "5 years ago", "author": "IceaSmith", "cid": "UgzIcOo1benuQvphoql4AaABAg"},
{"text": "A big man. With a big heart. Gotta respect the man.﻿", "time": "5 years ago", "author": "Something SomethingSomething", "cid": "UgzwuSL0HvEWb6GqtFd4AaABAg"},
{"text": "Great man.﻿", "time": "5 years ago", "author": "Ashler", "cid": "UgxVZXrD2E9on4GdMn94AaABAg"},
{"text": "God Bless Bill Gates﻿", "time": "5 years ago", "author": "FEL", "cid": "UgwmkFGoCjGXNg4a0aJ4AaABAg"}]
