[{"text": "McAfee would blast his fake ninja ass﻿", "time": "4 days ago", "author": "Rich Token", "cid": "Ugxfz-eWevHeiWTkQAB4AaABAg"},
{"text": "With wealthy people its both not either or. We know how to have it all. It takes work and thinking.﻿", "time": "4 days ago", "author": "Kevin Doyle", "cid": "Ugwa-06BLIEhfwacSz94AaABAg"},
{"text": "A nice guy﻿", "time": "5 days ago", "author": "Mani Matter", "cid": "UgzUnXvlmqlyk2JOjeV4AaABAg"},
{"text": "Haha, some \"journalist\" put together buzz words to make nonsense title. :-) WIKIPEDIA: Samurai: \"\"those who serve in close attendance to the nobility\". Translated: \"Larry Ellison: Rich servant warrior of some city \"﻿", "time": "6 days ago", "author": "XUL", "cid": "UgwasPr-mza3NrTd_SR4AaABAg"},
{"text": "It doesn't matter how much money this man has at the end of the day, Ellison comes off as too egotistical to be somebody that is admired﻿", "time": "1 week ago", "author": "ThingsToDo", "cid": "Ugw7teuVfbF_eYhrCHN4AaABAg"},
{"text": "The guy wanted \"Dethrone\" Microsoft. Lmao!!﻿", "time": "1 week ago", "author": "mcdouble nopickle", "cid": "UgziB4_1vn9_93iJpr54AaABAg"},
{"text": "before dissing a college degree.....\n\ncheck how many of those billionaire dropouts relied on talent who are degree holders for the success of their companies﻿", "time": "1 week ago", "author": "Francis Egenias", "cid": "Ugz9WX5EfMPkPmlgt054AaABAg"},
{"text": "I have not seen this but I am very familiar with his Companies all the way back to SDL and the rest. I really don't know if he remembers me but I have definitely met him because he has been at my Desk a few times. I really can't Vouch for all that has been said in this review.But I very much remember him.Larry is definitely a very determined man for sure I have met him in person but can not Vouch for all that has been said.Thanks for sharing much of the History I do remember.Deb.✌️👍👌﻿", "time": "1 week ago", "author": "Debra Dukes", "cid": "Ugwuuy9gLaHGiy6SOWx4AaABAg"},
{"text": "He has great vision but could not see his mustache was a hot mess﻿", "time": "2 weeks ago", "author": "cee dee", "cid": "Ugx9cmelsLy83nvNR_V4AaABAg"},
{"text": "He just lost the America's Cup to the tiny little nation of New Zealand which produced superior software to Oracle, whose software sent their boat out of bounds twice, and the Kiwis produced much better designs. Their crew also had higher ethics than the Yankees who complained about the referees because the couldn't buy them like in the past. \nWhat a loser! I wouldn't trust his software to boil water.﻿", "time": "2 weeks ago", "author": "Ai Rui Sheng", "cid": "UgwJAc77VXC2vn1wXo54AaABAg"},
{"text": "Larry is a kinda muldane name  very few larrys make anything of there life this one is juts lucky he's no genuis.﻿", "time": "2 weeks ago", "author": "Ray Viking", "cid": "UgxgdlOcmRptHRHeFPB4AaABAg"},
{"text": "Anyone who turns $1200 into $150 billion is someone you should pay attention too﻿", "time": "2 weeks ago", "author": "Kevin Doyle", "cid": "UgzsoiFKrhueilKoqVh4AaABAg"},
{"text": "Oracle is Java.  Java crashes.﻿", "time": "2 weeks ago", "author": "Ididsubmititalready", "cid": "UgxGMB_96kdHH0rGqeh4AaABAg"},
{"text": "People who think outside the box are cool﻿", "time": "2 weeks ago", "author": "Kevin Doyle", "cid": "UgwcBUMKTWY8-UjrRCZ4AaABAg"},
{"text": "He's a psychopath.  Someone should punch him in the face.  Everyday!  For the rest of his parasitic existence.  It's comforting to read The comments that don't fawn over this asshole just because he's rich.  Character is 1 billion times more important than money.  What a cockroach.﻿", "time": "3 weeks ago", "author": "David Hume", "cid": "Ugx_D9dKNgHXQJrvUi94AaABAg"},
{"text": "What a fuck dickhead!﻿", "time": "3 weeks ago", "author": "Poppa Bear", "cid": "Ugzhvn_GU0dNHtWs8jh4AaABAg"},
{"text": "Jews suck dick them best. They do everything the best it can be done.﻿", "time": "3 weeks ago (edited)", "author": "GRANTFROM GOOLWA", "cid": "Ugxw6uMbxKs1U1S6x9p4AaABAg"},
{"text": "Who cares...﻿", "time": "3 weeks ago", "author": "GRANTFROM GOOLWA", "cid": "UgyA7H2bg3FpUe1AQv54AaABAg"},
{"text": "Larry was correct. IBM dos not believe in anything. When I started my business 40 ago   I purchased a computer and a cash register. Huge hard disks......to backup. Unfortunately the day of opening the computer and the cash register did not work together. BIG shame yo IBM.﻿", "time": "3 weeks ago", "author": "Nico Smeets", "cid": "Ugxyzmi-dGkyB7WaMzp4AaABAg"},
{"text": "Very unlikable person﻿", "time": "3 weeks ago", "author": "S Brooks", "cid": "UgzrVhA2cEy4D2jucJt4AaABAg"},
{"text": "I want meet Sir Lawrence﻿", "time": "4 weeks ago", "author": "Carmelo Patanè", "cid": "Ugy1CVSByvHbRGoNXzB4AaABAg"},
{"text": "he looks like littlefinger﻿", "time": "1 month ago", "author": "ilovechickennuggets '", "cid": "Ugy1F2JygkXgw6F6GqZ4AaABAg"},
{"text": "He has been always an ass whole and will stay an as whole.﻿", "time": "1 month ago", "author": "boykotgooglification", "cid": "UgwqqsCtXPGJ5dNhcXx4AaABAg"},
{"text": "hoolie??﻿", "time": "1 month ago (edited)", "author": "th3j4ckl3", "cid": "Ugx6wpVld5vxmC5NwZV4AaABAg"},
{"text": "What a dick﻿", "time": "1 month ago", "author": "proto", "cid": "UgxxDwz2hwztJVyULCZ4AaABAg"},
{"text": "I listened to the beginning and didn't want to hear any more. He sounds like a dick.﻿", "time": "1 month ago", "author": "A Nicol", "cid": "Ugzem3qfbLaL6mRp0Ed4AaABAg"},
{"text": "🤓﻿", "time": "1 month ago", "author": "renee c", "cid": "UgzVVjRoh2-r9NqwFY94AaABAg"},
{"text": "keanu reeves﻿", "time": "1 month ago", "author": "Shiva Nand", "cid": "Ugxmumto_xclVg_k91d4AaABAg"},
{"text": "I'm glad when he was young he made these mistakes. I personally feel that humble character at a young age goes well. Now Oracle is growing still today in its market without branching out into new markets. Microsoft, not so much.﻿", "time": "1 month ago", "author": "Avelx", "cid": "UgySOzT189uYri5MOGZ4AaABAg"},
{"text": "With that much money, you think he would have been able to do something about that face.﻿", "time": "2 months ago", "author": "Maafa 1619", "cid": "UgzAGKs0FE7wtYZUU4h4AaABAg"},
{"text": "ORACLE = One Rich Asshole Called Larry Ellison﻿", "time": "2 months ago (edited)", "author": "RHS", "cid": "UgyMxV3sJCYEeUYrxC54AaABAg"},
{"text": "He is basically a scumbag..﻿", "time": "2 months ago", "author": "kokalti", "cid": "UgyfXWslz46RR2FFpX14AaABAg"},
{"text": "From a Jewish womb!﻿", "time": "3 months ago", "author": "Aws al-Jashami", "cid": "UgzyKRntRXC5uv7oFj54AaABAg"},
{"text": "Most companies use Open-Source/Free databases like Postgres these days.  Oracle's database dominance peaked a while ago﻿", "time": "3 months ago", "author": "Peter Morrow", "cid": "Ugxg36921g-tpLOvX_14AaABAg"},
{"text": "R.I.P .. Sun Microsystems﻿", "time": "3 months ago", "author": "Helgan", "cid": "Ugzr_l7oULHmMPjV9hV4AaABAg"},
{"text": "Its funny I never knew about this stupid internet PC and now in 2017 its actually other companies who try to push this retarded idea. I want to OWN my stuff and I do NOT want to have all my data and computing power sit in the cloud controlled by some corrupt immoral company ready to get accessed by the NSA ... This idea that people should do their computing in the cloud, store all their stuff in the cloud is as bad today as it was back then. Obviously there are great uses for the cloud but not for a private persons doing basic computing and storage.﻿", "time": "4 months ago", "author": "Emily Rose", "cid": "Ugxg-fzI-pTt6fLVcc94AaABAg"},
{"text": "Wtf wrong is people, more dislike for Ellen Musk than this c******** sucker﻿", "time": "4 months ago", "author": "konjo habesha", "cid": "UgzNWdeft0lLpLrECI14AaABAg"},
{"text": "wow﻿", "time": "5 months ago", "author": "Gabriel Méndez", "cid": "UgzU7PyWG2hqS2fCkNx4AaABAg"},
{"text": "This guy is the jewish version of Bill Gates in the same way Henry kravis is a jew version of Warren Buffet. As transparent an example as you can get of the toxic attitude of jews toward the world...﻿", "time": "5 months ago", "author": "RightHonourable Zeus", "cid": "UggPGuwN3Zb5ongCoAEC"},
{"text": "Bill Gates looks pretty hot 10:42 (no homo)﻿", "time": "5 months ago", "author": "Tshepo Letlhare", "cid": "Ugg-QM2Hf6YRGHgCoAEC"},
{"text": "Same as Steve Jobs story. They pick one individual as the vissionary, the leader, the force of nature, and make thousands of developers who actually made the software disappear.\n\nThat's how they con us. They make us believe that history is made by \"great men\" and not by the masses and social forces.﻿", "time": "6 months ago", "author": "Carlos Paz Despierta", "cid": "UggNCOcQxC6t2ngCoAEC"},
{"text": "Hey, Larry... some of us had it a bit like you... but way f***ing harder.. I mean it's a lovely back drop... but it's pretty obvious to the World that you're just 'Vector' from dispicab... a sore loser, a bad owner, a false soldier, a house held item, even the people round him doubt him, the character of course, good luck with that youth fountain.. There's no money that can buy Time, and there's no money that can buy tomorrow, and so it doesn't matter what facial hair you wear, you're always gonna look like yesterday in every facet in every way, But I'll buy your product, it's working o.k for the most part.. 9/10 for your software development:).﻿", "time": "6 months ago", "author": "MrDoctorbudo", "cid": "UgjsINR5H3ihDXgCoAEC"},
{"text": "coloca a porra desses documentarios em portugues por favor﻿", "time": "6 months ago", "author": "marcos sousa", "cid": "Ugg4KWrh8nKT6XgCoAEC"},
{"text": "don't get me wrong but he purchased sun microsystems and thereby owning java and went overboard by suing google for customizing java compiler for android os, that was a total dick move﻿", "time": "6 months ago", "author": "Somey Namero", "cid": "UggAUYmT_20YZHgCoAEC"},
{"text": "This guy looks so much like an uglier Mickey Roarke﻿", "time": "7 months ago", "author": "justgivemethetruth", "cid": "UghCB9YCG-gfLngCoAEC"},
{"text": "Considering how Larry Ellison got his money, is it just me or is it suspicious that he's not richer than Bill Gates?﻿", "time": "7 months ago (edited)", "author": "tim cook", "cid": "UgikKCqP5V0ETXgCoAEC"},
{"text": "Well put goktug and ventende. That's good to keep in mind as we strive for that extra buck. I've often thought I'm just as happy with my little house , car and job as the billionaire. With his high maintenance wife houses and job or jobs. The key is to be content with what you have!﻿", "time": "7 months ago", "author": "heather gullion", "cid": "UggVAPnOokeIkngCoAEC"},
{"text": "and now google chrome has stop using java. he is not an inspiring role model﻿", "time": "7 months ago (edited)", "author": "Fez", "cid": "UggNrrzf_bpttngCoAEC"},
{"text": "This guy seems like he's a complete asshole.﻿", "time": "7 months ago", "author": "Germán Muñoz Carbajal", "cid": "UgjSdQprd1520ngCoAEC"},
{"text": "He is a cautionary tale.﻿", "time": "8 months ago", "author": "satyabir singh", "cid": "UghuRtcx9YUMV3gCoAEC"},
{"text": "All I have to say about this man is that he is a real loser. And if that was simply it, but being rich and being a loser is a real problem in the world.﻿", "time": "8 months ago", "author": "Paulo Constantino", "cid": "UggHLzD0anYZ83gCoAEC"},
{"text": "So he's a psychopathic liar. I hope he has many children. The world needs more people like him.﻿", "time": "8 months ago", "author": "John L", "cid": "UggfmRmx1XrK0ngCoAEC"},
{"text": "Heуyyy guys wаaatcccch Siliссon Valley onlineе hеere => https://twitter.com/3ba5cd1602af3e890/status/858504656573546496﻿", "time": "8 months ago", "author": "BarseLoNa OFFICIAL", "cid": "UggzT-aAZTglkngCoAEC"},
{"text": "its always the same story, the visionary and the techie, somehow the visionary always makes more money﻿", "time": "8 months ago", "author": "Andreas Achilleos", "cid": "UgjE4YCPCthdOXgCoAEC"},
{"text": "I would like a life where money was never an issue. A life where I never had to worrie about life's necessities. A safe and relatively new car, a home with no depth, good health and money to spend on things that gave me increased quality of life.  A life where I never had to work to make other people rich and the freedom to not work at all if so pleased me. Piece and happiness. However, I wouldn't like to be as rich as some of these moguls are. Honestly, it would add worries and anxiety to my mind, fear of loosing it all, having to maintain a massive income etc.﻿", "time": "8 months ago (edited)", "author": "ventende", "cid": "UgjeJ1Scsi444HgCoAEC"},
{"text": "ventende very well said 👌﻿", "time": "1 week ago", "author": "Debra Dukes", "cid": "UgjeJ1Scsi444HgCoAEC.8RcZCOarcLm8apP3pQxB3E"},
{"text": "I realized it, Silicon Valley's Gavin Belson is Larry Ellison.﻿", "time": "8 months ago", "author": "Dan Vasquez", "cid": "UghHEnC_a8trL3gCoAEC"},
{"text": "he sounds like the biggest fucking asshole in the world﻿", "time": "8 months ago", "author": "Allen A", "cid": "Ugid9CZ9oOrlhHgCoAEC"},
{"text": "Money will make you more of what you really are. If you are an asshole it will make you a bigger asshole, if you are a good person deep down it will make you an even better person. \n\nThis guy is an asshole!!﻿", "time": "8 months ago", "author": "Richie Carbone", "cid": "Ugg9xvpY3lKB1HgCoAEC"},
{"text": "100%﻿", "time": "8 months ago", "author": "Paul Olivier", "cid": "UgjdCs13NPSYM3gCoAEC"},
{"text": "O ne\nR ich\nA sshole\nC alled\nL arry\nE llison﻿", "time": "9 months ago (edited)", "author": "NESherv", "cid": "UghxlPIDKnS7MHgCoAEC"},
{"text": "This is thee niceist movieee i ever see!!! I adviseeee everybody too watch it :) https://twitter.com/2b325b39a6ad4fdb6/status/824453837792567296﻿", "time": "9 months ago", "author": "Ánh Tuân Đẵng Nguyên", "cid": "UgjfJ3HPhAkFV3gCoAEC"},
{"text": "Fuck Larry Ellison.﻿", "time": "9 months ago", "author": "Dman40000", "cid": "UgjjBwy-qYjZUXgCoAEC"},
{"text": "he seems to have alot of personal issues.﻿", "time": "9 months ago", "author": "xBrOwNeDoG", "cid": "UgiEug6Qfwhk0HgCoAEC"},
{"text": "I like his drive. But he sounds like an ass to work with﻿", "time": "9 months ago", "author": "Patrick Luy", "cid": "UggNZ9ro64MTUngCoAEC"},
{"text": "I recently met an employee from Oracle last week, and according to him Oracle is a very cut throat company and only cares about sales. Not so much about the end client.﻿", "time": "9 months ago", "author": "prisoneroftech", "cid": "UghhU0sFcBMIK3gCoAEC"},
{"text": "well that guy is just a dick﻿", "time": "9 months ago", "author": "Moist ApplesTM", "cid": "UghtHEPLShy9_3gCoAEC"},
{"text": "JUST LEARN\n\n•Be tenacious, never give up on anything\n•Make the customer believe you're going to change their life with your product.\n•Can't be successful unless you lie to customers. \n•Take no prisoners and do not share the market. \n•Crush your competition. \n•Be #1 in everything, even amongst your own team. \n•Hire a professional to help your company if need be. \n•Acquisitions bridges gaps and can make your product better. \n•Keep your tenacity in the face of challenges and don't let it stop progress. \n•Invest what it takes to innovate, grow, better and win.\n•Invest in where you are behind\n•Have vision\n•See how the world can be and make it that\n•With sheer force of will and persuasion, \nyou can start with just a small stake in a company and build it into one of the biggest companies in the world.﻿", "time": "9 months ago", "author": "Joey Sparetti", "cid": "UgjrUUU8NqAJuHgCoAEC"},
{"text": "Very, very interesting﻿", "time": "9 months ago", "author": "Joey Sparetti", "cid": "UgiSgEkgwtzPUngCoAEC"},
{"text": "Sounds like a smart, rich, prick.﻿", "time": "9 months ago", "author": "CyclingSJH", "cid": "UgiYEpiUd55KKXgCoAEC"},
{"text": "The guy is a complete asshole and a huge cunt. He is evil and got huge psychological problems. A waste of humanity and a pitiful, sad example of a vicious gay person locked up in a closet﻿", "time": "9 months ago", "author": "navidski", "cid": "Ugg8DQJCxUYC8XgCoAEC"},
{"text": "Here's how fucking bad it is to work for Oracle. I was once negotiating a deal with an Oracle sales rep for some DB licenses.\n\nI get a call the next day from ANOTHER Oracle sales rep saying he can give me a better deal than his colleague.\n\nThink about that for a second. One Oracle sales rep was trying to steal a client from his own fucking colleague. I asked and it seems this is totally tolerated (and some say encouraged) in the Oracle corporate culture.\n\nWhat a fucking dumpster fire that company is. I hope they go broke.﻿", "time": "9 months ago", "author": "Sturgeon", "cid": "UgiZOpoe6g8ml3gCoAEC"},
{"text": "Single-handedly responsible for crushing thousands of innovations through patent trolling and lawsuit bullying... Oracle's products are OUTRAGEOUSLY shitty, riddled with bugs and security holes, and the support you will get (which they force you to pay for, by the way) is absolutely useless.\n\nYet they still continue to make billions of dollars because if you so much as dare to make a competing product they will send their gargoyles in Italian suits after you... or if you're lucky they will just buy you out just so they can throw your innovation into the garbage the next day.﻿", "time": "9 months ago", "author": "Sturgeon", "cid": "Ugjym6uXQU4Xl3gCoAEC"},
{"text": "i dont like this billionaire﻿", "time": "9 months ago", "author": "Jabulani Phakathi", "cid": "UgzOlOli7-HU-TIpwZJ4AaABAg"},
{"text": "reminds me of Frank Underwood :D﻿", "time": "9 months ago", "author": "Bj Penn", "cid": "UgxXiJYkGIV-68ydSht4AaABAg"},
{"text": "Think like a winner. Be a great CEO. Get big money. Start your startup today. https://about.me/buydomains﻿", "time": "9 months ago", "author": "SpaceTravelCapital.com", "cid": "UgwyjvF5CwgIZOeQLGR4AaABAg"},
{"text": "asshole jerk﻿", "time": "9 months ago", "author": "QB Jersey", "cid": "UgxkK5GfsJTMtK_XOQ14AaABAg"},
{"text": "I hate Oracle so much.﻿", "time": "9 months ago", "author": "Nat Bradz", "cid": "UggsfVosV5Pk_HgCoAEC"},
{"text": "http://www.ebay.com/itm/122390184707?ssPageName=STRK:MESELX:IT&_trksid=p3984.m1555.l2649﻿", "time": "10 months ago", "author": "Buff Babcock", "cid": "UgjsLIlW104YMngCoAEC"},
{"text": "The description of Ellison appears to be a very strong fit for Robert D. Hare's psychopath checklist. \n\nAnd of course his success and big break came from Project Oracle funded by the CIA. Government funded in other words. Just like all the technology in the PC, the Internet, and the office automation tools built at Berkeley labs in the 70s and stolen by Steve Jobs and Bill Gates in the 80s.\n\nAll of the basic and fundamental research over many decades that is now starting to move robotics into mainstream products has been developed in government labs in the US and Europe. \n\nBut the profits and the returns will be going to psychopaths like Ellison.\n\nFortunately, at least for now and some decades to come, men like Ellison will still die.﻿", "time": "10 months ago (edited)", "author": "myroseaccount", "cid": "UghifMG6Q3mn_3gCoAEC"},
{"text": "reptile.﻿", "time": "10 months ago", "author": "Bongo Charm", "cid": "Ugi1JQxHH_GwvngCoAEC"},
{"text": "Hes obviously an intelligent and a visionary but hes likely to be a dickhead﻿", "time": "10 months ago", "author": "Tyne Gold", "cid": "UghNHFsWqU1GiHgCoAEC"},
{"text": "please sir  help me  my house was burn on nov 13 2016 . its to small  but no money to re build  i have work but cannot  aford im from the philippines .please reply.﻿", "time": "11 months ago", "author": "Bart Simpsons", "cid": "UgjS7MJFzHbirHgCoAEC"},
{"text": "Damn. This guy is crazy.... crazy ambitious. Lol. Wish there were more people like him nowadays.﻿", "time": "11 months ago", "author": "Patrick Luy", "cid": "UggqlySC1sNLgHgCoAEC"},
{"text": "I wonder when will average people realize these are PAID-FOR SELF PROMOTING clips and NOT REAL DOCUMENTARIES, commissioned by narcissistic douchebags like this overhyped former DoD cuckold imbecile, who looks like a resentful bastard of some high school girlfriend who left him because he beat her too much. Larry Ellison is not, as wikipedia claims, the inventor of SQL nor his work is really that relevant. He was just incredibly well connected.﻿", "time": "11 months ago (edited)", "author": "Serious Joker", "cid": "UghLBm4Qdb8BMXgCoAEC"},
{"text": "you're adopted dude\n\n\n\n\n\n\n\n\nroasted﻿", "time": "11 months ago", "author": "AwesomeJackify", "cid": "UgjfxJTgBB7S0ngCoAEC"},
{"text": "What a depressing, boring documentary. Makes you appreciate Steve Jobs that much more. Ellison must have the smallest penis in the world﻿", "time": "11 months ago", "author": "rmiddlehouse", "cid": "Ugg16mn4kU25IHgCoAEC"},
{"text": "Both have floppy wieners. Appreciate Jobs why? Because of taking credit for other people's talent? Because of  being, himself embodied, one of the biggest PR stunts and emotional con jobs in history? Do you really know how much intellectual property Apple stole? Do you know how little Jobs was actually connected to the design and conception of those products you love so much, you know, beyond the fairy tales publishing n media has made us swallow? Jobs didn't create squat. He was brought in by Apple's smart board to promote a product that was actually already under development when they got him back in office. Everything about him is a lie.﻿", "time": "11 months ago (edited)", "author": "Serious Joker", "cid": "Ugg16mn4kU25IHgCoAEC.8Nj5whVN9DA8OARqUSPA1H"},
{"text": "hmmm the nc maybe the seed to steve jobs w the iphone and ipad...?﻿", "time": "1 year ago", "author": "Kevin Parsley", "cid": "UgiHm1Zd3Xf9P3gCoAEC"},
{"text": "16:43 When he perfectly summs up the idea of a chrome book lol﻿", "time": "1 year ago", "author": "Leonardo Moretti", "cid": "UgguQJf4YyowOngCoAEC"},
{"text": "with the best way for me to you by my friend and would like to see you soon as possible to get a chance my phone. it has been sent from  games baa﻿", "time": "1 year ago", "author": "bhh miss", "cid": "UggW405-kFTnd3gCoAEC"},
{"text": "with the best way for me to you by my friend and would like to see you soon as possible to get a chance my phone. it has been sent from Germany. deutsch. du mit kommest ien deutschland .games baa﻿", "time": "1 year ago", "author": "bhh miss", "cid": "UggbifPXFwNe2ngCoAEC"},
{"text": "with the best way for me to you by my friend and would like to see you soon as possible to get a chance my phone. it has been sent from Germany. deutsch. du mit kommest ien deutschland .games baa﻿", "time": "1 year ago", "author": "bhh miss", "cid": "UgjJDYjUMnapXXgCoAEC"},
{"text": "I read Softwar quite a while ago. He's just as impressive as the other architects (Gates, Jobs, Moore, Wozniak, etc...). His ego is too big, though. I think the whole minimalist Japanese fetish is a way to compensate/balance everything out.﻿", "time": "1 year ago (edited)", "author": "Shawn Gunnison", "cid": "UgidI1z1cu4uqHgCoAEC"},
{"text": "PS: His concept of internet driven thin clients were way too optimistic. Out of tune with net speeds. Imagine hundreds of thousands of clients running on an ISP. Not enough bandwidth............ and he conceptualized this when we were running primarily on dial-up. No thanks, Larry.﻿", "time": "1 year ago", "author": "Shawn Gunnison", "cid": "UgidI1z1cu4uqHgCoAEC.8Lhk4WWi6tQ8LhljG81mJV"},
{"text": "Can he buy the 49ers since he will do whatever it takes to win.﻿", "time": "1 year ago", "author": "Revolution925", "cid": "UgjYkYvv8FOkAXgCoAEC"},
{"text": "my dad knows Larry Elison he used to work at oracle﻿", "time": "1 year ago", "author": "slime strawberrii", "cid": "Ughztx1Jm4Ox4ngCoAEC"},
{"text": "Hike de reeee ba﻿", "time": "1 year ago", "author": "shaik khaleequddin", "cid": "Uggqa1lRS3RG9ngCoAEC"},
{"text": "Seems like a dick but he knows what is going on with his software and has the market by the balls. Now on a mass scale so he has leverage to lower costs. Ez win Ez life﻿", "time": "1 year ago (edited)", "author": "BOOM ERANG", "cid": "Ugjyz2EF5YxWWXgCoAEC"},
{"text": "Does he have any eyebrows?﻿", "time": "1 year ago", "author": "Cyqnide", "cid": "Ugh6s6hW-MwnSXgCoAEC"},
{"text": "Just few people have Larry Ellison'$ confidence, creativity, fearlessness n leadership....now ich understand he'$ Steve Jobs best friend﻿", "time": "1 year ago", "author": "Amazing Titicaca", "cid": "UgjXk8b74VTDVngCoAEC"},
{"text": "How is there nothing in here about Marc Benioff and Salesforce.com﻿", "time": "1 year ago", "author": "Paul P", "cid": "Ugjc3Y7fglnyxHgCoAEC"},
{"text": "wow, never realized his passion with the internet before it really took off. he was 20 years ahead of his time on netbooks. unfortunately the internet wasn't as powerful as it is today to achieve the dream that he had.﻿", "time": "1 year ago", "author": "Tom Messig", "cid": "UgjJQ_Fmu1Iqx3gCoAEC"},
{"text": "Larry must change part of his motto. Have we forgotten Steve Jobs?﻿", "time": "1 year ago", "author": "Poorbabyboomer Poorbabyboomer", "cid": "Ugjv6QS_H8mEKHgCoAEC"},
{"text": "He was very much like Steve Jobs, only in many ways, better, and came along before Jobs. There are positives and negatives of Ellison, but he doesn't get his due.﻿", "time": "1 year ago", "author": "SkylineToTheSeaAndMe", "cid": "Ugjv6QS_H8mEKHgCoAEC.8JXpYrx-LNF8Jva1pgO7_w"},
{"text": "The tough life of a billionaire must be rough😉﻿", "time": "1 year ago", "author": "Affiliate Marketing Training", "cid": "Uggci6-difQ7AHgCoAEC"},
{"text": "this guy is impressively ruthless .... his resting bitch face is unapologetic..﻿", "time": "1 year ago", "author": "Lety Jay", "cid": "Ugh0i6dvfBpSF3gCoAEC"},
{"text": "Yeah, he was a known local creep for years.  Oracle was known as Whoracle for years.  They'd sell add-ons to databases people didn't have.  Shit like that...﻿", "time": "1 year ago", "author": "J Doe", "cid": "Ugh0i6dvfBpSF3gCoAEC.8J1h7AslBfW8MNiIFwkhiL"},
{"text": "Тhis mоviе is nоw аvаilаblе tо wаtсh herе => https://twitter.com/2b6f5fe6f175bcda2/status/824453837792567296                                              Lаrry Еllisоn  Billiоnаirе Sаmurаi Wаrriоr оf Siliсоn Vaalleуууy﻿", "time": "11 months ago", "author": "arlesson ayzen", "cid": "Ugh0i6dvfBpSF3gCoAEC.8J1h7AslBfW8OF-IqGWlQj"},
{"text": "\"he saw bill gates as a enemy but bill gates did not see him that way\"!! XD ....he just seems to be such a immature person who has ambitions way bigger than his capacity, i mean such a puny person trying to beat bill gates is like a high schooler trying to win over john cena!!!﻿", "time": "1 year ago", "author": "Vedant kale", "cid": "Ugh1lnrKQo6_w3gCoAEC"},
{"text": "he's an ass... pure and simple﻿", "time": "1 year ago", "author": "Doren Garcia", "cid": "UgjTS7bFOPUrwXgCoAEC"},
{"text": "price of the success﻿", "time": "1 year ago", "author": "Umberto Fournier", "cid": "Ughk1U5-0mTqnngCoAEC"},
{"text": "my best\n frand﻿", "time": "1 year ago", "author": "bhh miss", "cid": "UghGYI9j9f8xr3gCoAEC"},
{"text": "In the Sydney Hobart race, when things went pear shaped, he was a sniveling coward.﻿", "time": "1 year ago", "author": "BenjaminFranklin99", "cid": "UghFS6BfleFXPHgCoAEC"},
{"text": "Mumma.. I am scared :)﻿", "time": "1 year ago", "author": "ankit singh sengar", "cid": "Ugjn0pGn5OWcUngCoAEC"},
{"text": "Seems IBM didn't want to become a CIA assett.﻿", "time": "1 year ago", "author": "Bram Govers", "cid": "UghjXJKzXdWEEHgCoAEC"},
{"text": "No, that might be true, but for many decades (60s, 70s, 80, 90s,), many IBM execs back east (Armonk, White Plains), made terrible business decisions. They didn't trust engineers in Silicon Valley, or elsewhere, to run with their ideas, concepts, etc. Perhaps they didn't understand them. But they were terrible \"top down\" managers, executives, CEOs, etc. They enabled a massive pension and health insurance scandal (maybe out of personal greed) which almost caused the death of IBM in the 1980s. This was maybe the only reason Oracle exists, and IBM lost hundreds of $Billions to Oracle as a result.﻿", "time": "1 year ago", "author": "SkylineToTheSeaAndMe", "cid": "UghjXJKzXdWEEHgCoAEC.8H_aPGgqqvA8JvaktPV940"},
{"text": "I don't disagree with your analysis.﻿", "time": "1 year ago", "author": "Bram Govers", "cid": "UghjXJKzXdWEEHgCoAEC.8H_aPGgqqvA8K3ad7ubZhw"},
{"text": "tenho 50 anos de pobreza.\nmeus  momentos serão de um real milagre﻿", "time": "1 year ago", "author": "Cezar Monteiro", "cid": "UghFfKcTt9xnMHgCoAEC"},
{"text": "Don't you thing Larry's idea  of network computers resembles cloud computing?﻿", "time": "1 year ago", "author": "Muhammad Allaudin", "cid": "UggDvbB9eXRTTHgCoAEC"},
{"text": "bo mp4 for $1,000,000,000,000,000.00 at 3010 ryan jay drive 738, charlotte, nc﻿", "time": "1 year ago", "author": "Bo Bo", "cid": "UghaDGZynNRc5ngCoAEC"},
{"text": "The Japanese poisoned him, he became ruthless when he talked to that exec.﻿", "time": "1 year ago", "author": "Andrew Gilmore", "cid": "UghZidoAptZIZ3gCoAEC"},
{"text": "russ hannaman ?﻿", "time": "1 year ago", "author": "ss ss", "cid": "Ugi0fgaALAbRTXgCoAEC"},
{"text": "Jewish documentaries.﻿", "time": "1 year ago", "author": "intel inside", "cid": "UggxdGGvNXZRHngCoAEC"},
{"text": "& ?﻿", "time": "1 year ago", "author": "magna59", "cid": "UggxdGGvNXZRHngCoAEC.8Fcu4mMBEMU8Fsebb3yxqt"},
{"text": "The man with the gold has power and control.﻿", "time": "1 year ago", "author": "Poorbabyboomer Poorbabyboomer", "cid": "Ugg9r4Am5onEb3gCoAEC"},
{"text": "The man with the gold has power and control. Go Ellison﻿", "time": "1 year ago", "author": "Poorbabyboomer Poorbabyboomer", "cid": "UgjZCKDE1dHYBHgCoAEC"},
{"text": "Might his software be ugly, culture cruel or his personality possessive, we can't deny that boat was pretty smooth.﻿", "time": "1 year ago", "author": "UserHuge", "cid": "Ugjy1RLBs08AlHgCoAEC"},
{"text": "All of the people who are in these Bloomberg documentaries are Jewish. Weird...﻿", "time": "1 year ago", "author": "B Q", "cid": "UggC-vrK-L0sgngCoAEC"},
{"text": "He is 71? Looks like 50. Being a billionaire I wonder if he has a chamber below his mansion, where he extracts the tears of children, and has them fed intravenously into himself to stay young?﻿", "time": "1 year ago", "author": "daweller", "cid": "UghXurhG9Wxnq3gCoAEC"},
{"text": "Considering his aggresive approach and close ties with the CIA - you might not be far from the truth.﻿", "time": "1 year ago", "author": "Znu Dzony", "cid": "UghXurhG9Wxnq3gCoAEC.8EeOq9I9he48GyN5nVUOuX"},
{"text": "Larry is old news.Now it's all about the Google guys, Face Book guy and Elon Musk!﻿", "time": "1 year ago", "author": "bigart1993", "cid": "UggSDpwjXG2wQXgCoAEC"},
{"text": "I'm thrilled that Google kicked Oracles' non-producing ass.﻿", "time": "1 year ago", "author": "Jeff Oloff", "cid": "UgjHPQ7sddgsvngCoAEC"},
{"text": "I wonder if it's his frustration with his closet homosexuality that has driven him to be such a vicious business man.﻿", "time": "1 year ago", "author": "master cobra", "cid": "Ugin105KQYbVM3gCoAEC"},
{"text": "very true﻿", "time": "1 year ago", "author": "Jay Shinwari", "cid": "Ugin105KQYbVM3gCoAEC.8ETkgMn0Rx08EqJREIYVCg"},
{"text": "+master - and one of the ugliest humans on the planet.﻿", "time": "1 year ago", "author": "RUSSIAN ROBOT", "cid": "Ugin105KQYbVM3gCoAEC.8ETkgMn0Rx08Ev9Oak4znU"},
{"text": "Ellison ' address  please!﻿", "time": "11 months ago", "author": "Louis Celentano", "cid": "Ugin105KQYbVM3gCoAEC.8ETkgMn0Rx08OMbnX2vTcX"},
{"text": "Í want to write to him.﻿", "time": "11 months ago", "author": "Louis Celentano", "cid": "Ugin105KQYbVM3gCoAEC.8ETkgMn0Rx08OMbxdO27tY"},
{"text": "Ciao﻿", "time": "11 months ago", "author": "Louis Celentano", "cid": "Ugin105KQYbVM3gCoAEC.8ETkgMn0Rx08OMc0pZf0OJ"},
{"text": "i'm sure they make top money in Oracle.. thye just need to sue everyone around.. ahaha fuckers, but against google and Android He didn't have a chance..  suck balls﻿", "time": "1 year ago", "author": "Nereus", "cid": "UggJO5_Bsy4g63gCoAEC"},
{"text": "evil inspiration.﻿", "time": "1 year ago", "author": "Nikhil Parki", "cid": "Ugjd-dO5-DRhUXgCoAEC"},
{"text": "All Ellison is is an egotistical guy. Might have those billions but he comes across as a complete arrogant knob. The main reason he 'loved the internet' is because it would negatively impact Microsoft's strangle hold which would be great for him because he could swoop in and try take that hold over. Just to be wealthier then Gates. So whats more important to Larry, changing the world or more money?﻿", "time": "1 year ago", "author": "JMC RSA", "cid": "Ugg1dsTbwG3nMXgCoAEC"},
{"text": "looks like Tony Starks.......... iron man﻿", "time": "1 year ago", "author": "Mark Lopez", "cid": "UgjadDAqw_kUcXgCoAEC"},
{"text": "I'm guessing this is the inspiration for Gavin Belson﻿", "time": "1 year ago", "author": "AJBfc", "cid": "UgiI-_-iGGriXngCoAEC"},
{"text": "+AJBfc Him and the founders of Google. Also a huge fan of Silicon Valley. The New seasons really good.﻿", "time": "1 year ago", "author": "Benjamin Lopez", "cid": "UgiI-_-iGGriXngCoAEC.8DY7nsZSFjc8DbUmV9DbcZ"},
{"text": "I think the inspiration was more so on the founders of google. Silicon valley modeled Hooli's office's after google.﻿", "time": "1 year ago", "author": "Schmuck", "cid": "UgiI-_-iGGriXngCoAEC.8DY7nsZSFjc8HFWZL5reuz"},
{"text": "Benjamin Lopez hhh﻿", "time": "9 months ago", "author": "ahmad", "cid": "UgiI-_-iGGriXngCoAEC.8DY7nsZSFjc8RFHt71lB8q"},
{"text": "This guy looks like Mickey Rourke.﻿", "time": "1 year ago", "author": "JayGatzVFXsk8r", "cid": "UgjN43jMiY0jXHgCoAEC"},
{"text": "He seems like a prick.﻿", "time": "1 year ago", "author": "Do Bo", "cid": "UgiWD3hw6GuMEXgCoAEC"},
{"text": "i hope he goes extinct. selfish bastard﻿", "time": "1 year ago", "author": "My other profile", "cid": "Ugg3286qor5DtngCoAEC"},
{"text": "An amazing story. I didn't know about this. I just starting transitioning from typewriters to computers. I worked with the govt and saw a change coming, I'm glad he made it possible for someone like me to operate since I too wasn't in to formal education.﻿", "time": "1 year ago", "author": "Betty Bourne", "cid": "Ugi_1BQMNhJSmngCoAEC"},
{"text": "Oracle, at least the Oracle ERP, sells because of their strong marketing.﻿", "time": "1 year ago", "author": "Shashank Rathi", "cid": "Ugis_9YlnaGkD3gCoAEC"},
{"text": "I'm addicted to business.....help!﻿", "time": "1 year ago", "author": "German Shepherd", "cid": "Ughv3GG1b0OFqXgCoAEC"},
{"text": "D I V E I N B A B Y﻿", "time": "1 year ago", "author": "Ryan M", "cid": "Ughv3GG1b0OFqXgCoAEC.8CunapLxC0R8FtkMUPX0LE"},
{"text": "He has got everything the fastest but  10 times slower Database than SAP's HANA......!!! He had already seen Oracle's grave before his grave...!!!﻿", "time": "1 year ago (edited)", "author": "Thangamuthu Ramasamy", "cid": "UgjY_zgCM0lwYXgCoAEC"},
{"text": "What's his husband's name?﻿", "time": "1 year ago", "author": "tedGEGI", "cid": "UghDZW4ufbEYCngCoAEC"},
{"text": "Actually, he is 4X married and currently divorced. But, his adult kids are very successful, big time Hollywood producers.﻿", "time": "1 year ago", "author": "Rodrick Colbert", "cid": "UghDZW4ufbEYCngCoAEC.8Cg7s17Hi7P8Gy5nfw-d_j"},
{"text": "he runs a successful company. can individuals comment that enjoyed working there? what are the pros of the culture?﻿", "time": "1 year ago", "author": "Patrick Wright", "cid": "UgiVbFKW8TIq03gCoAEC"},
{"text": "If anyone knows where to find the link for the Charlie Rose Larry Ellison interview of 1996 at 13:08 please comment with the link over here.﻿", "time": "1 year ago", "author": "Sohail Rao", "cid": "Ugh58rZH5ClzrngCoAEC"},
{"text": "How about being # 1 in finding  a cure for cancer instead of wasting all that money on a fucking boat! you wish you were like Bill Gates you prick!﻿", "time": "1 year ago", "author": "Jorge Lopez", "cid": "UghbnV63Fr4OP3gCoAEC"},
{"text": "+Jorge Lopez Oracle Heath Sciences is doing its part.  And without software from companies like Oracle (whether run by a megalomaniac or not) cancer research would have to be done with sticks and stones (and maybe a microscope if they could afford it)--not very effective.﻿", "time": "1 year ago", "author": "Timothy Roper", "cid": "UghbnV63Fr4OP3gCoAEC.8CO7apWQvfz8CXyt4AoGrn"},
{"text": "Ellison is an asshole indeed. But Gates is worse, far worse, man.﻿", "time": "4 months ago", "author": "A Cool Name", "cid": "UghbnV63Fr4OP3gCoAEC.8CO7apWQvfz8XQjQvYmGvk"},
{"text": "he's only famous because he helped the CIA.﻿", "time": "1 year ago", "author": "aquarius", "cid": "UggQP_wkGQMU53gCoAEC"},
{"text": ":)   :)   :)﻿", "time": "1 year ago", "author": "puneeth shivalingaiah", "cid": "UgizO0wB6UCmQ3gCoAEC"},
{"text": "oracle had power only on databases now with apache hadoop it is lost. open source will collapse the oracle. only thing keeping oracle alive is their ERP software and t heir legacy database servers.﻿", "time": "1 year ago", "author": "Ugur Yardimci", "cid": "UgjA5KDrTMavAHgCoAEC"},
{"text": "Sounds like the guy from the movie The Island! I wonder if he has a clone.﻿", "time": "1 year ago", "author": "Freedom Justice", "cid": "Ugjj-jUWrTWrjngCoAEC"},
{"text": "He is good﻿", "time": "1 year ago", "author": "Raj Shukla", "cid": "UgjxCWGgpniKkXgCoAEC"},
{"text": "LOL this is what america thinks is gonna get for president... a successful business man.,\nwhen instead they are only gettin..well... Trump.﻿", "time": "1 year ago (edited)", "author": "mstrkush", "cid": "Ugj770Jr-zozVHgCoAEC"},
{"text": "Blows his money on toys where Bill Gates fights diseases. Greatness isn't in just numbers($) and he didn't even win there. Enjoy not being number #1 in multiple ways, you cunt.﻿", "time": "1 year ago", "author": "chris kawahito", "cid": "UgheKH_Q_h62hXgCoAEC"},
{"text": "Bill is a eugenicist! He is killing people with his drugs to depopulate the planet.﻿", "time": "1 year ago", "author": "Melech Henderson", "cid": "UgheKH_Q_h62hXgCoAEC.8BjyNh1PrsI8DGAZlrHBHq"},
{"text": "this is Obamas buddy he stays on his compound in Palm Springs and plays his private golf course a couple of times a year, so he comes by his assholeness from him...just saying,Obummer bags on the 1% ers but wait if they have a private golf course..oh well﻿", "time": "1 year ago", "author": "frequentflyer", "cid": "UghvOopd_wFA4HgCoAEC"},
{"text": "I am proud to be an Oracle DBA.﻿", "time": "1 year ago", "author": "Vizaam", "cid": "UgiKvoc-KRu4qHgCoAEC"},
{"text": "+visam We're rootin' fer ya!﻿", "time": "1 year ago", "author": "DataWaveTaGo", "cid": "UgiKvoc-KRu4qHgCoAEC.8BXXQEFV0hm8BptiW1y32P"},
{"text": "Anyone that has visited the campuses of all the major players in silicon valley recognizes the differences in cultures. Oracle's campus gives off a real corporate vibe, and full of fear. I'd never want to work there and that's after one day on their campus.﻿", "time": "1 year ago", "author": "Leggo My Ego", "cid": "UghB0FXANmf8QXgCoAEC"},
{"text": "That's  because they originated from CIA﻿", "time": "1 year ago", "author": "Znu Dzony", "cid": "UghB0FXANmf8QXgCoAEC.8BG7zStqMOg8GyNCJGI7ZP"},
{"text": "Zippy﻿", "time": "1 year ago", "author": "John Doe", "cid": "UgityRXJbDFF0HgCoAEC"},
{"text": "400 million spent on boat racing? Give that shit to Elon Musk and he'll advance this piece of shit humanity another 50 years with a kick in its lazy ass.﻿", "time": "1 year ago", "author": "Groaznic", "cid": "UghA7MN7fICJAXgCoAEC"},
{"text": "Elon has 10billion. He's not an American, but he's the first person and only person in America to ever make two companies that are worth billions.﻿", "time": "1 year ago", "author": "Nathaniel News Network", "cid": "UghA7MN7fICJAXgCoAEC.8ADY0LclOd98EkbCCy9fE4"},
{"text": "*3 companies! Yeah... I know... he's a freak!﻿", "time": "1 year ago", "author": "de Rossetti", "cid": "UghA7MN7fICJAXgCoAEC.8ADY0LclOd98F4G-kOB8gy"},
{"text": "he's not the first nor the only.﻿", "time": "1 year ago", "author": "Rashid Sumler", "cid": "UghA7MN7fICJAXgCoAEC.8ADY0LclOd98MEftlQw9yQ"},
{"text": "+Rashid Sumler Yes, but that doesn't mean it's OK.﻿", "time": "1 year ago", "author": "Groaznic", "cid": "UghA7MN7fICJAXgCoAEC.8ADY0LclOd98MGJQh2uJmT"},
{"text": "Groaznic I'm referring to Elon Musk not being the first and only man to start two billion dollar companies.﻿", "time": "1 year ago", "author": "Rashid Sumler", "cid": "UghA7MN7fICJAXgCoAEC.8ADY0LclOd98MGJaUC7Mxr"},
{"text": "+Rashid Sumler Ah OK.﻿", "time": "1 year ago", "author": "Groaznic", "cid": "UghA7MN7fICJAXgCoAEC.8ADY0LclOd98MGJjwRa_ur"},
{"text": "Exactly..﻿", "time": "9 months ago", "author": "John hudson", "cid": "UghA7MN7fICJAXgCoAEC.8ADY0LclOd98QPbUIXxhPT"},
{"text": "Sorry, took a wrong turn. Read Samurai Warrior of Silicon Valley and thought we were talking about the show.﻿", "time": "1 year ago", "author": "Ambit10n9", "cid": "Ugi85ZDzDASEq3gCoAEC"},
{"text": "Fucking albino, samurai my ass﻿", "time": "1 year ago", "author": "White Pig", "cid": "UggNdzinGFmPy3gCoAEC"},
{"text": "Kill him, replace him with a clone of Elon Musk.﻿", "time": "1 year ago", "author": "James Stewart", "cid": "UggxDuxzT563g3gCoAEC"},
{"text": "+The Future of X Great! All rocket passengers will find the cabin de-pressurizes at 200,000 feet, and all electric cars would blow up! Exciting times!!! ;)﻿", "time": "1 year ago", "author": "DataWaveTaGo", "cid": "UggxDuxzT563g3gCoAEC.89wHPrVF_4z8BptAuwau7W"},
{"text": "Right on!!!﻿", "time": "3 weeks ago", "author": "David Hume", "cid": "UggxDuxzT563g3gCoAEC.89wHPrVF_4z8aVu58x9Ddz"},
{"text": "Great﻿", "time": "1 year ago", "author": "Physics Animations Edu CG4u", "cid": "UgicJEAcvk5dsXgCoAEC"},
{"text": "I would like to horsewhip him if i got a horse.﻿", "time": "1 year ago (edited)", "author": "GNU/LINUX", "cid": "UgiJUwWPjw2kvngCoAEC"},
{"text": "My Dream '-'﻿", "time": "1 year ago", "author": "Diego Sykes", "cid": "UgjzVZJv8BF6lHgCoAEC"},
{"text": "so sad wasting your life on being arrogant prick\nyou have your cash, sit back, relax and have a laugh﻿", "time": "1 year ago", "author": "Jim Beam", "cid": "Ugh21M6mAo5-lHgCoAEC"},
{"text": "What a douche!﻿", "time": "2 years ago", "author": "LoudSoda", "cid": "UggYrP5c4BFDMngCoAEC"},
{"text": "He's like hans Gruber and Tony stark put together lol﻿", "time": "2 years ago", "author": "Rashid Sa'di", "cid": "Ugjsv3-bDOWxoHgCoAEC"},
{"text": "Tony Stark actually invents stuff. This guy is like Steve Jobs on steroids minus the fanboys.﻿", "time": "8 months ago", "author": "John L", "cid": "Ugjsv3-bDOWxoHgCoAEC.88VEzDqH3CH8SGnK-WUX5Q"},
{"text": "I have to say,Larry Ellison looks like Chinese pop songstress G.E.M.  lol.﻿", "time": "2 years ago", "author": "polly 王", "cid": "UgihFiA1RGtSpXgCoAEC"},
{"text": "Yeah, maybe he should try the 6 feet under thing.﻿", "time": "2 years ago", "author": "noxure", "cid": "UghxPMeIOntL0HgCoAEC"},
{"text": "+noxure good one , very funny , and very sharp observation﻿", "time": "2 years ago", "author": "Rahul Sondhi", "cid": "UghxPMeIOntL0HgCoAEC.87U4MwPJfkR87s53crszrE"},
{"text": "What I like most about Larry iz his Humanity ;)﻿", "time": "2 years ago", "author": "DataWaveTaGo", "cid": "UgjBwiEzKkH5s3gCoAEC"},
{"text": "that doesn't even make sense﻿", "time": "2 years ago", "author": "Cody Shinall", "cid": "UgjBwiEzKkH5s3gCoAEC.86vOh7UBTkx889JTskDOqe"},
{"text": "+Cody Shinall lol﻿", "time": "1 year ago", "author": "jose2883 pv", "cid": "UgjBwiEzKkH5s3gCoAEC.86vOh7UBTkx89bEMkexnPF"},
{"text": "please humor me with your definition of humanity, Mr DataWave﻿", "time": "1 year ago", "author": "Cody Shinall", "cid": "UgjBwiEzKkH5s3gCoAEC.86vOh7UBTkx89cH7h81vIc"},
{"text": "+Cody Shinall it's the unspoken message that counts ...﻿", "time": "1 year ago", "author": "DataWaveTaGo", "cid": "UgjBwiEzKkH5s3gCoAEC.86vOh7UBTkx89cThBUyOuc"},
{"text": "+DataWaveTaGo how philosophical of you to say, however, if you had any idea what was best for humanity - you would know its not anything Larry Ellison is offering... in fact, probably leans more toward the exact opposite. But what would I know about being humane? I'm just some guy that embraces the idea of privacy..﻿", "time": "1 year ago", "author": "Cody Shinall", "cid": "UgjBwiEzKkH5s3gCoAEC.86vOh7UBTkx89hJRzoi0-N"},
{"text": "+Cody Shinall Do you understand what \";)\" means?﻿", "time": "1 year ago", "author": "DataWaveTaGo", "cid": "UgjBwiEzKkH5s3gCoAEC.86vOh7UBTkx89hLzo8YIyz"},
{"text": "Larry, NOBODY can treat you as well with numismatics as I﻿", "time": "2 years ago", "author": "mrearlygold", "cid": "UggtTEoNNHYJ9ngCoAEC"},
{"text": "Interesting and inspiring video!!! :O) Thanks for the upload!!!﻿", "time": "2 years ago", "author": "Desmond Birch", "cid": "UghCkzC_MijCg3gCoAEC"},
{"text": "+Desmond Birch Inspiring? So when you grow up, you also want to be a borderline psychopath, selling a broken product through what is basically fraud, obsessed with wealth just for the sake of wealth, without doing any good with it? Then yes, be inspired by Larry Ellison.﻿", "time": "1 year ago", "author": "Groaznic", "cid": "UghCkzC_MijCg3gCoAEC.86NbAMyittF8ADYFfF1pf-"},
{"text": "+Groaznic I can't speak for Desmond Birch - But I Will! DB means he's inspired by the :O) factor in his message!!﻿", "time": "1 year ago", "author": "DataWaveTaGo", "cid": "UghCkzC_MijCg3gCoAEC.86NbAMyittF8BptbAqylFR"},
{"text": "@Bloomberg Business do one of these on McAfee that should be interesting.﻿", "time": "2 years ago", "author": "TheDestruct0r", "cid": "Uggf6sukZh2t-3gCoAEC"},
{"text": "@ 6:42 - the article that sparked Ellison's career that they talk about in the beginning of the video can be found here: http://www.seas.upenn.edu/~zives/03f/cis550/codd.pdf\n\nI can't believe that nobody had thought of the relational database before and even more unbelievable is that even when an IBM engineer wrote a paper on it, they still didn't realize how revolutionary it was!  That was ultimately IBM's downfall, they wanted to sell you what they had, not innovate.  They thought that only businesses needed computers so the pc was pointless, how crazy does that idea seem now?  Everybody has a computing device in our pocket 24/7.  Yes an iPhone is a far cry from a mainframe but still they evolved from the same basic idea of handling bits of data, just 1's and 0's, at the heart of it that's all any computer does.  But Ellison stole their idea and ran with it, since they didn't seem to want it anyways, and became one of the richest men on the planet in the process.  Good for him, he knew a good idea when he saw it and had the aspiration to do something about it.﻿", "time": "2 years ago", "author": "Jared Connell", "cid": "UgjmW0zwewuemngCoAEC"},
{"text": "A first rate pretty accurate picture of life at the top in the IMMENSELY profitable  Software industry and the battles between the giant gladiators! NB:  They ALL crashed at least once on the way ............﻿", "time": "2 years ago", "author": "Jack Rigby", "cid": "UggS-PSG5Dd2MXgCoAEC"},
{"text": "+Jack Rigby  BTW: \"Gladiators\" is the right word -  These guys aim to be #1.  They prove it and still can't relax. It is ALL in the chase. It's the only Game there is It is their purpose.  The gods don't make too many of them..... (luckily or not?)﻿", "time": "2 years ago", "author": "Jack Rigby", "cid": "UggS-PSG5Dd2MXgCoAEC.8591W7-HnBh7-H1L6s_QIM"},
{"text": "Nice to know this guy really knows how to learn all the ropes from Adolf Hitler and to rule the world of software with an iron hand...﻿", "time": "2 years ago", "author": "David Chang", "cid": "Ugi9JOZYX_ihN3gCoAEC"},
{"text": "What is jucheck.exe?  Why should I install it?  It's from Oracle.﻿", "time": "2 years ago", "author": "NimlotArt", "cid": "Ugi2i7eVtavTw3gCoAEC"},
{"text": "SDL, only one meaning for that acronym, Simple Direct media Layer.﻿", "time": "2 years ago", "author": "Penguin Design", "cid": "Ugh6coarFBcYZHgCoAEC"},
{"text": "+Penguin Design Cross-platform development represent! :)﻿", "time": "1 year ago", "author": "Groaznic", "cid": "Ugh6coarFBcYZHgCoAEC.8524cIxLFbr8ADXXagGXwQ"},
{"text": "i worked for this meglo years a go. he runs oracle with a revolving door. worst company to work for. horrible management.﻿", "time": "2 years ago", "author": "BruceBlitzHasTits", "cid": "UghSMVtJSxMHvngCoAEC"},
{"text": "The Network Computer idea flopped, and over my dead body, and with most fervent prayer, until Hell freezes over,  may everything like it continue to flop, for the obvious reason that NO ONE in their right mind would trust any corporation enough to let such store and manage ALL of their personal data, and with it the total record of their identity and activity.  That would be the final kiss of death to liberty, by which one says  goodbye utterly and forever to privacy, security, content sharing, and control over deletions, subscription rates, software, speed and reliability of access, portability, device compatibility, and God only knows what else.  If Ellison had a soul to sell to Satan, there is no devilish pact that is beneath him, or regime or institution too appalling for him to deal with.   If he could get away with it. he'd make over the entire internet into a monopoly, with himself as sole owner and CEO.  He would then proceed to make himself alone immortal, by uploading his brain into the network, from which he would reign absolute, perpetually free to exercise perpetual tyranny, and everlastingly crap the very face of Earth with his self-ware.  He would try to sell the idea to Oprah, and her reaction, again, would be,  \"Will it erase me?\"   If not exactly in words to that effect, though in tone it would amount to it.  \n        I'm sure he still hates the PC.   It's far too personal en extension of the average user's will for his taste.﻿", "time": "2 years ago (edited)", "author": "James Roach", "cid": "UghmFKnMBWZm1HgCoAEC"},
{"text": "worked for this jerk at Oracle and he would gladly see you into an early grave to make more money.  he is evil incarnate!﻿", "time": "2 years ago", "author": "Carl Hopkinson", "cid": "UghG1xXgO9aACXgCoAEC"},
{"text": "+Carl Hopkinson i worked for oracle as well. worst experience in my life.﻿", "time": "2 years ago", "author": "BruceBlitzHasTits", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt7-ZgWZ5HLmf"},
{"text": "+Carl Hopkinson whats wrong with that ?﻿", "time": "2 years ago", "author": "mcrayfourd", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt7-pat8r8i1q"},
{"text": "+Carl Hopkinson He wanted to have the number one net worth in the world, and was willing to do anything to get there,  he made into the top ten.﻿", "time": "2 years ago (edited)", "author": "Bluetempo", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt70ahRtNcoAb"},
{"text": "+J. Mosaic One yep that's a real bummer he's only worth 50 bil﻿", "time": "2 years ago", "author": "mcrayfourd", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt70arBpVEwFn"},
{"text": "+mcrayfourd lol you talk like you are worth more﻿", "time": "2 years ago", "author": "American Patriot", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt86_kNb5Ouyc"},
{"text": "+mcrayfourd It is when you're a try hard who couldn't even get into the top two ﻿", "time": "2 years ago", "author": "Bluetempo", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt86ocpYDdClS"},
{"text": "+J. Mosaic One Top 5﻿", "time": "2 years ago", "author": "hankscorpiouk", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt87uadiyl9db"},
{"text": "+Carl Hopkinson My Uncle worked at Oracle and [correctly] described Ellison as a genius.  Did they not recompense their high-flyers well?  Maybe the problem is you?﻿", "time": "2 years ago", "author": "hankscorpiouk", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt87x82ZRfoKV"},
{"text": "+hankscorpiouk oracle lost many brilliant and innovative engineers from sunmicrosystems including the  inventor of java james gosling,  most of the zfs and dtrace teams and a large number of the most skilled and knowledgeable kernel internals and performance people including myself.  i suggest  you do some basic homework first before you start quoting the eminent authority, your uncle.﻿", "time": "2 years ago", "author": "Carl Hopkinson", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt87xFXTqDCib"},
{"text": "Yup, Larry's a total loser, so many people out there who have accumulated a net worth of $50 billion after starting life pretty much at the very bottom.﻿", "time": "2 years ago", "author": "hankscorpiouk", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt87xGGU-QrqV"},
{"text": "+Carl Hopkinson Anyway thank you for that information, and I congratulate you on leaving Oracle to become even more successful than Larry Ellison.  Well done.﻿", "time": "2 years ago", "author": "hankscorpiouk", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt87xGYgM3GoH"},
{"text": "+Carl Hopkinson Yeah, how about using some of that money for the good of others instead of wasting it on another sail boat or super car.\nHe obviously forgot where he came from.﻿", "time": "2 years ago", "author": "softminimal1", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt88qvoEZinPa"},
{"text": "+hankscorpiouk if you define \"success\" as having a lot of money while ripping off a lot of people, then I suppose Ebenezer Scrooge pre-Xmas-ghost visitation would be a hero to you.﻿", "time": "2 years ago", "author": "Carl Hopkinson", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt88qwM19nnvU"},
{"text": "+Carl Hopkinson Grow up.﻿", "time": "1 year ago", "author": "randomcomments", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt8924aPYnxaI"},
{"text": "+Carl Hopkinson Im with you. That's why my hero is Musk.﻿", "time": "1 year ago", "author": "Gabriel Marte", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt89mVQYF0cAq"},
{"text": "+randomcomments oh shut up, you know nothing of the life and the struggles we Sun Microsystems engineers had to go thru over almost 20 years of sustained mind breaking effort just to see it ruined wnd be picked  over by this hook-nosed vulture Larry Ellison.  You are an insignificant blemish on the ass of humanity so go burst, dry up and blow away.﻿", "time": "1 year ago", "author": "Carl Hopkinson", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt89mhCgCh1qI"},
{"text": "+Carl Hopkinson Actually, I'm not.﻿", "time": "1 year ago", "author": "randomcomments", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt89nB1Anakoh"},
{"text": "Almost everyone is an asshole, society breeds it.﻿", "time": "1 year ago", "author": "hankscorpiouk", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt8AFSnifdqnx"},
{"text": "+Carl Hopkinson did you ever see him in person?﻿", "time": "1 year ago", "author": "D-B-A", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt8Bd5cmbZZhF"},
{"text": "+Carl Hopkinson I don't believe you one single bit. I read envy and and lack of commitment on your psrt.﻿", "time": "1 year ago", "author": "E.J.", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt8BpvQgSiecx"},
{"text": "+e.j. Blasucci Larry Ellison's an asshole. He's consistently been involved in sexual harassment scandals.﻿", "time": "1 year ago", "author": "MisterBurkes", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt8CEYmyWMIV6"},
{"text": "+Carl Hopkinson did you quit or was fired? Just a question. Have you met him in person?﻿", "time": "1 year ago", "author": "New Media", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt8CeweXaqid0"},
{"text": "+Carl Hopkinson \n\nhaha the difference is that he owns the company you work at. If you want him (and you) to make more money u just have to increase your productivity because that is the only thing that matters. Also stop calling the leaders of industry \"evil\" just because one of them was \"mean\" to you... ur just a butthurt loser tbh﻿", "time": "1 year ago", "author": "Victor Tisell", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt8CnjBM2ithQ"},
{"text": "+softminimal1 Creating Jobs is doing something good for others, it's superior to charity because you can't feed a broke person everyday but if that person has a job to support him or her self they can feed themselves for a life time. It's good he bought that sail boat and Supercar, people work at those manufacturing companies to make a living.﻿", "time": "1 year ago (edited)", "author": "Law19157", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt8EA05me2Lfs"},
{"text": "Carl Hopkinson weird, seeing that IT is the most profitable business in the world- and these IT businessman are the wealthiest people in the world- they don't get bad mouthed (get labelled 'greedy') or treated like dirt, the way Wall Street types do! Media just working to their own corporate agenda!﻿", "time": "1 year ago", "author": "Numan Khalid", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt8MjmuFqloCp"},
{"text": "Carl Hopkinson I believe you. These people don't care about their workers, but money. They are willing to destroy anyone's life when it comes to  making money.﻿", "time": "8 months ago", "author": "1.2M views", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt8RNwsk2aku6"},
{"text": "Carl Hopkinson I﻿", "time": "6 months ago", "author": "Houps", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt8U3qfa52nF7"},
{"text": "That makes you the one who sold his soul to d-evil.﻿", "time": "4 months ago", "author": "Teboho Moloi", "cid": "UghG1xXgO9aACXgCoAEC.84XyD3-fGHt8WissQ057lz"},
{"text": "Oh god this guy is actually upsetting me.\n\nThis guy wants to be the richest greatest person .\n\nJust remembered a interview of Jobs and Gates talking on how being the richest isn't the thing that actually matters in the world , those guys learned that lesson pretty early but I guess this guy here to this day is still bitter for not passing gates on wealth.\nIt is actually sad now that I think about it he probably had a very bad host family.\nHis dad saying that he was adopted in that way was terrible. It seems like people never really get through their family problems even when they are adults.\nNow I am not sure anymore if this guy is to be blamed for his stupidity or his family.\nI don't know anymore I can't judge him.\nBecause different from Bill and Jobs who had great families that supported them he didn't have support from his family.﻿", "time": "2 years ago", "author": "My Thoughts", "cid": "UgjHTCi4eorm2ngCoAEC"},
{"text": "Jobs was adopted as well....﻿", "time": "2 years ago", "author": "Rashid Sa'di", "cid": "UgjHTCi4eorm2ngCoAEC.84L0f6EDkRO70U_Tm9PE4S"},
{"text": "+Dark Light how can you tell that they weren't lying can you read minds﻿", "time": "2 years ago", "author": "American Patriot", "cid": "UgjHTCi4eorm2ngCoAEC.84L0f6EDkRO876fwTkV72w"},
{"text": "He believed and asked the programmer to write code.\n\nHere we have a complete asshole he is an idiot and got wealth from the others.\n\nFrom all success stories this a first for me to listen what a idiot he is.\n\nKind of looks like Steve jobs but Jobs was a different species he had skills while this guy is a lucky idiot.\n\nDidn't do any actual work and you can see it from the way he lives focused on the toys and islands .\n\nNot in the same lever of Mark or Bill or Steve or Elon etc etc.\n\nthis guy is a hack﻿", "time": "2 years ago", "author": "My Thoughts", "cid": "UgjmnjqZ0RnjSHgCoAEC"},
{"text": "For the money spent and used to purchase and his net worth and such, is that all adjusted for inflation in 2014 when this was published? That would be really neat if you would be able to find that out﻿", "time": "2 years ago", "author": "Evan Hale", "cid": "Ugjvnn00SVOJYngCoAEC"},
{"text": " I know who payed for this.﻿", "time": "2 years ago", "author": "rallokkcaz", "cid": "UgjFKuDlYmYrIngCoAEC"},
{"text": "I'm not sure that ellison won the americas cup alone, with a boat he personally built himself like this film would make it out to believe.﻿", "time": "2 years ago", "author": "Billy Warren", "cid": "UgikKL0fkg3TqXgCoAEC"},
{"text": "Great guy larry.﻿", "time": "2 years ago", "author": "k odu", "cid": "UggxwXeDLrsTu3gCoAEC"},
{"text": "He is a legend no doubt.﻿", "time": "2 years ago", "author": "NoParking", "cid": "Ugjfv8IKSAOyeHgCoAEC"},
{"text": "Man, you can not ask for a better comparison of companies than Apple and Oracle. The only real difference is that Oracle is a software company and Apple is a hardware comapny. Everything else is mirrored. (e.g. Larry Ellison - Steve Jobs, Woz - Bruce Scott, both nearly gone bankrupt in the 80s, etc.) Now there are some differences I haven't mentioned, but more often tha not, these two companies are the same.﻿", "time": "2 years ago", "author": "Engineer 314", "cid": "Ughg2DRCCR0UIXgCoAEC"},
{"text": "+jojohn mwendwa you should see this!﻿", "time": "2 years ago", "author": "Kevin Kavai", "cid": "Ugi7gcP9nCGjA3gCoAEC"},
{"text": "So he drop out of college too. Seems like Tai Lopez the guy who makes the video saying drop out of college is right.﻿", "time": "2 years ago", "author": "Andriod Khan", "cid": "UggEpHf7YUA5HHgCoAEC"},
{"text": "But hes success comes from something far less \"FLASH-y\"! That was just briliant!!!﻿", "time": "2 years ago", "author": "jurisAKCMV", "cid": "Ugh0IkNOYZVWdngCoAEC"},
{"text": "i never heard of oracle before... lol :3﻿", "time": "2 years ago", "author": "heyimhy", "cid": "UghyPk9Kiob4o3gCoAEC"},
{"text": "hahaha, I thought this was a clip from Silicon Valley!﻿", "time": "2 years ago", "author": "Andrew Kennedy", "cid": "Ugh1uJHyFrqrEHgCoAEC"},
{"text": "HELLO HELLO .﻿", "time": "2 years ago", "author": "bhh miss", "cid": "Ugj1F70RiMTqC3gCoAEC"},
{"text": "o wow, the cia was having trouble doing something halfway efficiently... welcome to any branch of the government and number 45 educations system in the world. the one where teachers unions defend a pos system... fuck, americans are stupid﻿", "time": "2 years ago (edited)", "author": "nickjamesbitch2", "cid": "UgiBtDFCVxfqU3gCoAEC"},
{"text": "Why we have heard nothing about JAVA?﻿", "time": "2 years ago", "author": "Bieltz Vlad", "cid": "UgjKlqHEbVDRxHgCoAEC"},
{"text": "   ﻿", "time": "2 years ago", "author": "John Ratcliffe", "cid": "UgiqS3RhgYi-63gCoAEC"},
{"text": "He looks like Howard Schultz with a beard !﻿", "time": "2 years ago", "author": "Jean-Marie Ricci", "cid": "Ughfxa41Yd0T6ngCoAEC"},
{"text": "Smells Like Steve Wozniak and Jobs parasiting on him. Same symbiothic interest based psychopatic friendships. God I hate these people.﻿", "time": "2 years ago", "author": "Sorin Irimies", "cid": "UgjDayj23SpUQ3gCoAEC"},
{"text": "Gavin Belson..﻿", "time": "2 years ago", "author": "Adam Dunlop", "cid": "UgjRNN29H9OajXgCoAEC"},
{"text": "Ellison is a douche.﻿", "time": "2 years ago", "author": "Dom Tor", "cid": "UgjXroMMv94aWngCoAEC"},
{"text": "Lester Barrett you are an idiot.  Your comments shows your how much of a retard you are and you are obviously out of touch with reality.  Have you been living in a cave your whole life??  Just pointing out to you that people who have help to shape this world are all full of egos. Its their every ego that his driven them to help shape the world.﻿", "time": "2 years ago", "author": "Seng Vang", "cid": "UgigUmseqVIdMngCoAEC"},
{"text": "+Seng Vang Mother Teresa didn't have ego. In fact lots of great scientist and philosophers didn't have ego and only wanted to create a better world. Lots of them were \"weird and strange\" but were not ruthless egoistic businessmen.﻿", "time": "2 years ago", "author": "Str1000ac", "cid": "UgigUmseqVIdMngCoAEC.8-xMJE1NZNh7-W8jn6ApAN"},
{"text": "LMFAO at 1:34﻿", "time": "2 years ago", "author": "Redeeming Divergence", "cid": "Ughp7Obn5yFz_HgCoAEC"},
{"text": "idk if anyone noticed but on 2:14 you'll see fat amy.﻿", "time": "2 years ago", "author": "Blissful Seeker", "cid": "UgjJ5PdpmfNrL3gCoAEC"},
{"text": "Quit hating﻿", "time": "2 years ago", "author": "TrueVintage4u", "cid": "UggOqVCz1Q5aTHgCoAEC"},
{"text": "Bruce looks like Dan Patrick﻿", "time": "2 years ago", "author": "kozmobillions", "cid": "UgjeDp7UyZ55H3gCoAEC"},
{"text": "how many times have you heard the word larry in this video﻿", "time": "2 years ago", "author": "Gorilla Chilla", "cid": "Ugg_QJZilzZoL3gCoAEC"},
{"text": "If he's so rich, why doesn't he have eyebrows??????﻿", "time": "2 years ago", "author": "chaoy22", "cid": "Ugijf7BTIs7fFHgCoAEC"},
{"text": "+chaoy22 Deepest comment on the video right here.﻿", "time": "2 years ago", "author": "Dony Christie", "cid": "Ugijf7BTIs7fFHgCoAEC.8-RhZFKgH_y751EAUVjOkH"},
{"text": "+chaoy22 LLOOOLOLOOLOOLOLLOOLL money can't buy love, or eyebrows apparently﻿", "time": "2 years ago", "author": "gadget00", "cid": "Ugijf7BTIs7fFHgCoAEC.8-RhZFKgH_y86TPoXrPmpg"},
{"text": "chaoy22 does it fucking MATTER?﻿", "time": "7 months ago", "author": "tim cook", "cid": "Ugijf7BTIs7fFHgCoAEC.8-RhZFKgH_y8TFnrnqRcXj"},
{"text": "He sold them to the devil.﻿", "time": "2 months ago", "author": "Vutu", "cid": "Ugijf7BTIs7fFHgCoAEC.8-RhZFKgH_y8ZHCiBVgEVQ"},
{"text": "Where is your eyebrows asshole ?﻿", "time": "2 weeks ago", "author": "Kevin Doyle", "cid": "Ugijf7BTIs7fFHgCoAEC.8-RhZFKgH_y8ag8J7ls3Wh"},
{"text": "Got to college, take on massive debt and then spend the rest of your life trying to pay it off.\n\nOr be like Ellison and chase your dream. It does not have to lead to a billion dollars. But it will lead to finding your passion.\n\nFor most people,college is a complete waste of time. For the others, it is largely a waste of time.﻿", "time": "2 years ago", "author": "wjestick", "cid": "UggQR2OZ6Qp_8HgCoAEC"},
{"text": "+BobMarleyNug420\n\nActually, have two degrees but if you are keen to meet some others who have none, try this list.\n\nMichael Dell, Bill Gates, Larry Ellison, Paul Allen (Gates's business partner), Richard Branson (Never made it to college), While you are digesting that meal look up the college that graduated Steve Jobs!\n\nIf you like an older vintage, Tom Edison, JD Rockefeller, Andrew Carnegie and Henry Ford (who worked for Edison before starting the Ford Motor company)\n\nThere are a lot more but I don't wish to encourage the same laziness that was implied  in your comment. Do some research.﻿", "time": "2 years ago", "author": "wjestick", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI7-nIz7fqlcI"},
{"text": "+wjestick my problem is i do not know what business to start.﻿", "time": "2 years ago", "author": "zubayn sandhu", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI7-sEzJkYJC2"},
{"text": "+wjestick true but here is one case. University of Manchester Mba graduate starting salary was 1.8 million dollars because he studied and tolled away at options trading. A lot of ivy league schools keep that a secret that some MBAs pay beyond six figures. Nevertheless I definitely understand what you are saying.﻿", "time": "2 years ago", "author": "tanio12", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI704mGVfz_fG"},
{"text": "+tanio12\nTaking that story face value consider this.\n1. There is no way that Manchester made it known that that MBA would attract that salary.\n\n2. If reading a bunch of books with no real world experience can be that valuable to an organisation, why would they not just buy the  books (for a lot less than 1.8 million dollars) and pay a whole team of their apprentice option traders to read them.\n\nThen pay the best one (based on actual options performance) $200K saving a lot of money.\n\nI will tell you why. No ,employer pays over the odds for graduates of any programme unless there is a connection that is not accessible to the ordinary student.\n\nSo if you are an ordinary member of that school and took on the five figure debt to get that degree, that is NOT the salary you are going to be offered.\n\nThis is known as the lottery fallacy. One guy hit the jackpot so everyone should spend all their earnings on lottery tickets.\n\n3. I graduated from Oxford so I have some insight into how this works. There are secret seminars and courses, for the chosen few.\n\nBut they are chosen by family ties. Like people who get to join secret societies like skull and bones at Yale.\n\nThey are not awarded on Merit. So an ordinary student would be ill-advised getting into debt to get onto such an exclusive programme.﻿", "time": "2 years ago", "author": "wjestick", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI7054_JoDLTg"},
{"text": "+wjestick He just got lucky with one in a million chance. There are millions people smart and capable just like him who ended up \"cleaning streets\". For you success = lots of money. Only those who fail at college will say college and education is not important. I'm sure Ellison will make sure his children finish fine schools and colleges.﻿", "time": "2 years ago", "author": "Str1000ac", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI70GyEy5y46_"},
{"text": "+Str1000ac\n\nLarry Ellison one in a million\nSteven Jobs, two in a million\nBill Gates three in a million\nPaul Allen (Gate's partner) four in a million\nRichard Branson five in a million\nAlan Sugar (The Apprentice guy) six in a million\nMichael Dell seven in a million\n\nI could keep going and going Warren Avis (Rent-a-car)\n\nYes there are smart people cleaning streets, many of them paying off student debt they ran up in the  process.\n\nAnd no, I do not equate success with money, but I also don't equate education with sitting in a classroom being told what and how to think at a massive cost.\n\nGetting churned out of school with the same knowledge and attitudes as all ones class mates is not conducive to original thinking.\n\nThe world is changing extremely fast. Old mantras like a job for life and a career no longer apply.\n\nIf you go and work for a big corporation today you will be drawing welfare  in 10 years. All the corporations that want to survive are slashing costs by automation.\n\nThe process is just getting started. Drones, automated checkouts, driverless planes, automatic pilots, computerised factories...\n\nPeople who follow the programme will be surplus to requirements really soon.\n\nIf you want to enter the lottery to be one of the lucky few, the job market equivalent of the hunger games, good luck.﻿", "time": "2 years ago", "author": "wjestick", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI70H0aJecTgU"},
{"text": "+wjestick I have far more respect for (famous and nonfamous) doctors, architects, civil engineers, chemistry enginners, physicist, mathematicians etc. then for some businessmen you just mentioned like Richard Branson or Alan Sugar The Apprentice guy? (I don't watch reality shows, sorry).\nAnd yes Kardashians, Justin Bieber and One direction dudes are very rich and successful, yet I don't see anything worth admiration in their work.﻿", "time": "2 years ago", "author": "Str1000ac", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI70H20qljdbH"},
{"text": "1. The Khardashians and Justin Bieber are not in the same business as the people I cited. No qualifications are needed for what they do.\n\nBuilding global businesses like the people I cited is the dream of the many thousands of people with MBA degrees and the debt that goes with it.\n\nHave you never asked yourself why, If MBA degrees were so effective as a form a training, why people without them are able to compete so effectively?﻿", "time": "2 years ago", "author": "wjestick", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI70H80xV0W31"},
{"text": "+wjestick Outside USA education (including college) is mosty free, you only have to buy the books and find a place to stay unless college is in your city so I don't understand the \"loan and debt\" problem you talk about.\nI understand Bill Gates's and some others and respect it.\nRichard Branson on the other hand is just a very successful businessman not very known to common people outside US or UK because he didn't do anything worth mentioning, If he is to find cure for cancer (which he won't because he's uneducated and stupid as his teachers said) he would make sure to charge it as much as he can and that he's name is clearly seen. Also know for tax frauds, offshore comapnies and other scams. Ethics and morality are not in his vocabulary, he wouldn't sell his kidney but would gladly sell yours.\nAs for M.Dell ... In the April 2011 issue of Mother Jones, a timeline of Michael Dell's life is detailed in \"American Magnate: Michael Dell: How a homegrown geek outsourced, downsized, and tax-breaked his way to the top.\" The article juxtaposes Dell's spending on luxurious homes and private jet travel with his pursuit of tax breaks and tax holidays and Dell Computer's eventual offshoring of jobs overseas after receiving the incentives for setting up shop locally.\nHe's one of the smart guys who uses charity funds to avoid/bypass taxes and he's one of the guys thanks to whom americans are loosing their jobs and are given to cheap chinese workers.﻿", "time": "2 years ago (edited)", "author": "Str1000ac", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI70HQ8vsof_9"},
{"text": "+wjestick so to sum up, I would never and have never advised any kid/teen to skip education (school, college etc.) with an advice that there a better things in the world despite him wanting to get an education. I'm sure Bill Gates would do the same because he's not the guy who can solve world's energy and other problems. You make it sound like passion and dream has nothing to do with education. What if an 18 yo wants to become neurosurgeon or an astronaut or a nuclear physicist? Can he become that by starting his own dotcom company? 99.99% of dotcom companies are fail from the start. 90% of those companies that are today successful will go bankrupt in next dotcom crisis with pension and hedge funds paying \"the price\".﻿", "time": "2 years ago (edited)", "author": "Str1000ac", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI70HTG0ROE1P"},
{"text": "+Str1000ac\nStudent debt is not limited to the US.\nhttp://www.usnews.com/education/best-global-universities/articles/2013/11/13/undergrads-around-the-world-face-student-loan-debt\n\nBut it is true that levels are lower in other parts of the world. But my focus is no US and UK.\n\nYour first post where you stated that the people who I cited are not perfect human beings is irrelevant to the topic at hand.\n\nIf I listed a lot of college graduates who lied and cheated their way to the top, how would that inform you as to the value of education?\n\nThe fact is that what happens in schools and universities has little to do with education.\n\nThe fundamental deliverable of an education is the produce self directed individuals who can learn new information and ideas independently.\n\nThis is not what most graduates achieve. They spend most of their lives looking for others to direct their time and energy and spend much of their income on the output of others.\n\nDuring the industrial age this was a viable way to live. Today it isn't since the idea of a job for life is gone.\n\nThe implied contract which allowed students to passively absorb some else's curriculum but then be given a living by an institution that had no say in that curriculum is gone.\n\nChina and India turn out engineers at a fraction of the cost the west does, and they will work for 40% or less of the pay.\n\nFurthermore with rapidly expanding automation, nobody knows which jobs will still be needed in ten years.\n\nOne thing higher education does not teach is flexibility or self sufficiency.\n\nPeople who can't find jobs are increasingly helpless. And jobs and the income from jobs is vanishing fast in what was the industrialised world.﻿", "time": "2 years ago", "author": "wjestick", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI70HzQwESfZP"},
{"text": "+wjestick I truly agree﻿", "time": "2 years ago", "author": "How-to-Money-making", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI70TGrGSXwN7"},
{"text": "+wjestick there's 7 in a million who didn't finish college that got rich...but  there is also 700+ Million living in poverty because they didn't finish college or had good education...will u belong to the 7 or to the 700 million...﻿", "time": "2 years ago", "author": "Akai Ryuu", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI70ugvJLyQX9"},
{"text": "+Akai Ryuu\n1. There are a lot more than 7 people who prospered by not going to college. I name these people because the many thousands of business owners who did not go to college are not famous.\n\nIf you want to see how that works do some research into the local businesses near you. (not the multinational like Walmart)\n\n2. Their personal prosperity is not the real issue. The fact that they created industries that provide jobs for millions of people is the point.\n\nMany of those people are paying off college loans (or have done so) only because these drop outs provided them with jobs.\n\n3. Schools extend childhood by teaching dependency, suppressing imagination and college finishes the job.\n\n4. It is quite irrational to spend 4 years training to please an employer who has NO SAY WHATEVER in the course of study the college student undertakes.\n\nA degree is a product like a cake or a pair of shoes.\n\nExcept makers of these products do MARKET  RESEARCH to see what the market wants before they make the product.\n\nCollege students do NO MARKET RESEARCH before spending hundreds of thousands of dollars on a degree they have no idea that anyone wants.\n\n5. Learning how to think and be creative is something that can only be won by experience. No college course teaches it.﻿", "time": "2 years ago", "author": "wjestick", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI70v1qIYzTf-"},
{"text": "+wjestick Nobody can teach you \"how to think and be creative\", it's what you have inside of you from the start. Only very, very, very small percantage of college drop outs will become successful. Look at Europe, Japan, China, S.Korea, you think people there drop out of college to be successful and rich. No, they finish their education first. US education system and student loans are the problem, not education.﻿", "time": "2 years ago (edited)", "author": "Str1000ac", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI70w0PKBD65t"},
{"text": "+Str1000ac\n\n1. The main value of college is networking. This fact is openly flaunted before you.\n\n\" George Bush C student, John Carey, C student. But they were both Skull and Bones members and ran for president.\"\n\nTry getting in the middle of that argument with a 4.0 grade point average!\n\nJFK and Roosvelt were also C students but very capable presidents.\n\nA clear indication that absorbing college education is not what leads to success after college.\n\n2. College is not synonymous with education. Education implies an interactive process by which one learns to observe, adapt to and manipulate ones environment.\n\nCollege is the absorption of a curriculum abstracted from an ever changing world.\n\n\n3. College graduates are more employable than non graduates is a theory which few employers bother to test.\n\nMany so called \"uneducated people\"  in getto schools for example, are in fact people who have been seriously damaged by the education system.\n\nOften when the consequences of dropping out are examined, these illiterate and often criminalised people are held up as an example.\n\nBeing forced to go to school (which by law we all are) and thus prevented from taking up any alternative means of education (like apprenticeship of starting a business) does not lead to a valid comparison.\n\n4. Many great companies have been founded by people who did things that are now considered to be illegal.\n\nEdison started his first business at 13. School attendance laws would now forbid this.\n\nThe reason why school and college don't look worse than they do is that they have effectively outlawed most competing activities until people are too old to fully exploit the opportunities they bring.\n\nThe school reading charts consider child to read like an adult at 13 but forbid employment for 3 more years.\n\nMost jobs require little more than literacy and numeracy for training to begin. So think why this delay is built in?\n\nChildren can go to jail earlier than they can go to work. (Juvenile detention is jail, don't let the name fool you)﻿", "time": "2 years ago", "author": "wjestick", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI70wB8AZdh_t"},
{"text": "+wjestick So, you just named 5 in today's time. roughly 76% of the world's billionaires had top educations.﻿", "time": "2 years ago", "author": "Camelbackz", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI73B-DFEZqTg"},
{"text": "+Camelbackz\nI don't know where you got that figure from. But taking it at face value.\n\n1. 24% of billionaires did not have top educations.\n\n2. How many of those billionaires acquired their wealth themselves, and how many simply inherited a going concern?\n\n3.If education was the main route to becoming a billionaire the University professors would also be the richest people.﻿", "time": "2 years ago", "author": "wjestick", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI73BNNOZFGBN"},
{"text": "+zubayn sandhu The day you stop asking yourself what business to start is the day you find one. Let it come naturally, that's where success lies, when it is natural and you would rather do nothing else but what you are doing :)﻿", "time": "2 years ago", "author": "Christopher Morris", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI74I7XYNCQZ9"},
{"text": "+wjestick You undestand that Ellison went to UIUC and uChicago?﻿", "time": "2 years ago", "author": "Anav Sawhney", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI7599Nlvi_y4"},
{"text": "+Anav Sawhney\nThank you for your in depth research. Here is mine.\n\n\"Ellison entered the University of Illinois with vague hopes of becoming a doctor. But he ignored courses that bored him, and records show he was dismissed in June, 1964, for failing to maintain a C average.\"\n\nEllison did not finish college. He did not study computer science and he did not maintain a C average.\n\nThe purpose of this thread is to challenge the dogma that young people can't succeed without college.\n\nIt is bunk.﻿", "time": "2 years ago", "author": "wjestick", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI759nZzpknQM"},
{"text": ".﻿", "time": "1 year ago", "author": "kubhendran maleyappan", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI8JNQR3b-5sA"},
{"text": "You also have to keep in mind that there are a lot of people who enroll in college with no idea of what they want to do for 1 - 2 years after they start.\n\n1. Avoid student loans at all cost\n2. Avoid universities unless BA or higher is required for your field\n3. Take the shortest path to your degree\n\nThe reality is that you can learn almost anything online of from connections, and that college only exists because employers recognize degrees.﻿", "time": "11 months ago", "author": "westganton", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI8OYMYqZRrXB"},
{"text": "Exactly.﻿", "time": "9 months ago", "author": "John hudson", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI8QPbJ0NlRRU"},
{"text": "By this way, this is complete bullshit lmao\nLook at all the billionaires, they were already geniuses before college\n\nKeep telling this to kids who got F's in highschool﻿", "time": "9 months ago", "author": "C Scott", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI8QxwC3zX1ye"},
{"text": "False. Not going to college isn't the solution to reach one's dreams. Just as much as you imply that education isn't really relevant to one's potential success that means whether being educated or uneducated would not at all matter to begin with.\n\nSome people do love to study in college(myself excluded)and I can't see anything wrong with that.\n\nThere are also cases where standardized curriculum is the most effective way to teach people about some particular study. Being a doctor, for example, would you really want your body to be medically taken care of by strangers with little to no resources or experiences and couldn't perform according to a well-reviewed standard? That would be too risky. I wouldn't want to have some strangers whose skills are unproven and untested to mess around with my head.\n\nBut BELIEVING that being well-educated would automatically makes one's successful in his/her pursuit is 100% wrong.﻿", "time": "4 months ago", "author": "A Cool Name", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI8WSA6U-obb7"},
{"text": "wjestick says:\n\"24% of billionaires did not have top educations.\"\n==\nAnother way of saying this is,\n\"76% of billionaires had top educations.\"﻿", "time": "1 month ago", "author": "allgoo19", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI8a6CzyUIwO8"},
{"text": "A formal education will earn you a living a self education will earn you a fortune﻿", "time": "2 weeks ago", "author": "Kevin Doyle", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI8aipm4hKwpZ"},
{"text": "Samurai, were the lords and enforcers of the entitled nobility.  Think guys, like Ellison, give a damn about Americans and freedom?  LOL﻿", "time": "1 week ago", "author": "tk421missing", "cid": "UggQR2OZ6Qp_8HgCoAEC.8-B2mRmIDSI8b067ZtYlxD"},
{"text": "I like Larry, but No mention of Edgar Codd at all? haha﻿", "time": "2 years ago", "author": "fightyourfat", "cid": "UghvmUCSwyMNwHgCoAEC"},
{"text": "No wonder... This guy adopted his \"philosophy\" from Japanese people. Sad. Japanese refuse to lose and make a living hell out of their lives because of simple failures. They are immensely racist, extremely xenophobic and unstable. Ever heard of the term hikikomori? Go google it. Japanese are potentially really dangerous people.﻿", "time": "2 years ago", "author": "Göktuğ Kaya", "cid": "UgjEzIz2gdGHY3gCoAEC"},
{"text": "+Göktuğ Kaya man, ur so uneducated about japanese people.. just sayin lol﻿", "time": "2 years ago", "author": "Nicolas D.", "cid": "UgjEzIz2gdGHY3gCoAEC.7zkIRHEihGU7-Qi3zVfV1k"},
{"text": "+Göktuğ Kaya Thats why I buy Japanese made ''things''. recommended.\nOh and money cant buy me love and all u need is love ---the beatles said that...\nyou could go to a prostitute and buy love And you need other things too.such as food and  water for example. so the beatles are wrong.﻿", "time": "2 years ago", "author": "kaptainbastard", "cid": "UgjEzIz2gdGHY3gCoAEC.7zkIRHEihGU70YAH0jUJpe"},
{"text": "so he's a liar and a plagiarist that made tons of money from other people's ideas with ties to State Intelligence Agencies and Anti-Trust accusations... Bill, Steve, Mark...  starting to see the trend...﻿", "time": "2 years ago (edited)", "author": "Santissimo", "cid": "UgiiWSnRtmNNfngCoAEC"},
{"text": "+santi781 Eat or be eaten, that's the main rule of capitalism (btw. science is not capitalism or business)﻿", "time": "2 years ago", "author": "Str1000ac", "cid": "UgiiWSnRtmNNfngCoAEC.7zJZ7hCQeAF718x2n7A2oy"},
{"text": "no, that's the main rule of Darwinism.﻿", "time": "2 years ago", "author": "Santissimo", "cid": "UgiiWSnRtmNNfngCoAEC.7zJZ7hCQeAF718ywbs6s7O"},
{"text": "+santi781 No, main rule of Darwinism is \"adapt\".﻿", "time": "2 years ago (edited)", "author": "Str1000ac", "cid": "UgiiWSnRtmNNfngCoAEC.7zJZ7hCQeAF718z4uc8REy"},
{"text": "no, that's natural selection.﻿", "time": "2 years ago", "author": "Santissimo", "cid": "UgiiWSnRtmNNfngCoAEC.7zJZ7hCQeAF7190mFm_gBT"},
{"text": "+santi781 ok, if main rule of Darwinism is to eat and not be eaten, what's the main rule of capitalism (in terms of real life, don't give me techincal definitions)﻿", "time": "2 years ago", "author": "Str1000ac", "cid": "UgiiWSnRtmNNfngCoAEC.7zJZ7hCQeAF7191llW1PEe"},
{"text": "the main principal of capitalism is ownership of one's labour and the ability to trade with it.   The reality we face however is one of corrupt capitalism (not actual capitalism).  Enron, Bernard Madoff, the 2008 meltdown, Libor, are all great examples of how rampant and systemic the corruption has become.﻿", "time": "2 years ago", "author": "Santissimo", "cid": "UgiiWSnRtmNNfngCoAEC.7zJZ7hCQeAF7196J3hGyzM"},
{"text": "+santi781 Have you ever heard \"in person\" how rich businessman talk or what he thinks of workers (I know it's not ok to generalize)?\nFor some CEOs workers and common people are monkies or peasants and should be trated as such. Also there is no real honor and etics among the rich. One wrong move and they will try to stab eachother in the back. That's what I meant by \"eat or be eaten\".﻿", "time": "2 years ago", "author": "Str1000ac", "cid": "UgiiWSnRtmNNfngCoAEC.7zJZ7hCQeAF7198D0K6_vJ"},
{"text": "yes.﻿", "time": "2 years ago", "author": "Santissimo", "cid": "UgiiWSnRtmNNfngCoAEC.7zJZ7hCQeAF719BE8VbeNr"},
{"text": "Larry is a little bitch,   Microsoft wouldnt even  wipe its ass with your sack of shit oracle product,  how'd that POS \"netbook\" turn out for you?﻿", "time": "2 years ago", "author": "ObamaBinLaden", "cid": "UgjlRY0J8vwQ4HgCoAEC"},
{"text": "Larry Ellison's story is the most inspirational I have ever learned about in my life. The scary thing is we look alike lol.﻿", "time": "2 years ago", "author": "D.Bond007", "cid": "UggFJj8b0aa21ngCoAEC"},
{"text": "I feel sorry for you having to go through life looking like this mongoloid.﻿", "time": "2 years ago", "author": "Andy Lester", "cid": "UggFJj8b0aa21ngCoAEC.7-H0Z7-SdV-70fy8z2Lfue"},
{"text": "lmao, never was an issue with the ladies, I have my eyebrows though﻿", "time": "2 years ago", "author": "D.Bond007", "cid": "UggFJj8b0aa21ngCoAEC.7-H0Z7-SdV-70g-lnSB1JL"},
{"text": "quit hating lol﻿", "time": "2 years ago", "author": "D.Bond007", "cid": "UggFJj8b0aa21ngCoAEC.7-H0Z7-SdV-70g-nfeH4t6"},
{"text": "+D.Bond007 Inspirational? You're aspiring to be a flaming asshole? Find something better to aspire to be.﻿", "time": "1 year ago", "author": "Leggo My Ego", "cid": "UggFJj8b0aa21ngCoAEC.7-H0Z7-SdV-8BGA76Mf03t"},
{"text": "This \"warrior\" glommed on to a standard IBM endorsed (SQL). That is his claim to fame.﻿", "time": "2 years ago", "author": "Orin", "cid": "UggVqanLv6mhbngCoAEC"},
{"text": "Do all you complainers and critics think billionaires would have ever gotten to where they knew they wanted to be if they stayed in the bathroom crying every time someone  said, No..or stop.. you can't or shouldn't do something?? Really ?﻿", "time": "2 years ago", "author": "Mcpsagent King", "cid": "Ugin2n4LDfYK83gCoAEC"},
{"text": "He really doesn't care what you think about him...he's made it and you probably haven't ...yet?﻿", "time": "2 years ago", "author": "Mcpsagent King", "cid": "Ughu30nMsWtV83gCoAEC"},
{"text": "After reading all the comments about billionaire lifestyles and accomplishments it is safe to say that 100% of these over acheivers learn very quickly to ignor their critics, focus completely on their vision or goal and not be concerned or allow themselves to be boxed in by other peoples visions of limitations.  THAT IS HOW SUCCESSFUL PEOPLE ACCOMPLISH WHAT OTHERS STILL CONTINUE TO CRITICIZE AND HAVE LITTLE OR MUCH LESS TO SHOW FOR THEIR  OWN ATTITUDES ..Gee  wiz..go figure :)﻿", "time": "2 years ago", "author": "Mcpsagent King", "cid": "Ughj3H3p-e05I3gCoAEC"},
{"text": "Agree. One won't achieve anything in life by compromising to others all the time.﻿", "time": "4 months ago", "author": "A Cool Name", "cid": "Ughj3H3p-e05I3gCoAEC.7-H0Z7-Gg_b8XQjBhqov1v"},
{"text": "subs please.......﻿", "time": "2 years ago", "author": "shadow ranger", "cid": "UgjjqO3ULGv7z3gCoAEC"},
{"text": "Larry Ellison is Satan. Astonishingly overpaid, like most American CEOs.﻿", "time": "2 years ago", "author": "surfingsuicune", "cid": "UgjZGR5X5yi7o3gCoAEC"},
{"text": "+surfingsuicune Satan is cool though. And didn't demand money and shit. Actually, of all the gods in the bible, he killed the least number of people.﻿", "time": "2 years ago", "author": "Zellig", "cid": "UgjZGR5X5yi7o3gCoAEC.7-H0Z7-7t1d70WvpnGne8j"},
{"text": "+surfingsuicune He created the company, how he could be overpaid :D ?﻿", "time": "2 years ago", "author": "horneproject", "cid": "UgjZGR5X5yi7o3gCoAEC.7-H0Z7-7t1d71PbfhpK3Uo"},
{"text": "+horneproject Compared to other first world countries' CEOs, CEOs in this country are extremely well compensated. You can make your own value judgments about how much is too much, but CEO salaries have gone up precipitously since 1970 while employee salaries have stayed stagnant.﻿", "time": "2 years ago", "author": "surfingsuicune", "cid": "UgjZGR5X5yi7o3gCoAEC.7-H0Z7-7t1d71PdHrozeGJ"},
{"text": "Well exactly and i don`t see why not to be that way.﻿", "time": "2 years ago", "author": "horneproject", "cid": "UgjZGR5X5yi7o3gCoAEC.7-H0Z7-7t1d71Pe-uQ0P6I"},
{"text": "In a free market, people are paid what they're worth (ideally). I don't think any one person is worth $100 million a year. It's not a knock on their status as chief executive, or a knock on their qualifications; it's just unreasonable, in my mind, to pay out a 9 figure salary to anyone, for anything.﻿", "time": "2 years ago", "author": "surfingsuicune", "cid": "UgjZGR5X5yi7o3gCoAEC.7-H0Z7-7t1d71PkN8No39i"},
{"text": "You realise if he is the founder he pays himself which is OK.\nElse the stock holders decide the CEO salary.\nAnd yes if the sales go up and the cash flow is good i don`t see why someone can`t get 100$m a year﻿", "time": "2 years ago", "author": "horneproject", "cid": "UgjZGR5X5yi7o3gCoAEC.7-H0Z7-7t1d71PowlTewPK"},
{"text": "Overall company performance is determined by more than just the CEO, though. There's proportionality in middle management and even other upper level execs when it comes to performance versus pay. Then again, it's harder to quantify a CEO's performance. In theory, this is why a board of directors exists. If you want an example of CEO pay being detached from corporate performance, look at Sprint: Dan Hesse earned around $45 million in 2013, and Sprint had been losing cash and losing subscribers for years. They weren't doing well, but the CEO was well compensated, regardless. Something is very wrong about that.﻿", "time": "2 years ago", "author": "surfingsuicune", "cid": "UgjZGR5X5yi7o3gCoAEC.7-H0Z7-7t1d71PpXSP0oBo"},
{"text": "Well yes, CEO is definitely not the only factor, but there is almost no other position that rely on executive decisions for the future of the company as the CEO. So like in the case of Larry Ellison who created that 200B$ (market value) company, i don`t see why not to have high pay check.\nAnyway i don`t think that most CEO`s made their fortune through the paycheck, but through company stocks and other options. Most of the CEO`s like Mark Zuckerberg monthly salary is 1$, so yes...\nIn the case of hiring CEO, please be sure that the board would not pay more than needed (as they think) to the CEO becouse is their money. That was the case in which Steve Jobs was fired from Apple.﻿", "time": "2 years ago", "author": "horneproject", "cid": "UgjZGR5X5yi7o3gCoAEC.7-H0Z7-7t1d71PrWKNCEtj"},
{"text": "+surfingsuicune please don't insult Satan, Ellison is just egoistic ruthless businessman﻿", "time": "2 years ago (edited)", "author": "Str1000ac", "cid": "UgjZGR5X5yi7o3gCoAEC.7-H0Z7-7t1d72kTgz1Gk8C"},
{"text": "+Jay Jone funny you mentioned the \"communist country\" because most of todays US CEO's earn their big paycheck and bonuses thanks to cheap but good workers in China because they find amercan workers to expensive and some stupid and uneducated. You should check US National Debt clock.﻿", "time": "2 years ago (edited)", "author": "Str1000ac", "cid": "UgjZGR5X5yi7o3gCoAEC.7-H0Z7-7t1d72kU4642zzE"},
{"text": "Larry Ellison is the one with a giant ambitions, shrewd, active with strength.  He has endless energy,likes endless activities.  He is extremely sesitive with a strong revenge heart.  He is a top marketing guy, However, he also has a strategic management skills too.  He will make sure nobody will be dared to screw him up.  He is certainly deserves his success.  Wining is his desire.  Many people has the same wining desire, but missing the rest of others.  May the self successful person from the scratches, must have the characters like him? Each person is different.  He was gradually better only after 32.  It was pretty hard before 28 though. :)﻿", "time": "2 years ago", "author": "Duker Wong", "cid": "UghCz8-c9r-z-ngCoAEC"},
{"text": "please go back to your sweatshop.  while you were posting that, 3 more of your workers suicided by splattering themselves on your production floor.﻿", "time": "1 year ago", "author": "Carl Hopkinson", "cid": "UghCz8-c9r-z-ngCoAEC.7-H0Z7-CdBn8A-086KFjOS"},
{"text": "Real Bo$$!!﻿", "time": "2 years ago", "author": "*GÊLAWDÊOWŠ*", "cid": "UggCdADi8iqINngCoAEC"},
{"text": "Nice guys finish last﻿", "time": "2 years ago", "author": "Michael Matt", "cid": "UgiFIttCKSS-dHgCoAEC"},
{"text": "Fuck Oracle﻿", "time": "2 years ago", "author": "monolyth421", "cid": "Uggig2FxTtaqNHgCoAEC"},
{"text": ">He's the samurai warrior of sillicon valley\nClose tab﻿", "time": "2 years ago", "author": "Justin C", "cid": "Ugh5XZcKV_cv0XgCoAEC"},
{"text": "Seeing as how no one uses Oracle or Solaris anymore, it seems to me that Larry's little empire is more or less over.\n\nTough luck, Larry.  Your product was never worth your license fee in the first place.﻿", "time": "2 years ago", "author": "Xdray Gul", "cid": "Ugho_joq-A5_-ngCoAEC"},
{"text": "nosql databases are popular for large data, processing and warehousing that Oracle used to be for.  Hadoop and MongoDB are free on this front.  If you're doing transactional stuff via SQL, you use postgres, or if you're married to the idea of paying for software, sybase-- which is about a third the cost of an oracle license on the same hardware/cloud architecture.﻿", "time": "2 years ago", "author": "Xdray Gul", "cid": "Ugho_joq-A5_-ngCoAEC.7-H0Z7-1m_X7-_fwlG4lIy"},
{"text": "No one?  Oracle did a record 38 Billion last year.  You can hate Ellison, Oracle, or yourself, but you can't alter reality.  Oracle is as big as it gets and still increasing year-over-year sales.﻿", "time": "2 years ago", "author": "aaron harrison", "cid": "Ugho_joq-A5_-ngCoAEC.7-H0Z7-1m_X70iQDKI8fCq"},
{"text": "Now go look at how many new customers they acquired last year.﻿", "time": "2 years ago", "author": "Xdray Gul", "cid": "Ugho_joq-A5_-ngCoAEC.7-H0Z7-1m_X70o_BeUTzZv"},
{"text": "", "time": "2 years ago", "author": "USMAN ASIF", "cid": "Ughljtt1gK9PiHgCoAEC"},
{"text": "You also have to be a ruthless, super-selfish, lying thief. TV loves to show white people as the typical super rich people, but according to Vanity Fair and the Jerusalem Post, 70-80 of the 100 richest people on the planet are Jewish. Most people call me an \"antisemite\" when they hear that, but they have no facts and are just reacting as they have been programmed to Don't be a stupid, spitting Jackass like those people, just look it up and see for yourself.﻿﻿", "time": "2 years ago", "author": "Vaclav Haval", "cid": "UghhWzI_zdjc0HgCoAEC"},
{"text": "Oracle products are complete crap. You will be very frustrated person work with any of Oracle's products, specially anything Oracle Fusion Middleware. You have been warned.﻿", "time": "2 years ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC"},
{"text": "Ellison doesn't know dick about programming or databases, he is just a slimy salesman. This video is typical Jewish propaganda. I am an Oracle-certified developer and, I am told by the best programming consultants, a very good programmer. The Oracle DB is the best in the world, but everything else is just overly-complicated crap sold to gullible corporations who don't don't know beans about computers. If they knew the difference between good and bad software, Oracle wouldn't sell a single product: absolutely nothing except the DB.﻿", "time": "2 years ago", "author": "Vaclav Haval", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr7-HOC5OABSt"},
{"text": "+Vaclav Haval I couldn't have said it better myself.﻿", "time": "2 years ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr7-HOoGUx3Zu"},
{"text": "I sell equipment to businesses. One of my customers is a major fortune 500 company, and they recently switched to an online purchasing system where vendors can login to view purchase orders and submit invoices. It is the worst, most convoluted \"system\" I have ever used. Nothing makes sense, half the functions don't even work, and the UI looks like something from the Windows 3.1 era. Finally I thought, who the hell MAKES this? Yep, Oracle.﻿", "time": "2 years ago", "author": "10forRP", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr7-p4MYHwgjS"},
{"text": "+untseac Sorry if I sound like a leyman, but how does oracle stay in business if their product is so shit, would'nt customers just go to another competitor, so oracle gets run out of business...?﻿", "time": "2 years ago", "author": "Rashid Sa'di", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr71MBtp8saEj"},
{"text": "+Rashid Sa'di because often the ones who decide what kind of software to use are not those who actually develop. Oracle guys usually start of by impressing those who haven't touched their products by convincing that it's going to increase productivity and maintenance and the client falls for the bullshit. It doesn't work long term, however, but then its too late for the client and oracle has enough time to come up with the next crappy product.﻿", "time": "2 years ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr71MQeZB7ShU"},
{"text": "+Vaclav Haval If you read up about him before he started the company he always had an interest in programming and he too was really good at it and much faster than everyone else.﻿", "time": "2 years ago", "author": "PC Master Race", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr74-OO4CLHaV"},
{"text": "+Dave J I read that in Wikipedia. What's funny Oracle's aggresivess was there since day one. I'm not sure about software quality I bet its the same. I don't really judge people, to me Larry could be the best guy in the world but Oracle's software would still be crap to me. I finally got rid of their shitty software BTW and its a huge relief. ﻿", "time": "2 years ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr740R4LFe4VP"},
{"text": "+untseac If Oracle wasn't american company it would be out of business long time ago.﻿", "time": "2 years ago", "author": "Str1000ac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr749BLncqZLp"},
{"text": "+Str1000ac no doubt about it, USA has always had a huge market and Americans have always been entrepreneurs. In a small country there wouldn't be the market for such company to survive. There was no internet to help the world know about your software. Things are different now, small companies should fight with quality.﻿", "time": "2 years ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr749QbhE9Gf0"},
{"text": "+untseac Not just that. You think US military is everywhere around the world only to protect peace and freedom. No, their primary goal is to protect american interests and dominance.﻿", "time": "2 years ago (edited)", "author": "Str1000ac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr749SMGnvrXk"},
{"text": "+Str1000ac that may be true but I choose to give the benefit of the doubt. It would be innocent to totally discard that hypothesis but I have no evidence of such. Besides I can't ignore the merits of US, they did a lot for the world.﻿", "time": "2 years ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr74Ao270rgkg"},
{"text": "+untseac Operetta is so bad it made me quit my job, I learned Server 2012 in a couple of hours, but after 2 months Operetta was still ruining my days.﻿", "time": "2 years ago", "author": "David Bourke", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr775QgPl8t24"},
{"text": "+Sam Boorstin VirtualBox and Java are open-source and were bought, both good. Of course if Oracle fucks up FOSS won't care, there will be a fork like what happened with OpenOffice and MySQL.\n\nSolaris, also bought from Sun, has some good points like zfs and dtrace but its so archaic its not even competition against anyone. There are many open-source forks of Solaris but there's really not much of a point when Linux is superior in many ways.\n\nOracle Linux is a piece of crap. I still wonder how they fucked up an already good OS. What's the point of Oracle Linux anyway? Its just a RedHat in disguise and its worse.﻿", "time": "2 years ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr79GWkoi_-xe"},
{"text": "+Sam Boorstin The database is definitely their best product. Some bad points though are the installer, tools like SQL Plus and non standard and not supported SQL (like OFFSET/FETCH/LIMIT but 12c supports it now). Still a decent database, no doubt there.﻿", "time": "2 years ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr79LoiEnFFl7"},
{"text": "+Sam Boorstin THANKS SO MUCH﻿", "time": "2 years ago", "author": "Larry Ellison", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr7ADGe3TMIKa"},
{"text": "+untseac I agree. Their database is state of the art, and an amazing product.  All the software they sell besides that is horrible to use, horrible to program, horrible to manage.  Just the patching used to be a nightmare back in 2008 when I worked with them; how come they didn't made(or buy) a tool for it, like yum or apt-get?? I don't know if things have changed for the better, but since they still struggle just with making elastic computing, I doubt it.\n\n\n50+ chained patches just to fix a single bug, that had to be installed ONE BY ONE, was indeed a nightmare of days and nights installing, and begging for it to not just kill the server.﻿", "time": "2 years ago", "author": "gadget00", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr86TPAIzfYlq"},
{"text": "+gadget00 Nothing changed at least in Oracle Fusion Middleware 12c. You still have to apply patches to all machines on all of the software stack. I used to work with ADF, BPM and SOA and it was a pain in the ass. Fortunately my company allows to switch jobs inside and so I did.﻿", "time": "2 years ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr86TXCLYpCAS"},
{"text": "+10forRP That's Oracle iSupplier module from EBS R12.\nBut then, SAP is as horrible as Oracle and even more complicated to use. MS is good, neat and clean but lacks scalability. So Oracle is the only popular option we're left with﻿", "time": "1 year ago", "author": "Shashank Rathi", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr8D2eS4NFTVW"},
{"text": "+Shashank Rathi by Oracle is the only popular option do you mean the Oracle database?﻿", "time": "1 year ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr8D2qoc9jV2R"},
{"text": "No ERP, the market for which is dominated by the big 3- SAP, Oracle and Microsoft﻿", "time": "1 year ago", "author": "Shashank Rathi", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr8D2w84XLvbQ"},
{"text": "+Shashank Rathi ok. It's the same with SOA so I get what you mean. Unfortunately Oracle software is always convoluted. I'm not a fan of Microsoft but they can do much better software than Oracle.﻿", "time": "1 year ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr8D2z0xN9wyd"},
{"text": "+Str1000ac interesting assertion.  Could you expand on that?﻿", "time": "1 year ago", "author": "gadget00", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr8D4a884di8X"},
{"text": "^﻿", "time": "11 months ago", "author": "westganton", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr8OYO0lldgdM"},
{"text": "I don't think they're completely crap, Only real Oracle professionals should use Oracle because there is a steep learning curve.  A monkey with only a little training can turn MySQL on and get it going and it will most likely perform almost as good as it ever will go  (minus data corruption which the DBA will still need to spend a lot of time learning how to prevent.)\n\nOracle punishes incompetence by needing more hardware when you do dumb things.    (being dumb costs a lot on Oracle)  MySQL is very forgiving.\n\nThough I will happily use PostgreSQL before inflicting the pain of having to use MySQL.  I might pick flat files if I only had a choice between MySQL and flat files.\n\nIt has the most advance partitioning and sub partitioning implementation by far.  Way more options for customizing business solutions.   Makes PaaS work a breeze. \n\nThe most advance optimizer that can handle every sophisticated way to model data (except graph data.)   This includes trivial things like nested sub queries which MySQL still hasn't figured out last time I checked to more advance things like recursive queries which should not even be attempted in MySQL.\n\nYou do not have to \"pause\" the database when doing backups in Oracle.    There are lots of MySQL pros that know all the secrets to minimize database corruption and I appreciate that.  There is still something that makes me question MySQL as being mature if you have to spend most of your DBA time learning how to prevent data corruption.  I would rather focus on learning how to optimize my business app.﻿", "time": "7 months ago", "author": "Li Yon", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr8Tk5cttfUc-"},
{"text": "+Li Yon you do realize that Oracle does not only have Oracle DB right? I'm talking about every product. Oracle DB is the best product they have. Even than it's a complete mess in many aspects. I don't even know why you're comparing with MySQL since that is also an Oracle product now.﻿", "time": "7 months ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr8TkKOJMcar-"},
{"text": "Oh I'm sorry, I thought my first statement would already justify the entire question. My comparison with SQL was merely to just state a couple of facts. You may think of it as a mess, but their \"mess\" of product lines drives results if you know how to use it. I don't think you should condemn a product just because it is hard to use. If you master it, its powerful.﻿", "time": "7 months ago (edited)", "author": "Li Yon", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr8TkLCQdnG9X"},
{"text": "+Li Yon sure. I have no problems with the DB even though it has some quirks. So you're just comparing DBs, that's fine by me.﻿", "time": "7 months ago", "author": "untseac", "cid": "Ughpxz1Urm_wuHgCoAEC.7-H0Z7-E3dr8TkLRzZsoIk"},
{"text": "He maybe the biggest dingle-berry billionaire, but Oracle software still is crap.﻿", "time": "2 years ago", "author": "mraratapa", "cid": "UgjptCvs5Lf7fXgCoAEC"},
{"text": "Omg this is literary the same thing as Steve jobs﻿", "time": "2 years ago", "author": "Cameron O.", "cid": "UgjI8vbQYyZS03gCoAEC"},
{"text": "But this guy can code \nSteve jobs coded a bit﻿", "time": "2 years ago", "author": "imran kahn", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT273lWz8bGuaC"},
{"text": "Not like larry elision﻿", "time": "2 years ago", "author": "imran kahn", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT273lX1eDVDP3"},
{"text": "+imran kahn\ntrue﻿", "time": "2 years ago", "author": "Cameron O.", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT274XteL6ARYT"},
{"text": "+imran kahn\nLarry elision was definitely not as good as steve jobs, steve jobs was WAAAY more innovative. He had the idea for an ipad 30 years before it came out.  Larry elision only did like 1 thing﻿", "time": "2 years ago", "author": "Cameron O.", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT274XtqcdLadH"},
{"text": "I agree﻿", "time": "2 years ago", "author": "imran kahn", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT274YSNCIkTCn"},
{"text": "With elison product it's hard to change it tht much \n\nSteve jobs was dealing with hardware so has bigger chance to change it﻿", "time": "2 years ago", "author": "imran kahn", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT274YSioeza1g"},
{"text": "+imran kahn\ntrue﻿", "time": "2 years ago", "author": "Cameron O.", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT274Zb5k7K3lU"},
{"text": "+imran kahn What?! Whether it's H/W or S/W it is just the raw material for the next-big-thing. There is no excuse for not advancing and innovating - barriers are a mental problem, not a tool problem.﻿", "time": "2 years ago", "author": "DataWaveTaGo", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT279QCBEBRAvZ"},
{"text": "Steve Jobs on steroids minus the fanboys. At least Steve Jobs forced his minions to complete a product before selling it. Larry Ellison sold products that weren't even created yet. Psychopathic liar.﻿", "time": "8 months ago", "author": "John L", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT28SGngIundD1"},
{"text": "+John L Steve Jobs was WAY more successful though.﻿", "time": "8 months ago", "author": "Cameron O.", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT28SKMuy-QFho"},
{"text": "How so?﻿", "time": "8 months ago", "author": "John L", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT28SKTarSU22n"},
{"text": "Funny how people are underestimating Ellison yet praising Jobs.\n\nJobs himself considered Ellison as his mentor.\n\nEllison is way more successful and more influentional than Jobs. Ellison sells relational database management which is a technology used by nearly all the major companies and government officials on earth for DECADES. None of Apple's products ever reach such a user base.\n\nThe only person in Silicon Valley who could be comparable with him is Bill Gates; these guys are the two top dogs in the valley.\n\nNow think about it, Ellison's products appeal to world's leaders and executives. Apple's products mostly appeal to teenagers.\n\nAlso Ellison was never a skillful programmer or any sort of engineer(just like Gates, he lied about that. Ellison is one big liar). Some friends of mine who worked with Ellison told me about it.\n\nPersonality wise, Ellison is way worse than Jobs; he has a history of overpromising, abusing competitors, cheating on women, manipulating his employees, betraying his business partners, raiding smaller companies, ripping his customers off and heck, he did even try to rob the government; basically a more hedonistic version of Bill Gates, albeit not as greedy but a lot more cunning and aggresive. Jobs's sins is only goes as far as lying and cheating his customers and employees-which is also a terrible thing but nowhere near as far as Ellison's or Gates's.﻿", "time": "4 months ago", "author": "A Cool Name", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT28XQj4mlEy6d"},
{"text": "Cameron O. Op﻿", "time": "3 weeks ago", "author": "neweh1", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT28aL5eoyiSCI"},
{"text": "Yeah I hope he uses homeopathy when he gets a disease like the late Steve Jobs.  I smiled when he died.  Psychopaths are not humans!!  It's just that simple.﻿", "time": "3 weeks ago", "author": "David Hume", "cid": "UgjI8vbQYyZS03gCoAEC.7-H0Z7--GT28aVuGr1J43X"},
{"text": "I am listening to....\"We are the jet set ...Society!\" and ......I have been to Hawaii about 10 times....and....I havee visited England...and I can do a little British accent....and my half brother did it...and he studied in Oxford....and we are not so good looking Amerasians...not the model type....the short kind....but one brother is a litle tall...and....I have been to both Coasts of USA....and I have been to Mexico and Dominican Republic....and....?????﻿", "time": "2 years ago", "author": "Joan Ton", "cid": "Ugi_SN40IlB4kHgCoAEC"},
{"text": "HATERS, HATERS EVERYWHERE......Geeez people can't live their miserable lives without hating on a person who started from the bottom and reaching for the stars.﻿", "time": "3 years ago", "author": "", "cid": "UgjcbBjnsErN1ngCoAEC"},
{"text": "I know right. This guy is an asshole. That's why I love him and that's why he's worth more than all these haters combined.﻿", "time": "2 years ago", "author": "Will Perry", "cid": "UgjcbBjnsErN1ngCoAEC.7-H0Z7-UwLc70hHmAILTKC"},
{"text": "All you softies need to understand, him being an \"asshole\" or \"douchebag\" is just business.﻿", "time": "3 years ago", "author": "Eduardo Olazaba", "cid": "Ugj_PfJQ-oigzHgCoAEC"},
{"text": "That he never innovated anything, only built on others ideas didn't seem too important to the makers of the movie. That his goals were always self-centered, and ego motivated didn't occur to be interesting. For some reason americans tend to estimate only bottom lines in dollars, and most nothing else. An artist isn't worth noticing unless he sells his art in millions, and a Software person is \"a software giant\" despite the huge misery his mediocre and uninteresting software brings upon his clients. \n\nSure, \"Business\" is an art of its own, but I think there are enough fascinating subjects more interesting then the ruthless march of one to power and money.\n\nOne little thing - Larry Ellison's face looks always miserable. even on the hugest yacht in the world. He always looks insulted on something. I think he is miserable, and he will die miserable. He swapped happiness for money. Completeness for money, and even money for money.﻿", "time": "3 years ago", "author": "Motti Shneor", "cid": "UggE4BftSwwUm3gCoAEC"},
{"text": "didn't expect a youtube comment to be this serious and deep﻿", "time": "1 month ago", "author": "Nisarg Bhatt", "cid": "UggE4BftSwwUm3gCoAEC.7-H0Z7-A_7o8_JWwP_OVEB"},
{"text": "Americans are a culturally bankrupt brainwashed group of psychopathy defenders.  This guy is a psychopath.  He didn't choose to be inhuman, he was born that way.﻿", "time": "3 weeks ago", "author": "David Hume", "cid": "UggE4BftSwwUm3gCoAEC.7-H0Z7-A_7o8aVv-s_1Xjq"},
{"text": "To all the Larry bashers here I say: What did you do for the world? It is because of the Steve Jobs's, Bill Gates's and Larry Ellisons of this world that we live in the wealth we live in today. Some people may say to hell with this wealth, but I am merely enjoying it with huge respect to all technological leaders in this world. And ofcourse people will call me 'shortsighted' now. Who cares....﻿", "time": "3 years ago", "author": "Robbert Naastepad", "cid": "UggWnOU0v0M3oXgCoAEC"},
{"text": "Robbert Naastepad No, it's because of the Richard Stallmans and Linus Torvaldses that we live in the wealth we live in today.﻿", "time": "2 weeks ago", "author": "Will Mengarini", "cid": "UggWnOU0v0M3oXgCoAEC.7-H0Z7-MI1k8aheLyhz85k"},
{"text": "My ego sounds a lot like Larry Ellison.. can't tell if that's good or bad ﻿", "time": "3 years ago", "author": "Roman might", "cid": "Ugg2mxXtSPVSyngCoAEC"},
{"text": "Americans and Indians are pathetically brainwashed into believing that billionaires are respectable. Its thanks to their obscenely and UNDESERVED wealth there is poverty among the masses. No wonder the elite despises the masses for refusing to think. Ellison is just another Jewish billionaire cunt.\n\nWe're living in a dangerous world when billionaires are admired and the poor are questioned.﻿", "time": "3 years ago (edited)", "author": "Invesigator", "cid": "Ugj3VrT405nJk3gCoAEC"},
{"text": "Billionaire Samurai Warrior of Silicon Valley, please hire different marketing people, as this looked like a joke from the Silicon Valley tv show.﻿", "time": "3 years ago", "author": "wastingtimecat", "cid": "UgjJwSVZjTPxjHgCoAEC"},
{"text": "Let me tell you something: I have a client who is VERY rich. Not nearly rich as this guy of course, but he is a billionaire. He told me something during one of our conversations: \"Brother if you have a car, if you own your own house if you are healthy and have your loved ones with you, then you are happy and you should be happy. Money alone NEVER brought me happiness and peace\". Don't get me wrong there is nothing wrong with being rich and I respect this man. But when I look at this guy I can see his nervous, somewhat edgy looking face (or facade). Apparently his wealth is not nearly as successfull as it should be in terms of bringing peace and serenity. Compare him to Bill Gates or Bernard Arnault or Warren Buffett etc. you'll understand what I mean. Best regards to all.﻿", "time": "3 years ago", "author": "Göktuğ Kaya", "cid": "Ugh0LxXtY6zjN3gCoAEC"},
{"text": "BLAH BLAH BLAH BLAH!!! cause you can still be broke and not have love and you can still be rich HAVE LOVE!!﻿", "time": "2 years ago", "author": "PharaohII", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G728eOtfmE3r"},
{"text": "+PharaohII I agree and I did not say anything that would suggest otherwise. Maybe you can re-read my comment. ﻿", "time": "2 years ago", "author": "Göktuğ Kaya", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G728g9DcJGWC"},
{"text": "Beutifully said﻿", "time": "2 years ago", "author": "gnarmarv2", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G72AB_NVXOSw"},
{"text": "It's NOT about \"peace and serenity\" because it's NOT about the money.  It's about his competitive megalomaniacal ego - which in the practical world he can actually back up.﻿", "time": "2 years ago", "author": "Bob Boberson", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G72Kncjc5XDC"},
{"text": "+Bob Boberson Accurate, dead on argument right there. The world nowadays encourages and instills wild, almost predatory competition with no regard for human spirit and life in some terms and it is only natural guys like these with over inflated egos who are too full of themselves almost to the point it is unhealthy have success in business life. There must be competition for better services and products but not aggressive, monopoly aiming competition like the mindset of this guy. As a lawyer I can say it is also legally forbidden.﻿", "time": "2 years ago", "author": "Göktuğ Kaya", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G736Kft_p9RN"},
{"text": "+Classicist I totally agree with your comments. In my opinion the whole point of comparing Ellison to Jobs is absurd. As a human, as an innovator, as a kind spirit, as a human without complex issues Jobs was light years away from Ellison.﻿", "time": "2 years ago", "author": "Göktuğ Kaya", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G74ZDrQm5Z-e"},
{"text": "+Göktuğ Kaya great comment, definitely agree. When people tell me that money doesn't buy happiness, they are right in a sense. Money won't buy fulfillment or happiness. But the lack of money can be a deterrent to happiness. With money you can do a lot of great things for people.﻿", "time": "2 years ago", "author": "that guy", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G74ZL1t0FHm9"},
{"text": "+Göktuğ Kaya Shut up! You are jealous of him.﻿", "time": "2 years ago", "author": "Daniel Teshome", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G74_GKIGm9cA"},
{"text": "+Göktuğ Kaya Money isn't there to bring happiness or piece. It's there to not disrupt those. \"Money can't buy happiness\" has always been one stupid argument.﻿", "time": "2 years ago (edited)", "author": "What the fuck are you doing reading my username?", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G75UJIGmVoJk"},
{"text": "+Jay Jone Don't get me wrong. Money IS necessary but it is obviously not the only thing you need to be happy. If money is enough, why are so many super-rich people committing suicide with drugs and so on? Look at Robin Williams for example...﻿", "time": "2 years ago", "author": "Göktuğ Kaya", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G76p4brGEMHQ"},
{"text": "Certainly it isn't about money, but peace is not for everyone either.\nI live in normal family, money kind of make my life more comfortable but it doesn't make me happy and so does peacefulness\nThere is nothing wrong with my family, they live a peaceful normal happily life, so do I although I live I peace, I am never happy.\nI always feel restless, live in peaceful family or with more money doesn't cut it either.\nI always feel like I lack passion and my happy and peaceful condition doesn't make me happy at all.﻿", "time": "2 years ago", "author": "Zonatewalter7", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G770P1iKtR6r"},
{"text": "+Zonatewalter7 Being docile and peaceful are 2 different things.﻿", "time": "2 years ago", "author": "Vito Cosentino", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G77ztEyQ7Qlm"},
{"text": "+V TheC No it isn't, but I am a very restless person, I don't mind a peaceful life but I certainly don't want to live my whole life peacefully, I also do not wish to die peacefully, happily in my bed.\nI actually want to have a target or a purpose, something a nemesis or goal, that I would hate or force me to direct my energy to archive it, and dying while doing that is a lot more satisfying.﻿", "time": "2 years ago", "author": "Zonatewalter7", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G77zvGMFpoYR"},
{"text": "+Zonatewalter7 No what isn't?﻿", "time": "2 years ago", "author": "Vito Cosentino", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G77zvOD3PHFi"},
{"text": "+Göktuğ Kaya \" If money is enough, why are so many super-rich people committing suicide with drugs and so on? Look at Robin Williams for example...\"\n\nlol sometimes there are personal problems that nothing can fix. And Robin Williams is far from the majority of \"super-rich people\". Actually he can't be considered, throughout any point of his career, to be \"super-rich\".﻿", "time": "2 years ago", "author": "What the fuck are you doing reading my username?", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G77zz9c2fxV9"},
{"text": "+Göktuğ Kaya 'Money isn't everything, not having it is'﻿", "time": "2 years ago", "author": "Joe Womeldorff", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G783FgzJjZQx"},
{"text": "+Göktuğ Kaya - just as an FYI - he's 70 years old :)﻿", "time": "2 years ago", "author": "Sergei Malynovskyi", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G78c107UeowN"},
{"text": "+Göktuğ Kaya 14:23 he seemed to be personally disappointed that he wasn't wealthier than Bill Gates. Right there! That is the problem. He wants money not for a better, fulfilling life in which he can have everything money can buy. He wants money because he wants to top some chart. This is not healthy.﻿", "time": "2 years ago", "author": "Göktuğ Kaya", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G78cJjrtfpUr"},
{"text": "+Göktuğ Kaya Topping a chart is a horrible excuse for competition. Money making has to be a hobby. Like music (be it playing, recording, or listening to various genres) or driving fast cars.\n\nIf someone puts up a wall in front of himself in the manner of \"wanting to top a position\", that is a goal based on lustful, primitive desire. \n\nThat is just a reason-less milestone, hence not bringing any feeling of usefulness, so the reward feels empty.﻿", "time": "2 years ago", "author": "What the fuck are you doing reading my username?", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G78cpMc-d3kW"},
{"text": "Kardeşim sen nerden bilebilirsin ki kafadan uydurmuşsun﻿", "time": "2 years ago", "author": "Ahmet Can Pierrefontaine", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G7AF5haJtet-"},
{"text": "+Göktuğ Kaya bull shit﻿", "time": "2 years ago", "author": "mustapha alausa", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G7AyMqykjPUs"},
{"text": "+Göktuğ Kaya Family, Health and no Debt is what matters. Not fancy cars, big villas, personal jets. Have a  normal house with a happy family.﻿", "time": "2 years ago", "author": "Iron Rottweiler", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G7CTjbtzv4dR"},
{"text": "+Göktuğ Kaya YOU ARE SO RIGHT AND ALL YOU HAVE SAID ARE TRUE﻿", "time": "2 years ago", "author": "Larry Ellison", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G7D-RIRLcXMo"},
{"text": "+Göktuğ Kaya Super statement !!﻿", "time": "2 years ago", "author": "Mahek Mehta.", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G86TGGLPbJZD"},
{"text": "You are so right, but did a billionaire really talk to you? I mean really, i really want to know his name for research purpose, if you are being honest please let me know his/her name.﻿", "time": "2 years ago", "author": "stundown", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G88FNWke0aRw"},
{"text": "+stundown Yes I am an attorney at law in Turkey and I have a Saudi Arabian billionaire client who is a real estate investor. I cannot disclose his name for confidentiality purposes plus he has a VERY generic name you couldn't find him on Linkedin etc. anyway. But trust me I AM being honest. I have no reason to lie.﻿", "time": "2 years ago", "author": "Göktuğ Kaya", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G88KD-Vc9zWb"},
{"text": "saudi arabians are such pieces of shit﻿", "time": "2 years ago", "author": "Iron Rottweiler", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G88Kf2pevUPQ"},
{"text": "Watch Siliccoon Valleey onlineee here => https://twitter.com/aae0ff07852d7796d/status/824453837792567296﻿", "time": "10 months ago", "author": "yakup yasin yılmaz", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G8PC3ADuRSK4"},
{"text": "If I have 10 million  I m happy with that .﻿", "time": "9 months ago", "author": "Ahmed Hamed", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G8R3-CXOUKUv"},
{"text": "Göktuğ Kaya I get you 100%﻿", "time": "9 months ago", "author": "Brandon Worix", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G8REWAsH85A8"},
{"text": "Really niccceee mooovieee. I found it here => https://twitter.com/2b325b39a6ad4fdb6/status/824453837792567296﻿", "time": "9 months ago", "author": "Ánh Tuân Đẵng Nguyên", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G8RFJnYf-UJI"},
{"text": "I know what you mean. I've also had the privilege of talking to a very rich person that actually cursed the money and the grip it had on him. \"It's killing me\" is what he said. He of course didn't mean that money itself is bad but in his life it had grown to become a stakeholder for him and his family, he always had to watch out for every single movement on the stock market and in all the markets he's involved in. People like that can never leave that to other people. It's a constant stress. He also talked about the urge to be number 1 and that his drive and motivation wasn't cash but to be an industry leader, to never loose to the competition. He saw this as a sport and he would never be able to relax cause it was never a question about enough. It was always about more. It's tightly connected to power and self esteem. To win and to concur.﻿", "time": "8 months ago (edited)", "author": "ventende", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G8Rc_Dpq9iaJ"},
{"text": "dude shut up it all depends on the person ambition and drive and creation and innovation is key for our global economy larry has created thousands thousand of good high paying jobs that feed familys and add money to our global economy this isnt about him being rich nervous and unhappy youre friend is a billionaire okay who cares and wheres proof hes done more for society human kind global economy jobs and feeding familys who get paychecks at his company  than most people ever will in thier life time you make it seem as if its easy and simple its not its fucken hard dude shut up﻿", "time": "6 months ago", "author": "FX Greenback", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G8USZJF-9aUR"},
{"text": "He only said that to prevent you and whoever he'd have told about it to be as ambitious as he or other billionaire is when it comes to money. That means he's just minimizing a potential competitor. Of course those billionaires will try to prevent people from being their competitors as much as they can. If everyone seriously wants to be as rich as they are they would have a harder time staying on top.\n\nDon't let those rich people fool you. They're just saving their own ass after all.\n\nPeace.﻿", "time": "4 months ago", "author": "A Cool Name", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G8WS8yUvWjdd"},
{"text": "You say its  your client  and I tell you it's your boss.﻿", "time": "4 months ago", "author": "Teboho Moloi", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G8Wirw-ogdaP"},
{"text": "Brilliant way to justify mediocrity!﻿", "time": "3 months ago", "author": "ASDF123000", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G8YW_LIRcE74"},
{"text": "shut the fuck up!!! I'm still going to be wealthy as fuck﻿", "time": "2 months ago", "author": "Johaun Allen", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G8Z90wgL8S84"},
{"text": "c\n\n Kaya﻿", "time": "1 month ago", "author": "Mohamad Husseiny", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G8_w8uUiES45"},
{"text": "Samurai, were the lords and enforcers of the entitled nobility.  Think this guy gives a damn about Americans and freedom?  LOL﻿", "time": "1 week ago", "author": "tk421missing", "cid": "Ugh0LxXtY6zjN3gCoAEC.7-H0Z7-P3-G8b068ihHqZb"},
{"text": "power of an Entrepreneur ﻿", "time": "3 years ago", "author": "Pharaoh Vito", "cid": "Uggcqe9iXI0kLXgCoAEC"},
{"text": "ELLISON !﻿", "time": "3 years ago", "author": "Francis Lefebvre", "cid": "UggzCTKaSePBrngCoAEC"},
{"text": "New software project for CIA (ORACLE)!﻿", "time": "3 years ago", "author": "Marion R. Young", "cid": "UghtOOtG75eM6HgCoAEC"},
{"text": "I don't know, I admire this guy but the fortunes he made tends to make you too materialistic in my opinion.﻿", "time": "3 years ago", "author": "Benny Hill", "cid": "Ugjchc0XwS1qS3gCoAEC"},
{"text": "thats a true hustler right there﻿", "time": "3 years ago", "author": "Chris Barreira", "cid": "UgjuunDoXKcMSngCoAEC"},
{"text": "is larry elison a sicopath.he has no emotion on his face,impulsivley dangerouse,prays on the fantasy of a romance novelist and downrite hates someone else being number 1﻿", "time": "3 years ago", "author": "Walker Haw", "cid": "UgiLQstorspD-XgCoAEC"},
{"text": "Amazing Story...﻿", "time": "3 years ago", "author": "PBKiteboarding.com", "cid": "Ugg5AtW-3m1R0HgCoAEC"},
{"text": "Samurai or Ninja? ﻿", "time": "3 years ago", "author": "Carlos Pagliari", "cid": "Ugh2XSjEPu5ZM3gCoAEC"},
{"text": "Visionary in conceiving of the netbook lawsuit vs google next?﻿", "time": "3 years ago", "author": "Vegan Memes", "cid": "Ugic4bi5uIFp6XgCoAEC"},
{"text": "He knows shit about Japanese culture, yet he is the \"samurai\" of the software world. What a joke.﻿", "time": "3 years ago", "author": "bigfishpondhome1", "cid": "UgiB0GzJ2vaaFngCoAEC"},
{"text": "bigfishpondhome1  it's a metaphor﻿", "time": "1 month ago", "author": "fire killer", "cid": "UgiB0GzJ2vaaFngCoAEC.7-H0Z7-9gno8a0aPp1w3WT"},
{"text": "2:21 - almost everybody in the world is using oracle (showing pictures of ebay, amazon...).\nNo they do not use this. You know why? Because they know that using sh*t is not helpful.﻿", "time": "3 years ago", "author": "Klaus Klein", "cid": "UggBvTkPJIdlGXgCoAEC"},
{"text": "He looks like if Danny bonadoochi grew up and became a rapist. ﻿", "time": "3 years ago", "author": "Clap Forboobies", "cid": "UgiI8lJZNL7ENXgCoAEC"},
{"text": "Oh no you didnt﻿", "time": "1 year ago", "author": "Katleho Suping", "cid": "UgiI8lJZNL7ENXgCoAEC.7-H0Z7-56gz8GTEplzhOYt"},
{"text": "the bottom line is that.. regardless of who you are ...only one will own..the embalmer can wait anytime..﻿", "time": "3 years ago", "author": "Irvin Gutierrez", "cid": "UgiFHrs1M-eu9ngCoAEC"},
{"text": "Larry Ellison an adopted kid and a college drop-out? No wonder Ellison became such good friends with Steve Jobs.﻿", "time": "3 years ago", "author": "halley0413", "cid": "UgjwV3fYS2Ky1XgCoAEC"},
{"text": "I am from the ERP world.. and SAP rocks ,, Fuck oracle. ﻿", "time": "3 years ago", "author": "sonuEEE", "cid": "UgjgG5k7FtBwnngCoAEC"},
{"text": "+Swadhin Sangram Swain nope it does nt buddy :)﻿", "time": "3 years ago", "author": "sonuEEE", "cid": "UgjgG5k7FtBwnngCoAEC.7-H0Z7-GS9K7-v_RR9dxIp"},
{"text": "SAP has to pay 1.3 bn to Larry. Loughable. This verdict has long been voided. They end up with little more than the cost of the lawyers ;-))﻿", "time": "3 years ago", "author": "Michael K.", "cid": "UggSpSUM-cFD8XgCoAEC"},
{"text": "Oracle oversold their expensive software.  I worked at two companies that attempted to implement Oracle's systems only to face a nightmare getting it to work well, taking up all kinds of people's time to learn its proper use for something overblown for any business smaller than international corporations.  My girlfriend many years ago was one of the employees at Western Digital tasked to try to implement that program; she had the same story.  Oracle becomes much more expensive than upper management knows at first. ﻿", "time": "3 years ago", "author": "SIMKINETICS", "cid": "Ugj12nK7l0v2yXgCoAEC"},
{"text": "Sounds like you lack the people to do the integration and knowledgeable personnel, you need people who knows Pl/SQL on the back of their head.  ﻿", "time": "3 years ago", "author": "yiwei wu", "cid": "Ugj12nK7l0v2yXgCoAEC.7-H0Z7-6Lzp73B-8uwai_F"},
{"text": "+yiwei wu Sounds like you have never actually worked with Oracle software, Oracle corporation, and know nothing of other, much better programming. I'm a PL/SQL wizard, and I love it. But everything outside of the DB is primitive garbage.﻿", "time": "2 years ago (edited)", "author": "Vaclav Haval", "cid": "Ugj12nK7l0v2yXgCoAEC.7-H0Z7-6Lzp75FGEMGVGdV"},
{"text": "+SIMKINETICS same story at my company (in Europe)﻿", "time": "2 years ago", "author": "Str1000ac", "cid": "Ugj12nK7l0v2yXgCoAEC.7-H0Z7-6Lzp7A7-KyPQ5IH"},
{"text": "So , good salesmen . Eh !﻿", "time": "1 year ago", "author": "magna59", "cid": "Ugj12nK7l0v2yXgCoAEC.7-H0Z7-6Lzp8FseneqKk19"},
{"text": "Trust me, once you use other databases, you will start loving Oracle...﻿", "time": "5 months ago", "author": "Manan Gandhi", "cid": "Ugj12nK7l0v2yXgCoAEC.7-H0Z7-6Lzp8Vm3vJNEUqH"},
{"text": "ellison is one of those sick people called major CEOs in america.. ﻿", "time": "3 years ago (edited)", "author": "TheAndrassy1985", "cid": "UggNYCnUUPAq_HgCoAEC"},
{"text": "How is he sick?﻿", "time": "3 years ago", "author": "cedric mayfield", "cid": "UggNYCnUUPAq_HgCoAEC.7-H0Z7-BhKV7-aFP7BvFmE"},
{"text": "+cedric mayfield would sell his mother to climb up.. would turn millions in poverty to make 1% more profit.. but system is problem which gave power to people like him to influence governement .. and we suppose to admire those people﻿", "time": "3 years ago", "author": "TheAndrassy1985", "cid": "UggNYCnUUPAq_HgCoAEC.7-H0Z7-BhKV7-aLr8XsKFY"},
{"text": "", "time": "3 years ago", "author": "Sabrina and Danna Ultimate Club", "cid": "UggoeRd5K0wY7HgCoAEC"},
{"text": "O-ne R-eal A-sshole C-alled L-arry E-llison (ORACLE) !﻿", "time": "3 years ago", "author": "राहुल कुलकर्णी", "cid": "UggJ5nJAM1TjZ3gCoAEC"},
{"text": "Jealousy is a serious thing﻿", "time": "3 years ago", "author": "cedric mayfield", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi7-juqxk4voi"},
{"text": "+cedric mayfield We're not jealous, you pathetic pile of shit. We're knowledgeable and angry.﻿", "time": "3 years ago (edited)", "author": "Invesigator", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi73I1cCPXza-"},
{"text": "You must hate Jews. Did you know Jewish have the highest IQ score!﻿", "time": "3 years ago", "author": "Long Doan", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi73N_70AEcAo"},
{"text": "+cedric mayfield He orders the Ferrari before his friend just to be no. 1\nA Hole move. Buying PeopleSoft and firing everyone in Dublin Pleasonton, major A Hole move. Read up on who he really is﻿", "time": "2 years ago", "author": "citizen000", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi74p5AuPyZp9"},
{"text": "You're jealous because he is successful! ﻿", "time": "2 years ago", "author": "Long Doan", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi74pO7c-MMP5"},
{"text": "Naww ...He's a big dick asshole!﻿", "time": "2 years ago", "author": "राहुल कुलकर्णी", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi74q2bcN7pW6"},
{"text": "How is he an a**hole! He donated $52,000,000 to charity, maybe it's smaller than Bill Gates or Warren Buffett, it's a lot for normal people!﻿", "time": "2 years ago", "author": "Long Doan", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi76f6yNH1QyE"},
{"text": "+Long Doan\nWe're not jealous at al. How can he be successul when he's never invented any technology?﻿", "time": "2 years ago", "author": "Invesigator", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi76f84ZQN9XR"},
{"text": "+Invesigator All Warren Buffett and Carlos Slim Helu do to get rich is to invest in stock. They basically did nothing; Ellison invented (\"created\") Oracle.﻿", "time": "2 years ago", "author": "Long Doan", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi76fAahPGoHf"},
{"text": "+Long Doan Bill gates and warren buffet combined have donated 68 billion ;)﻿", "time": "2 years ago", "author": "Ben", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi77KUvFmV2xV"},
{"text": "In Forbes, Larry Ellison have a higher self-made score, 9, than Bill Gates and Warren Buffett, 8. He works more to achieve what he is today.﻿", "time": "2 years ago", "author": "Long Doan", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi77L_igViD-X"},
{"text": "+Long Doan Whatever helps you sleep at night buddy﻿", "time": "2 years ago", "author": "Ben", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi77L_tQZGvuK"},
{"text": "+Long Doan I respect him for that!﻿", "time": "1 year ago", "author": "राहुल कुलकर्णी", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi8HddpANGpdW"},
{"text": "why is he asshole?\nhe is jew i know!\nis that the reason?﻿", "time": "4 months ago", "author": "Its Just an Apple", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi8X2BoPQiTV4"},
{"text": "Go play on the freeway Contempt for success is just masking jealousy﻿", "time": "1 month ago", "author": "Kevin Doyle", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi8_OvMOMQ_Bl"},
{"text": "Leave the Jews alone fuckhead. read the Torah about financial wisdom﻿", "time": "1 month ago", "author": "Kevin Doyle", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi8_OvVRJtfrw"},
{"text": "राहुल कुलकर्णी you are gifted﻿", "time": "1 month ago", "author": "MeiXIng Michael", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi8_U6gKn1SdI"},
{"text": "Quiet ignorant jerk mouth﻿", "time": "2 weeks ago", "author": "Kevin Doyle", "cid": "UggJ5nJAM1TjZ3gCoAEC.7-H0Z7-U-Qi8ag8DUpGjKT"},
{"text": "The best inspiration video for all who believes in working towards achieving goal﻿", "time": "3 years ago", "author": "Suresh Gowda", "cid": "UgjNThiARIOkvHgCoAEC"},
{"text": "\"The only thing that matters in life is winning.\" a CEO and a saint!﻿", "time": "3 years ago", "author": "TripoVision", "cid": "Ugi_rQ36ABr2i3gCoAEC"},
{"text": "and a selfish, sociopathic prick﻿", "time": "3 years ago", "author": "starryian007", "cid": "Ugi_rQ36ABr2i3gCoAEC.7-H0Z7-3zRs70FLyvmbpDd"},
{"text": "+starryian007 i loooove competition!!﻿", "time": "3 years ago", "author": "Malcolm Abbas", "cid": "Ugi_rQ36ABr2i3gCoAEC.7-H0Z7-3zRs72bCq6HedlZ"},
{"text": "An interesting comment. People who generally love competition have low self esteem. They have to keep challenging themselves against others to bolster their flagging egos. People like this therefore turn everything into some sort of competition to stroke their own egos if they win. Sad bastards. My philosophy is live life because before you know it, it will be gone..﻿", "time": "3 years ago", "author": "starryian007", "cid": "Ugi_rQ36ABr2i3gCoAEC.7-H0Z7-3zRs72bHePrQRgX"},
{"text": "+starryian007 you have a point, but if you didn't had a rival or competition in business. I can guarantee you, you wouldn't see any quality of the product. Maybe some, but not many. ﻿", "time": "3 years ago", "author": "Malcolm Abbas", "cid": "Ugi_rQ36ABr2i3gCoAEC.7-H0Z7-3zRs72cDcImirtH"},
{"text": "Yes I agree. The whole basis of capitalism is based on competition. However, it was once said that 'without comparison everything loses it's meaning' I think in that statement is a way forward. If people learned to do things not because it made them more money or more competitive, but because it was done to the best of their ability then we may have a more equal and just society. Some just need to think outside the box.﻿", "time": "3 years ago", "author": "starryian007", "cid": "Ugi_rQ36ABr2i3gCoAEC.7-H0Z7-3zRs72cGcAxfTYN"},
{"text": "+starryian007 i agree. i never competed against anybody but my self, and as a consequence i beat everyone at what the one thing i was passionate about.﻿", "time": "2 years ago", "author": "TripoVision", "cid": "Ugi_rQ36ABr2i3gCoAEC.7-H0Z7-3zRs77fsAJgJ3D2"},
{"text": "@Blomberg News This clown is NO Warren Buffett!﻿", "time": "3 years ago", "author": "Tuxster3", "cid": "UgjoDh4c7BzWkXgCoAEC"},
{"text": "Hmm, usually with that kind of earning there are some sacrifice he neglect.  Maybe his early loves, she could worth that much, and the children he could have father.  The point is can I have some spare change since you are richer than me on the book.\n\n\n﻿", "time": "3 years ago", "author": "UnitedPebbles", "cid": "UgheFAkBQuiK2ngCoAEC"},
{"text": "Awesome series! ﻿", "time": "3 years ago", "author": "Ralev.com", "cid": "UggRFWOLqqfUzXgCoAEC"},
{"text": "Does he really owe anything to society though? He doesn't. What he built was from his own hard work. It'd be nice if he did something for humanity, however, some could say his contributions to the computer world is his way of helping humanity.﻿", "time": "3 years ago", "author": "TimeHopeFaith", "cid": "Ugh-mwgRzIAlRHgCoAEC"},
{"text": "+TimeHopeFaith Your type of thinking is why the world is on the verge of WWIII now.  We ALL owe a debt to the future and not to make selfish short-term decisions that in the long-term are destructive of trust and society.\nMy dad's generation called these guys \"quick-buck artists\" with justified derision.  I coined the term \"strip-minders\" because psychos like this abuse their employees, overwork them taking advantage of the hard labor market that they themselves have conspired to create. Their aim is to suck you completely dry like vampires and discard your worthless carcass on the treeless plain to rot and  blow away in the wind.  Wake up and rise up.﻿", "time": "2 years ago", "author": "Carl Hopkinson", "cid": "Ugh-mwgRzIAlRHgCoAEC.7-H0Z7-48ko86bce4y7Sm2"},
{"text": "You don't have to buy into his stuff though... You're using youtube but you don't have to... I'm sure youtube uses some sort of oracle database, or has at some point. This is America. Coming up with a new idea and executing it well will make you rich. ﻿", "time": "2 years ago", "author": "TimeHopeFaith", "cid": "Ugh-mwgRzIAlRHgCoAEC.7-H0Z7-48ko86cxNcElP5F"},
{"text": "His OWN hard work? What are employees for then?﻿", "time": "8 months ago", "author": "John L", "cid": "Ugh-mwgRzIAlRHgCoAEC.7-H0Z7-48ko8SGnrPRikQJ"},
{"text": "Your a psychopath apologist because you believe in Western business propoganda.  \"Making money is always Virtuous!!\" NO!!  Moral code is above all else.  It's called being human.﻿", "time": "3 weeks ago", "author": "David Hume", "cid": "Ugh-mwgRzIAlRHgCoAEC.7-H0Z7-48ko8aVuVINmPWH"},
{"text": "My pops works for this douche at a personal level. Yes he is a douche bag and very cocky but wouldn't you be also if u made a average  persons yearly salary just by getting out of bed? ﻿", "time": "3 years ago", "author": "Christopher Cline", "cid": "UgjkIQPtFZ2OPXgCoAEC"},
{"text": "Build better desktop applications? Let 'em have Swing, let's sail for the seas! YARR!﻿", "time": "3 years ago", "author": "Adrian22Frets", "cid": "UghJMTruVKM3WXgCoAEC"},
{"text": "LOLOL!!@4:40﻿", "time": "3 years ago", "author": "Alex Shackelford", "cid": "UgjjzFjiImxGvngCoAEC"},
{"text": "People that judging rather positive or negative remember this: this is not his whole life we dont know nothing but what this video showed us, there more to it than this, billionaires are the most secretive people cause they can afford it, this should INSPIRE you to do BIG in life THATS IT.﻿", "time": "3 years ago", "author": "KeAndre Jones", "cid": "UgiuPyvuD3du4ngCoAEC"},
{"text": "+KeAndre Jones You are wrong.  I know people who know him directly and he IS the biggest asshole on the planet or in the top 3.﻿", "time": "2 years ago", "author": "Carl Hopkinson", "cid": "UgiuPyvuD3du4ngCoAEC.7-H0Z7-JaXo86bbch6AM2U"},
{"text": "If he was not an asshole, certain facts in this video would never be mentioned.  His own people describe him as an asshole.  I'm sure his 4 ex wives consider him an asshole.  We don't know his whole life -- maybe he is kind to the rubber ducky in his bath?  Are you a millenial?﻿", "time": "4 weeks ago", "author": "Overcast Friday", "cid": "UgiuPyvuD3du4ngCoAEC.7-H0Z7-JaXo8aDiGgNJ4yv"},
{"text": "Overcast Friday lol different perspective. You can be inspired by peoples achievements and still dislike them. What classifies that person as a millenial?﻿", "time": "3 weeks ago", "author": "c obra", "cid": "UgiuPyvuD3du4ngCoAEC.7-H0Z7-JaXo8aUyJoBrgkb"},
{"text": "If people think he is an asshole he is doing things right﻿", "time": "2 weeks ago", "author": "Kevin Doyle", "cid": "UgiuPyvuD3du4ngCoAEC.7-H0Z7-JaXo8aXAqIsskp6"},
{"text": "MONEY IS NOT WEALTH (say a scientist who helped humanity will be muh richer within His contentment will be bigger(=health+joy) and ppls recognition n love n loyalty, \nMoney can b lost at once but the other \"capitals\"are more stable .Similarly a parent with happy children may still be wealthier,\n  +on the other  hand the economic circumstances in US are such where ppl seem to enjoy to have millions of ppl at min pay ,to also have  the possibility of one man getting filthy rich﻿", "time": "4 days ago", "author": "delagrazia", "cid": "UgiuPyvuD3du4ngCoAEC.7-H0Z7-JaXo8bCY9Gqxsjg"},
{"text": "Ellison donated $200 million for study of diseases. Poor people need to be quiet and spend time upgrading themselves﻿", "time": "4 days ago", "author": "Kevin Doyle", "cid": "UgiuPyvuD3du4ngCoAEC.7-H0Z7-JaXo8bCcZcKltKq"},
{"text": "\"study\"(?) of \"diseases\" (?) i see.... thats bcoz he is not wealthy in the health /knowledge area and doesnt know what disease is AND his motive could be selfish (research an area HE wants advanced)or not .\nThere are ppl who have no food for their children bcoz they were born w/o land ,opportunities etc THAT WOULDNT CHANGE NO MATTER HOW MUCH they upgraded themselves﻿", "time": "4 days ago", "author": "delagrazia", "cid": "UgiuPyvuD3du4ngCoAEC.7-H0Z7-JaXo8bChmOaxyZA"},
{"text": "my point is that you must be somewhat of an asshole to be willing to be part off  an exploitative system\n.. but then again i dunno the guy n his philosophy so.. \nBUT WHAT YOU CLAIM IS A POPULAR MYTH ...aka THAT THE PEASANTS MUST BE LESS WORTHY THAN THE KING ..otherwise they wouldnt be paesants..right?...wrong!﻿", "time": "4 days ago (edited)", "author": "delagrazia", "cid": "UgiuPyvuD3du4ngCoAEC.7-H0Z7-JaXo8bCi2BVS9-H"},
{"text": "You need to fuck off you failure﻿", "time": "4 days ago", "author": "Kevin Doyle", "cid": "UgiuPyvuD3du4ngCoAEC.7-H0Z7-JaXo8bCoVO8iCO_"},
{"text": "Stupid slaves like you need to fuck off﻿", "time": "15 hours ago", "author": "delagrazia", "cid": "UgiuPyvuD3du4ngCoAEC.7-H0Z7-JaXo8bLUEORQDRc"},
{"text": "gotta say although I personally think Ellison has lead a far less influential life than Jobs and Gates and to an extent seems to be ego driven,he should be recognised as one of the best technologists in even, evident in the fact he forsaw the rise of the cloud system even in 1995 (start at 16.00)﻿", "time": "3 years ago", "author": "Adam Yu", "cid": "UggzN39V4MZVhXgCoAEC"},
{"text": "Thank God for people like Larry Ellison. ﻿", "time": "3 years ago", "author": "ABG1983", "cid": "UggYhFG5O7UUbHgCoAEC"},
{"text": "This guy is complete POS! The epitome of the corrupt, greedy 1%.﻿", "time": "3 years ago", "author": "Matt Dill", "cid": "UghorgkLvp4NUHgCoAEC"},
{"text": "Please elaborate on your statement. ﻿", "time": "3 years ago", "author": "Matt Dill", "cid": "UghorgkLvp4NUHgCoAEC.7-H0Z7-ApfU7-RJeLlTq6E"},
{"text": "Larry is a democrat, you stupid idiot. I love it. you liberal fools are so stupid. Most of these silicon valley billionaires are democrats because they know they can pay off the democratic party﻿", "time": "3 years ago", "author": "kellykinsellives", "cid": "UghorgkLvp4NUHgCoAEC.7-H0Z7-ApfU7-u5P5UbB6C"},
{"text": "Stop hating so much﻿", "time": "3 years ago", "author": "cedric mayfield", "cid": "UghorgkLvp4NUHgCoAEC.7-H0Z7-ApfU71NRbzzKkAa"},
{"text": "He's corrupt and greedy because he's self made?  No one worth billions has cleans hands. Get over it. He made it.. Simple﻿", "time": "1 year ago", "author": "Jess B", "cid": "UghorgkLvp4NUHgCoAEC.7-H0Z7-ApfU8BYIOnGBM96"},
{"text": "To get to number one, buying new technology through acquisitions. Bundle new products with oracle products. A very tenacious person(he won against the government). Most guys would have walked away from that. He acquired 52 companies in 5 years. He then made a 7 $billion dollar trophy purchase of Sun Micro Systems. ﻿", "time": "3 years ago", "author": "Duke Royal", "cid": "UgiM33S0Hmwgt3gCoAEC"},
{"text": "What does his shaft taste like?﻿", "time": "3 years ago", "author": "Marco Coronado", "cid": "UgiM33S0Hmwgt3gCoAEC.7-H0Z7-FDtK72jk5v0yd3W"},
{"text": "successful in money terms (Billionaire) but in relationships (4 marriages) a total failure.﻿", "time": "3 years ago (edited)", "author": "Nigee Bear", "cid": "Ugh1Xb7eo-7qq3gCoAEC"},
{"text": "thanks for sharing this video, because i heard larry ellison but never understand what ORACLE was.﻿", "time": "3 years ago", "author": "Indo Banged", "cid": "Ugh1Xb7eo-7qq3gCoAEC.7-H0Z7-8rMR7-O5lRYr6NX"},
{"text": "Not failure, only a guy who could afford 4 divorces and happily survive them while most of married men endure hell because they can't afford freedom.﻿", "time": "3 years ago", "author": "Anis Matar", "cid": "Ugh1Xb7eo-7qq3gCoAEC.7-H0Z7-8rMR70cJPwDf5aT"},
{"text": "The Oracle way, be an arsehole and don't give a shit about anyone else. The man is  an egomaniac and has no idea about how to treat people. Hire, fire at will, don't care about  people. Scorecard what a f**king moron. He comes across as a very sad man. Rich but sad.﻿", "time": "3 years ago (edited)", "author": "Nigee Bear", "cid": "UgjT__W5ROWeD3gCoAEC"},
{"text": "Oracle Greed, Greed and more greed. Sales that's all he cares about. Oracle don't give people pay rises, you stay on the same salary for years, while the few at the top getting millions. The whole environment at Oracle is one of stress and you can cut the atmosphere with a knife. Horrible, Horrible company to work for.﻿", "time": "3 years ago", "author": "Nigee Bear", "cid": "UgiTicGzhG5ReXgCoAEC"},
{"text": "+Nigee Bear I can personally vouch for the accuracy of your summary of Oracle!!\nWorked there for 18 months but had to quit on account of I was very worried of my constant state of anxiety and inability to sleep.  I did not want to drop dead like the others, so I dropped out.﻿", "time": "2 years ago", "author": "Carl Hopkinson", "cid": "UgiTicGzhG5ReXgCoAEC.7-H0Z7-HoVO86bczRMliNB"},
{"text": "\nI worked for this company for over six years and they treat people like shite.\nAll that money and he seems miserable and intense.﻿", "time": "3 years ago", "author": "Nigee Bear", "cid": "UggjjOCNDsc1_ngCoAEC"},
{"text": "Rev G andrew goosdy at youtube. Com said good business man comments at Andrew goosdy@gmail. Com ﻿", "time": "3 years ago", "author": "Andrew Goosdy", "cid": "UgjuUbSK1wnfU3gCoAEC"},
{"text": "Lol does this guy suck or what? I've never met him and I can still you beyond a doubt he would just be obnoxious in person - without a resume sheet I'm sure I could best him in an interview, just another hack who lucked out with the right product at the right time.﻿", "time": "3 years ago", "author": "John Swift", "cid": "UgiE4k7RdunX03gCoAEC"},
{"text": "I bet you could...I bet...﻿", "time": "3 years ago", "author": "thedon008", "cid": "UgiE4k7RdunX03gCoAEC.7-H0Z7-023e7-WjmQyAm_m"},
{"text": "SALAAM... BROTHER LARRY SHOULD OPEN ORPHANAGE HOMES ..SPIRITUALY BROTHER LARRY IS A GOOD MAN WHO CARES..ALTHOUGH ALWAYS BUSY,yet he has good vision for future development of ideas and he work hard to make it happen.SALAAM.GOD BLESS YOU BROTHER LARRY.YOU have a kind heart and you are a thinker.Success is always with you.\n GOD LOVES YOU,BROTHER... MARYAMFATHIMAH Hamdh.﻿", "time": "3 years ago", "author": "HamidahIshak", "cid": "Ugg7UmfWn_2oi3gCoAEC"},
{"text": "donacion 44.000 mllones de dolares ....\n1 hombre terminara con la pobreza en el mundo﻿", "time": "3 years ago", "author": "JOSE LUIS LOPEZ", "cid": "UgiIXz9gdqQO8XgCoAEC"},
{"text": "too bad his huge pile of money won't be able to save his soul﻿", "time": "3 years ago", "author": "Mike Freeman", "cid": "Ugij4bVixhBax3gCoAEC"},
{"text": "soul please ellison is the ultimate﻿", "time": "3 years ago", "author": "tanio12", "cid": "Ugij4bVixhBax3gCoAEC.7-H0Z7-PlMn7-QRO6_p6Ew"},
{"text": "souls don't exist loser...﻿", "time": "3 years ago", "author": "Neo Granzon", "cid": "Ugij4bVixhBax3gCoAEC.7-H0Z7-PlMn7-XR6d-nNgy"},
{"text": "Lol a jealous ass bitch like you would say that. Because he have a lot of money doesn't make him evil﻿", "time": "3 years ago", "author": "cedric mayfield", "cid": "Ugij4bVixhBax3gCoAEC.7-H0Z7-PlMn723UH_Lkm0Y"},
{"text": "+Neo Granzon How the fuck do you know that for sure asshole? Prove there is or isn't...You cant.......now who is the loser?.............dumb cunt!\n ﻿", "time": "3 years ago", "author": "starryian007", "cid": "Ugij4bVixhBax3gCoAEC.7-H0Z7-PlMn72XjtS7ObzH"},
{"text": "+cedric mayfield\nI haven't said he was evil.. but\n\"No one can serve two masters. Either you will hate the one and love the other, or you will be devoted to the one and despise the other. You cannot serve both God and money.\" (Mat. 6:24)﻿", "time": "3 years ago", "author": "Mike Freeman", "cid": "Ugij4bVixhBax3gCoAEC.7-H0Z7-PlMn72Y-gSpGy6o"},
{"text": "+starryian007 It's the positive claim that must prove its statement. Sure we can't prove you're wrong but you can't prove that souls exist. Therefore we can't go by the claim that souls exist since we have no proof. That's like me saying. \"The flying cake exists and is god\". Well you can't prove it wrong technically but i can't prove it right. So logically we must come to a agreement that it does not exist. Since the positive claim has to prove it's statement. I don't have to disprove anything. So therefore till you or anyone can prove that claim. Souls don't exist.﻿", "time": "3 years ago", "author": "Just your regular MLG noscoper", "cid": "Ugij4bVixhBax3gCoAEC.7-H0Z7-PlMn72zFsGSbdlG"},
{"text": "+starryian007 Just because you ignorantly state that xy can't prove something that won't be true. Go and learn anatomy, there's no soul, there you go.﻿", "time": "3 years ago", "author": "Rajmund Csombordi", "cid": "Ugij4bVixhBax3gCoAEC.7-H0Z7-PlMn75Sy_zQMFCc"},
{"text": "I'm a rookie for now, a mega master mind on technology, college guy with honors,, I'm a person who know more than twenty languages. I will hear about me, that college drop out loser, I will crush him﻿", "time": "3 years ago", "author": "DavisMegaMind", "cid": "UgjaV-sJ0QBihXgCoAEC"},
{"text": "he's an asshole and always was﻿", "time": "3 years ago", "author": "Arthur Vin", "cid": "UggEF683S4ntaXgCoAEC"},
{"text": "But you have to respect him.﻿", "time": "3 years ago", "author": "Drake Leslie", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH70IwDu7ME52"},
{"text": "+Drake Leslie Not really! I respect Buffet and Munger MUCH more.﻿", "time": "3 years ago", "author": "Tuxster3", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH71moIM2siKS"},
{"text": "Or your just jealous because he is enjoying his life﻿", "time": "3 years ago", "author": "cedric mayfield", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH72OC_Tmnn4L"},
{"text": "Yeah, I guess trying to be 19-years old again and chasing 20-year old pussy, while enjoying your plastic surgery could be considered enjoying one's life.﻿", "time": "3 years ago", "author": "Tuxster3", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH72P4pID3sdT"},
{"text": "+Drake Leslie No, we don't have to because he's invented nothing.﻿", "time": "3 years ago (edited)", "author": "Invesigator", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH75wKkpGjeHA"},
{"text": "You must hate Jews. Did you know Jewish have the highest IQ score!﻿", "time": "3 years ago", "author": "Long Doan", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH760sB0oViuV"},
{"text": "+Long Doan\nI don't hate Jews and even billionaires. I hate people who are pricks and are sick about money. The Oracle has a worst internal and external politics. The oracle products are rubbish, support is rubbish. Being experienced software developer I hate Oracle DB, even after I have been using it for 5 years. There are jews that deserve to be that rich, Sergey B, Larry P, Bill G (not a jew). But not this asshole definitely.﻿", "time": "3 years ago (edited)", "author": "Arthur Vin", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH761661f62kj"},
{"text": "I agree. Problem is, americans tend to see everything through a very narrow slit of the bottom-line numbers in dollars. Who cares about the details, or morals, or even the truthfulness of this bottom-line numbers. Oracle never innovated or invented anything, and Larry Ellison is just a very violent business-man. Some will appreciate this. Me as a software developer for 30 years now - can't appreciate him so much. Thankfully his overrated ego and everlasting drive for money feeds many homes. ﻿", "time": "3 years ago", "author": "Motti Shneor", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH76F2qMYSdRR"},
{"text": "+Motti Shneor right that's why his company is worth well over hundred billion.﻿", "time": "2 years ago", "author": "David R", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH7AkpXehR56y"},
{"text": "+dave jones It's not his company. The shareholders own publicly-traded companies.﻿", "time": "2 years ago", "author": "Tuxster3", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH7AmGsQdfsVF"},
{"text": "I'm aware but after all its his company. He's a founder and owns a nice chunk about 20% of public stock.﻿", "time": "2 years ago", "author": "David R", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH7AnTQs-fWpG"},
{"text": "+dave jones Obviously, you're not aware, because you're still calling it his company. Again, it isn't his company. The company belongs to the shareholders.\n\nHis being a founder doesn't make him the owner of the company. He only owns a percentage of the company based on his number of shares that he owns.\n\nNow, if he took the company private, then it would possibly be his company.\n\nThis is basic finance 101.\n\n\n ﻿", "time": "2 years ago", "author": "Tuxster3", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH7AoCvEv1JqS"},
{"text": "+Tuxster3 Correct. But I'd like to add that the shareholders are happy with his leadership because he makes money out of every single piece of shit with surprising confidence, and most shareholders are looking for that kind of leader. If I was a sick shareholder who is hungry for money (which I'm not), it would make me happy as well. \n\nBut speaking about humanity then Oracle doesn't add anything useful to progress and innovation. They are making shitty products for businesses asking crazy money, and still shipping complicated products which puts the company on support needle forever, and that way oracle keeps sucking out the money.\n\nI have not found any evidence that Oracle has donated some money to charity ever! Unlike Google and other creative companies who are doing that frequently.﻿", "time": "2 years ago", "author": "Arthur Vin", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH7AohanBlEhR"},
{"text": "It is his company. He is a shareholder and a big one (like i said about 20 percent). You don't have to own every share to be an owner of a public company. Granted he is a part owner but he is still an owner! Whatever the case is, he co-founded a company that is worth well over a hundred billion on the market. To say that oracle never innovated or invented anything, is simply an outright lie. You might have beef with Mr Allison, but a \"violent business\" man as you call him is how to run a company to it's full potent.  Explain how a company could have billions in annual sales for over a decade without innovation.﻿", "time": "2 years ago", "author": "David R", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH7AsiI6gqnG6"},
{"text": "+Jay Jone You equate net worth with self worth?﻿", "time": "2 years ago", "author": "Tuxster3", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH7CkQXwwpzFi"},
{"text": "+Arthur Vin He's ruthless businessman and his products are overrated. But he's american and that gives advantage against other people outside US.﻿", "time": "2 years ago", "author": "Str1000ac", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH7Cvm1QoOdEX"},
{"text": "how else do you beat youre competition being nice and letting people bully you push you around and being a coward never ever will you win by being a coward america is about competition get an education﻿", "time": "6 months ago", "author": "FX Greenback", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH8USZax3wizD"},
{"text": "Arthur Vin a successful asshole always better than a broke asshole﻿", "time": "4 months ago", "author": "HedgeFund40", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH8XAKK0NzUll"},
{"text": "Arthur Vin Shallow﻿", "time": "2 months ago", "author": "mark rigsby", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH8ZA4TUFFdXb"},
{"text": "@ Arthur Vin a very smart and cool asshole you can learn from  Go hangout with foodstamp failures﻿", "time": "1 month ago", "author": "Kevin Doyle", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH8_Ou2DmWFrW"},
{"text": "DeWitt Clause. Look it up. Ellison is a scumbag and should be in prison.﻿", "time": "1 month ago", "author": "mrwierd mrwierd", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH8_yxifpRQFY"},
{"text": "Jews Suck dick.﻿", "time": "3 weeks ago", "author": "GRANTFROM GOOLWA", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH8aK1JmzhIv6"},
{"text": "Food Stamp recipients that are drug addicts are assholes﻿", "time": "2 weeks ago", "author": "Kevin Doyle", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH8aXAe2_6V4k"},
{"text": "Jews are smart and this Irishman is reading the financial wisdom of the Torah﻿", "time": "2 weeks ago", "author": "Kevin Doyle", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH8ad_wn5sD5u"},
{"text": "And non-Jews can too if you learn what they learn. Ones IQ is not fixed﻿", "time": "2 weeks ago", "author": "Kevin Doyle", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH8adaMTSfapD"},
{"text": "And non-Jews can too just learn what they know. Ones IQ is not fixed﻿", "time": "2 weeks ago", "author": "Kevin Doyle", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH8adabn8Hq9B"},
{"text": "Samurai, were the lords and enforcers of the entitled nobility.  Think guys, like Ellison, give a damn about Americans and freedom?  LOL﻿", "time": "1 week ago", "author": "tk421missing", "cid": "UggEF683S4ntaXgCoAEC.7-H0Z7-NuJH8b06DOjyPsq"},
{"text": "Larry is a good man..maryamfathimah.﻿", "time": "3 years ago", "author": "HamidahIshak", "cid": "Ugj9VmAbE8-UYHgCoAEC"},
{"text": "A few million is a drop in the bucket for him, a minor tax deduction and a whole lot of adulation from the few who benefit.  Why do you think he is interested in research on aging?  He doesn't want to age or die!  This is like a Koch donation to cancer research because one of them has cancer.  It doesn't count as first class philanthropy.﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugjyxx2S39PuSngCoAEC"},
{"text": "So fucking what your trying to say someone is bad because they donate to charities? what they fuck do you do ? have you provided billions of people with quality products that enhances people lives? did you create 100s of thousands of jobs? do you creates economic growth, ? donate millions to charities? This whole idea about business being evil is fucking stupid, look at the government which is ran off extortion,violence and war if you want to see evil. ﻿", "time": "3 years ago", "author": "coopmuch56", "cid": "Ugjyxx2S39PuSngCoAEC.7-H0Z7-J1uB70MbaAZwHl6"},
{"text": "+coopmuch56 ,  I recommend that you reduce the use of f-bombs in your vocabulary.  Get an education next.  Learn to see causation at multiple levels.  Sharpen your critical skills.  Learn to not overreact to a comment or opinion on the web.  I don't remember saying business is evil.  Do you know something that I don't know?  \"bad because they donate to charities\"?  ...  I was saying exactly the opposite.  I was focusing more on paltry, tax-shelter donations.  Maybe you should brush up on your reading and comprehension skills too.  \n\nIt occurs to me that your understanding of syntax, basic sentence structure and rules of grammar, such as capitalization, appears to be wanting more early education.  My advice to you is that you should ask someone who understands the language to point out the many grammatical errors in your rant.  \n\nI think a better understanding of orders of magnitude might enlighten your thinking about money matters.﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugjyxx2S39PuSngCoAEC.7-H0Z7-J1uB70NQTJEvVk_"},
{"text": "+Lester Barrett Take a moment out of your pathetic fuckin life and watch this--->     /watch?v=N4vf8N6GpdM﻿", "time": "3 years ago", "author": "coopmuch56", "cid": "Ugjyxx2S39PuSngCoAEC.7-H0Z7-J1uB70NWvdLjO0T"},
{"text": "Ellison doesn't like criticism. Most of the posts here have been deleted.  But then that's what you do when you have a large ego and control the data.  What will he do next?  Bomb my house?﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugjyxx2S39PuSngCoAEC.7-H0Z7-J1uB70VD5Kq3g5j"},
{"text": "+Lester Barrett You think you are so special that the worlds 5th richest guy delete your comments because you criticise him? You must be schizofrenic﻿", "time": "3 years ago", "author": "Thomas Andersen", "cid": "Ugjyxx2S39PuSngCoAEC.7-H0Z7-J1uB73b6hSkdnsM"},
{"text": "He made some money.  He's a competitor.  But what has he done for humanity?  Is his life just an ego trip?  What will he be remembered for?  Probably nothing.  At least George Bush will be remembered as an idiot.﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC"},
{"text": "why are you even here then, just go back home and watch Dr. Phil﻿", "time": "3 years ago", "author": "Being Truthful", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7-IdlBa8XnS"},
{"text": "+Warren Kung Thanks for responding!  I don't watch TV, by the way.  Why am I here?  Well, this video was presented to me by the YouTube people.  I took a brief look.  I put an opinion out, like everyone else who has done that here.  Are you saying there is something wrong with that?  Are you of the opinion that when someone sees something on the internet, they must make only positive and supportive comments?  For instance, if I see a video of Hitler, I should just say what a pleasure it is to see such a wonderful person?  By the way, I am curious as to what compelled you to respond to my comment.  And what is it about Dr Phil that you think would be of value to me?  By the way, he too is an idiot and a scoundrel.  I am starting to form the opinion that you may also have some mental issues.  Maybe Dr Phil would actually be a good fit for you.﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7-IhPSQC-sR"},
{"text": "+Archangel2895 So you prefer to criticize my choice of example rather than offering up your own argument.  You choose to ignore the message and focus on a word.  Well, God help us if you represent thinking.  Is this possibly because your attention span is too short, and maybe that modern tropes represent arguments that satisfy you, even though you don't even know what a trope is?\n\nAww, man, you had better go to school, dude!﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7-JrLZKHhf8"},
{"text": "+Archangel2895 Sorry, it has been a dramatic week.  I am fresh out of accommodations.  My apologies.  I should have seen the smiley face; but, by the time I got to the end of the post, I was in aggressive mode.\n\nI do think that smiley faces and lol's have an important role to play.  But they don't substitute for real human interaction with faces, gestures, and cultures rubbing up against each other as people try to communicate.﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7-Ju0ztzTUt"},
{"text": "Apology accepted.\n\nMy advice to you my friend is to learn how to deal with jealousy.  ﻿", "time": "3 years ago", "author": "Being Truthful", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7-LKp8o_SpU"},
{"text": "He has actually donated lots of money to universities for medical research over the course of many years. For example, he recently donated $4.5 million to USC for oncology research. In addition, he has his own medical foundation conducting research in various fields, but focuses on mechanism of aging.﻿", "time": "3 years ago", "author": "Vik Rao", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7-MtMwi0yA_"},
{"text": "+Warren Kung Thanks for the free psychological profile.  By the way, I didn't apologize to you.﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7-kpbLqTWWq"},
{"text": "+ExtendedGamer I see that you withdrew your comment.  It didn't really make sense to me.  By your logic, everyone who owns a grocery store is a humanitarian because they feed so many people.  Con Agra would be a great benefactor because they feed many millions.  Also, I totally reject your allegation that he Ellison did more than MLK, JFK, and Mandela.  He isn't even on the same order of magnitude.  Even if he had steadfastly given everything he made to charity, he would not have done as much for humanity as those three.  Your comment reflected a very narrow understanding of history.﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7-kqIeutytk"},
{"text": "+ExtendedGamer I can understand your view of his generosity.  We must disagree on the impact of the other three.  I believe that each of them had an impact that was much larger than you say.  MLK's message and actions resonate throughout the world and will continue to do so for many generations.  Mandela shepherded a peaceful process of reconciliation.  It was not perfect; but it prevented a large amount of bloodshed.  Improving the lives of a lower class in every country is an ongoing process.  He will forever remain a part of that.  JFK gave hope and new vision to the world, although one could argue that he did not actually accomplish anything as a President.  He inspired even in countries that were our enemies.  \n\nI would say that Bill Gates is more known for charitable endeavors than Ellison.  He is trying to eradicate polio and many other problems.  Jimmy Carter has also been busy working to eradicate a number of third world problems.  \n\nI believe that no matter how much money and toys I have, as long as I live in a world where poverty is excessive, I am not wealthy.﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7-mVkzzE2nC"},
{"text": "Well his software essentially powers the databases of the world. I think that counts as a small contribution...﻿", "time": "3 years ago", "author": "Maestro Drew", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD70AY8EV8jeY"},
{"text": "+Maestro Drew\nThis guy knows what's up. One of the reasons why we can even watch this video is because of Oracle technology.﻿", "time": "3 years ago", "author": "Taylor Sloan", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD70C9W0KsEzX"},
{"text": "Whats he done for humanity? he provided billions of people with software that makes life better. Any business is doing something for humanity! Thats why they stay in business there is demand for a product or service and businessmen provide it. This whole idea that businesses are somehow parasites or something is such bullshit. They provide people with goods and services, they buiild our houses, our computers, our cars provide jobs and economic growth. ﻿", "time": "3 years ago", "author": "coopmuch56", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD70TfGqvsI9K"},
{"text": "Not everyones going to impact humanity or even want to. And some will argue that george bush actually set back humanity. lol﻿", "time": "3 years ago", "author": "DwightUIgnorantSlut1", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD714MPfk5B8m"},
{"text": "Not everyone needs to have a major impact on humanity.  I firmly believe that those who extract a large amount of resources of any type owe more back to humanity.  It is obscene to spend the money on toys when you consider the conditions of life for America's poor.  Third world poor people are an order of magnitude below even our poor.\n\nLook at the examples of Bill Gates, Robert Wood Johnson, and Dr. Jonas Salk, for example.  Read about Dr. Salk.  He could have been a lot richer than the CEO of Oracle.  I would argue that, in spite of what people said in other comments here, that Salk did more for humanity than Gates, Ellison, and many other rich people combined.  Due to inappropriate use of vaccination teams for spying by the CIA, Polio has sprung up again in Pakistan, where the Taliban have killed nearly a hundred aid workers who were conducting vaccination campaigns.  This year there have been about one hundred cases there.  If this epidemic spreads, it could affect someone you know.  When I was a child, it was not uncommon to see polio victims everywhere in the United States, and even more common overseas.  It was sad to see young children on crutches with metal exoskeletons on their legs, or in wheelchairs.  This disease affected hundreds of millions; and it was and is totally eradicable.  Maybe Ellison could take up where Salk left off, if he is not too busy sailing.\n\n http://en.wikipedia.org/wiki/Jonas_Salk﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD714d0IR7Yl3"},
{"text": "I think he's a success story, to be honest. There isn't much to be done in business without big ideas. The status quo is what stymies markets from becoming engines that favor philanthropy, actually. The environment is always a concern, and so is privacy; on the other hand, look at all that Oracle has done... It's incredible. Without advances in technology for civil, medical, and information, we may not be able to keep with the pace of humanity's growth.﻿", "time": "3 years ago", "author": "Susan Allen", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD71C5i8d7SKj"},
{"text": "Lester Barrett, what have you done personally for humanity that made you better than Larry Allison?﻿", "time": "3 years ago (edited)", "author": "Sam Boris", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD71L0V4UQVEo"},
{"text": "+Samuel Atem So are you an Oracle employee trying to look good, or just hoping for a job?  Do you understand that Ellison is a public figure?  That means millions of people are going to have opinions about him, some positive, and some negative.  People are going to express those opinions, and rightly so.  If you go to a restaurant and express the opinion that your meal is substandard, does your date ask what have you cooked lately that tastes better?  If you express your disgust at the way GM has been covering up defective ignition switches for years, do your friends ask you what you have personally done about auto safety?  Does it make you better than GM to complain about their safety policies?  If you criticize Wall Street bankers, does your mother ask you what makes you better than them?   \n\nTell me this:  Do you feel that whenever someone anywhere criticizes anyone, they are implying that they are better than that person?  Also, when someone makes a comment on the internet, do you feel that they need to defend their comment to every nitwit that comes along, such as yourself?\n\nAnd for your information, I do believe that on a proportional scale, I am more generous with my money than your would-be boss.﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD71MFGw64Iv_"},
{"text": "And Obama will be remembered as the biggest failure as president. making George Bush look like a genius\n. As for Larry, you are just jealous that you will never even accomplish half the things he has. loser﻿", "time": "3 years ago (edited)", "author": "kellykinsellives", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD71V2SzbRqP9"},
{"text": "+Lester Barrett this video didnt cover his whole life, we dont know what he doing for humanity cause he has the RIGHT to show or NOT SHOW, everything in this video HE KNEW was go be in it, so you can say he did or hasnt done anything for humanity, this video was simply made to INSPIRE if you ask me (just my opinion)﻿", "time": "3 years ago", "author": "KeAndre Jones", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD71bXlhzl8Ym"},
{"text": "+Lester Barrett Wow u people always find a way to put other successful people down because of pure jealousy jealousy. My runs a hf/pe firm and has a near netwoth. It is the only way to be successful in this world. It is always about competition and who is willing to risk the most. ﻿", "time": "3 years ago", "author": "john Bohn", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD72FW_S1DlIb"},
{"text": "+john Bohn go fuck yourself, mr. amateur psychologist.﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD72FqEu797Px"},
{"text": "ok +Lester Barrett go back to your shitty miserable life of jealousy while blow through your years salary in a day in monaco.﻿", "time": "3 years ago", "author": "john Bohn", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD72H764arUcp"},
{"text": ":DDDDDDDDDD loved the Bush part :D﻿", "time": "3 years ago", "author": "TmX", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD72UeeqxcMHE"},
{"text": "Who cares dude, we are all here for let's say roughly 80 years. Do the best you can to have the best time you can in that 80 years, because give it 200 years and we are all gone. If making money and being the best gives him the most out of his little piece of time let him be. If you're this jealous to comment on a video of him, maybe you need to go out and start making something of yourself too﻿", "time": "3 years ago", "author": "KalvickQT", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD72VM90lRpJ4"},
{"text": "+KalvickQT - Why is it that all you morons immediately think that negative comments about Ellison imply jealousy?  Get a brain, dude!﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD72VMjjfI8ow"},
{"text": "+Lester Barrett you're jealous just admit it you bitch!!﻿", "time": "3 years ago", "author": "iSam72", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD72cCvkEDC6S"},
{"text": "Nitwit!﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD72dxY4epuyr"},
{"text": "You make me sick Lester. Get a real job and help people yourself. Do not bother people based on their own success!﻿", "time": "3 years ago", "author": "DontFuckWitDreDay", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD72tWb06hp6l"},
{"text": "+DontFuckWitDreDay Dumbass, I am successful, 12 years retired, and don't need a job.  I do help people regularly in many ways, including financial.  \n\nDumbass, I am certainly not bothering Larry.  You don't need to defend him.  He won't reward you with a job!  Besides, it is not about his success, for which I have great admiration.  It is about social responsibility.\n\nDumbass, if it is that easy for you to get sick, you should see a doctor for sure.  In this case, a psychiatrist might be the best choice.  \n\nDumbass, don't bother to respond and further highlight your own ignorance, inane comments, and commercial powerlessness.\n\nDumbass, get a life.﻿", "time": "3 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD72tZyYt1WQt"},
{"text": "+Maestro Drew I think this is a donation whorth more than any quantity of dollars, by the way I'm and indirect beneficiary of that because I'm working developing relational databases he created with his team in Orace, and I'm far away from usa in a third world country.﻿", "time": "3 years ago", "author": "Luis Guillermo Moreno", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD72u9vav-Myn"},
{"text": "You're just another hater. Go get a life﻿", "time": "3 years ago", "author": "cedric mayfield", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD72yOl-BsAfi"},
{"text": "How valuable is being remembered to a dead man.﻿", "time": "3 years ago", "author": "Walter Armstrong", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD74M7D5u-FYI"},
{"text": "Envy﻿", "time": "3 years ago", "author": "Grandma", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD757nLlJuBuW"},
{"text": "What will you jealous fucks be remembered for?﻿", "time": "3 years ago", "author": "Dax man", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD75FhA42CoBm"},
{"text": "+Dax man Posting Youtube hate comments?﻿", "time": "3 years ago", "author": "noxy flex", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD75oFfBjl9s6"},
{"text": "+Dax man lol...achievement is the new materialism .... you can't take achievement with you .... it doesn't make you special no matter what you achieve .... anything done in life is done with others, no one person makes anything worthwhile happen alone....a worthwhile person is someone who treats others with respect  ..... we really don't need any more people like Ellison in the world ﻿", "time": "3 years ago", "author": "Pablo Rages", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD75ot7I9pyNL"},
{"text": "Well spoken﻿", "time": "3 years ago (edited)", "author": "wimpie dempsey", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD75oz6ksgm7r"},
{"text": "You use oracle every day and are too stupid to realize it. No one is going to forget about oracle, it's bigger than every right now﻿", "time": "2 years ago", "author": "Jmack1lla", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD794PhYPNmgP"},
{"text": "+Lester Barrett what did you do for humanity? Don't take my words as offensive.. i just need an answer﻿", "time": "2 years ago", "author": "apurv singh", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7CTlS-azbaU"},
{"text": "+Lester Barrett What have you done for humanity before you criticise another person, I don't like larry but I'm just saying lmao﻿", "time": "2 years ago", "author": "Rashid Sa'di", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7CaEDWC3h_B"},
{"text": "Go fuck yourself, jerk!﻿", "time": "2 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7CaGtzwd8RD"},
{"text": "+Lester Barrett you still haven't answered my question so I am going to assume you have done nothing for humanity except criticise other people for not doing anything for society, I guess that's your legacy in life lmaoooooo﻿", "time": "2 years ago", "author": "Rashid Sa'di", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7CalTZoYSEz"},
{"text": "Go fuck yourself.﻿", "time": "2 years ago", "author": "Lester Barrett", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7CamlfbVh8S"},
{"text": "+Lester Barrett would you like to see me do that to myself you faggot lmao ﻿", "time": "2 years ago", "author": "Rashid Sa'di", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD7CjXsB3rtC2"},
{"text": "He'll be remembered as a multi-billionaire champion whom once built one of the biggest companies on earth. What's so wrong with that?﻿", "time": "4 months ago", "author": "A Cool Name", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD8WS8Y9df4FS"},
{"text": "What have you done ?﻿", "time": "4 months ago", "author": "Teboho Moloi", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD8WitXJ_TDTh"},
{"text": "Lester Barrett he said he'll give away the half of his fortune﻿", "time": "4 months ago", "author": "Jonas Jezussek", "cid": "Ugh1_08IKyELN3gCoAEC.7-H0Z7-KEQD8Wz-NkDTRKN"},
{"text": "\"Warrior\"?  If one were to check his bio, would Ellison have served in Vietnam, or would one find that a college dropout somehow was not drafted?﻿", "time": "3 years ago", "author": "D Storm", "cid": "UgjmaZEPX6jPVXgCoAEC"},
{"text": "I am a samurai warrior too ﻿", "time": "3 years ago", "author": "Elyse Cohen", "cid": "Ugh76oSrYiJGCngCoAEC"},
{"text": "Brilliance Runs in the Ellison Family!﻿", "time": "3 years ago", "author": "Prescott Ellison", "cid": "UgizzwjCnxjyUHgCoAEC"},
{"text": "lmao @1:34 what kind of bugatti is that ﻿", "time": "3 years ago", "author": "neettim", "cid": "UghRxhSjZCU6XngCoAEC"},
{"text": "+neettim a custom-made Bugatti........﻿", "time": "2 years ago", "author": "Rashid Sa'di", "cid": "UghRxhSjZCU6XngCoAEC.7-H0Z7-GANE7DYDXARZVSo"},
{"text": "oh please. he should wear self adhesive eyebrows. ﻿", "time": "3 years ago", "author": "swankrecords", "cid": "UgirXY68WUqnx3gCoAEC"},
{"text": "Narcissist﻿", "time": "3 years ago", "author": "Shane Novak", "cid": "UghEfsqLo_xdMHgCoAEC"},
{"text": "most of these self made billionaires are..i wonder why﻿", "time": "3 years ago", "author": "the last reckoning", "cid": "UghEfsqLo_xdMHgCoAEC.7-H0Z7-G5Jg7-sMDmgofL6"},
{"text": "+the last reckoning they made shit work by rubbing rocks together, most entrepreneurs do. But that doesn't mean he needs to go around buying companies and then letting them all go at the drop of a hat so he can continue to make billions. This is more than just narcissism, this is what you call bullying.  ﻿", "time": "3 years ago", "author": "AndraBeats", "cid": "UghEfsqLo_xdMHgCoAEC.7-H0Z7-G5Jg70okvjIZ2M1"},
{"text": "+m3talh3ad I wouldn't call any billionaire a Narcissist, why? Because they fucking earned those rights, they are the 1% percent who actually fucking work their ass off.﻿", "time": "3 years ago", "author": "Drake Leslie", "cid": "UghEfsqLo_xdMHgCoAEC.7-H0Z7-G5Jg71XuPly7yb3"},
{"text": "+AndraBeats It's not called bullying, it's called business.﻿", "time": "3 years ago", "author": "SBulletproof", "cid": "UghEfsqLo_xdMHgCoAEC.7-H0Z7-G5Jg72e5YMzIirm"},
{"text": "+Drake Leslie listen I'm not discrediting what he did, he's done a lot, but there is a point when enough is enough. As of now, his net worth is $47.9 Billion, and that's from buying up companies and taking them nowhere but right into his pocket. Those are hardworking individuals making a living, and they lose their job just because good ol Larry wants to add a couple more billion to his net worth. There is no creation, there is no legacy being instilled, its just a greedy man. Mark Cuban, that's what you call a respectable Billionaire, but this guy will do anything to add more money to his networth, even if it means he outsources every job he can in order to make more. ﻿", "time": "3 years ago", "author": "AndraBeats", "cid": "UghEfsqLo_xdMHgCoAEC.7-H0Z7-G5Jg72eWBr5-Row"},
{"text": "SBulletproof creating a monopoly in private markets causes consumers to suffer. Great idea for himself but terrible consequences for consumers.﻿", "time": "3 weeks ago", "author": "c obra", "cid": "UghEfsqLo_xdMHgCoAEC.7-H0Z7-G5Jg8aUygrbfL-V"}]
